rushairer/LearnCW32/Libraries/inc/cw32f030.h
/* ==========================  Configuration of the ARM Cortex-M0+ Processor and Core Peripherals  =========================== */
#define __CM0PLUS_REV                 0x0001U   /*!< CM0PLUS Core Revision                                                  */
#define __NVIC_PRIO_BITS               2        /*!< Number of Bits used for Priority Levels                                */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                           */
#define __VTOR_PRESENT                 1        /*!< Set to 1 if CPU supports Vector Table Offset Register                  */
#define __MPU_PRESENT                  0        /*!< MPU present                                                            */
#define __FPU_PRESENT                  0        /*!< FPU present                                                            */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0plus.h"                       /*!< ARM Cortex-M0+ processor and core peripherals                             */
#include "system_cw32f030.h"                    /*!< cw32f030 System                                                           */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
#define __IM                                    __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
#define __OM                                    __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
#define __IOM                                   __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
#pragma push
#pragma anon_unions
#elif defined (__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
#pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
/* anonymous unions are enabled by default */
#elif defined (__TMS470__)
/* anonymous unions are enabled by default */
#elif defined (__TASKING__)
#pragma warning 586
#elif defined (__CSMC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc ADC (ADC)
  */

typedef struct                                  /*!< (@ 0x40012400) ADC Structure                                              */
{

    union
    {
        __IOM uint32_t CR0;                         /*!< (@ 0x00000000) Control register0                                          */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t MODE       : 3;            /*!< [3..1] desc MODE                                                          */
            __IOM uint32_t BGREN      : 1;            /*!< [4..4] desc BGREN                                                         */
            __IOM uint32_t TSEN       : 1;            /*!< [5..5] desc TSEN                                                          */
            __IOM uint32_t REF        : 2;            /*!< [7..6] desc REF                                                           */
            __IOM uint32_t CLK        : 3;            /*!< [10..8] desc CLK                                                          */
            __IOM uint32_t SAM        : 2;            /*!< [12..11] desc SAM                                                         */
            __IOM uint32_t BUF        : 1;            /*!< [13..13] desc BUF                                                         */
            __IOM uint32_t BIAS       : 2;            /*!< [15..14] desc BIAS                                                        */
        } CR0_f;
    } ;

    union
    {
        __IOM uint32_t CR1;                         /*!< (@ 0x00000004) Control register1                                          */

        struct
        {
            __IOM uint32_t CHMUX      : 4;            /*!< [3..0] desc CHMUX                                                         */
            __IM  uint32_t            : 1;
            __IOM uint32_t DISCARD    : 1;            /*!< [5..5] desc DISCARD                                                       */
            __IOM uint32_t ALIGN      : 1;            /*!< [6..6] desc ALIGN                                                         */
            __IOM uint32_t DMAEN      : 1;            /*!< [7..7] desc DMAEN                                                         */
            __IOM uint32_t WDTCH      : 4;            /*!< [11..8] desc WDTCH                                                        */
            __IM  uint32_t            : 1;
            __IOM uint32_t WDTALL     : 1;            /*!< [13..13] desc WDTALL                                                      */
        } CR1_f;
    } ;

    union
    {
        __IOM uint32_t START;                       /*!< (@ 0x00000008) desc START                                                 */

        struct
        {
            __IOM uint32_t START      : 1;            /*!< [0..0] desc START                                                         */
            __IOM uint32_t AUTOSTOP   : 1;            /*!< [1..1] desc AUTOSTOP                                                      */
        } START_f;
    } ;

    union
    {
        __IOM uint32_t SQR;                         /*!< (@ 0x0000000C) desc SQR                                                   */

        struct
        {
            __IOM uint32_t SQR0       : 4;            /*!< [3..0] desc SQR0                                                          */
            __IOM uint32_t SQR1       : 4;            /*!< [7..4] desc SQR1                                                          */
            __IOM uint32_t SQR2       : 4;            /*!< [11..8] desc SQR2                                                         */
            __IOM uint32_t SQR3       : 4;            /*!< [15..12] desc SQR3                                                        */
            __IOM uint32_t ENS        : 2;            /*!< [17..16] desc ENS                                                         */
        } SQR_f;
    } ;

    union
    {
        __IOM uint32_t CR2;                         /*!< (@ 0x00000010) Control register2                                          */

        struct
        {
            __IOM uint32_t CNT        : 8;            /*!< [7..0] desc CNT                                                           */
            __IOM uint32_t ACCEN      : 1;            /*!< [8..8] desc ACCEN                                                         */
            __IOM uint32_t ACCRST     : 1;            /*!< [9..9] desc ACCRST                                                        */
        } CR2_f;
    } ;

    union
    {
        __IOM uint32_t VTH;                         /*!< (@ 0x00000014) desc VTH                                                   */

        struct
        {
            __IOM uint32_t VTH        : 12;           /*!< [11..0] desc VTH                                                          */
        } VTH_f;
    } ;

    union
    {
        __IOM uint32_t VTL;                         /*!< (@ 0x00000018) desc VTL                                                   */

        struct
        {
            __IOM uint32_t VTL        : 12;           /*!< [11..0] desc VTL                                                          */
        } VTL_f;
    } ;

    union
    {
        __IOM uint32_t TRIGGER;                     /*!< (@ 0x0000001C) desc TRIGGER                                               */

        struct
        {
            __IOM uint32_t ATIM       : 1;            /*!< [0..0] desc ATIM                                                          */
            __IOM uint32_t GTIM1      : 1;            /*!< [1..1] desc GTIM1                                                         */
            __IOM uint32_t GTIM2      : 1;            /*!< [2..2] desc GTIM2                                                         */
            __IOM uint32_t GTIM3      : 1;            /*!< [3..3] desc GTIM3                                                         */
            __IOM uint32_t GTIM4      : 1;            /*!< [4..4] desc GTIM4                                                         */
            __IOM uint32_t BTIM1      : 1;            /*!< [5..5] desc BTIM1                                                         */
            __IOM uint32_t BTIM2      : 1;            /*!< [6..6] desc BTIM2                                                         */
            __IOM uint32_t BTIM3      : 1;            /*!< [7..7] desc BTIM3                                                         */
            __IOM uint32_t UART1      : 1;            /*!< [8..8] desc UART1                                                         */
            __IOM uint32_t UART2      : 1;            /*!< [9..9] desc UART2                                                         */
            __IOM uint32_t UART3      : 1;            /*!< [10..10] desc UART3                                                       */
            __IOM uint32_t SPI1       : 1;            /*!< [11..11] desc SPI1                                                        */
            __IOM uint32_t SPI2       : 1;            /*!< [12..12] desc SPI2                                                        */
            __IOM uint32_t I2C1       : 1;            /*!< [13..13] desc I2C1                                                        */
            __IOM uint32_t I2C2       : 1;            /*!< [14..14] desc I2C2                                                        */
            __IOM uint32_t DMA        : 1;            /*!< [15..15] desc DMA                                                         */
        } TRIGGER_f;
    } ;

    union
    {
        __IM  uint32_t RESULT0;                     /*!< (@ 0x00000020) desc RESULT0                                               */

        struct
        {
            __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
        } RESULT0_f;
    } ;

    union
    {
        __IM  uint32_t RESULT1;                     /*!< (@ 0x00000024) desc RESULT1                                               */

        struct
        {
            __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
        } RESULT1_f;
    } ;

    union
    {
        __IM  uint32_t RESULT2;                     /*!< (@ 0x00000028) desc RESULT2                                               */

        struct
        {
            __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
        } RESULT2_f;
    } ;

    union
    {
        __IM  uint32_t RESULT3;                     /*!< (@ 0x0000002C) desc RESULT3                                               */

        struct
        {
            __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
        } RESULT3_f;
    } ;

    union
    {
        __IM  uint32_t RESULTACC;                   /*!< (@ 0x00000030) desc RESULTACC                                             */

        struct
        {
            __IM  uint32_t RESULT     : 24;           /*!< [23..0] desc RESULT                                                       */
        } RESULTACC_f;
    } ;

    union
    {
        __IOM uint32_t IER;                         /*!< (@ 0x00000034) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t EOC        : 1;            /*!< [0..0] desc EOC                                                           */
            __IOM uint32_t EOS        : 1;            /*!< [1..1] desc EOS                                                           */
            __IOM uint32_t EOA        : 1;            /*!< [2..2] desc EOA                                                           */
            __IOM uint32_t WDTL       : 1;            /*!< [3..3] desc WDTL                                                          */
            __IOM uint32_t WDTH       : 1;            /*!< [4..4] desc WDTH                                                          */
            __IOM uint32_t WDTR       : 1;            /*!< [5..5] desc WDTR                                                          */
            __IOM uint32_t OVW        : 1;            /*!< [6..6] desc OVW                                                           */
        } IER_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x00000038) Interrupt flag clear register                              */

        struct
        {
            __IOM uint32_t EOC        : 1;            /*!< [0..0] desc EOC                                                           */
            __IOM uint32_t EOS        : 1;            /*!< [1..1] desc EOS                                                           */
            __IOM uint32_t EOA        : 1;            /*!< [2..2] desc EOA                                                           */
            __IOM uint32_t WDTL       : 1;            /*!< [3..3] desc WDTL                                                          */
            __IOM uint32_t WDTH       : 1;            /*!< [4..4] desc WDTH                                                          */
            __IOM uint32_t WDTR       : 1;            /*!< [5..5] desc WDTR                                                          */
            __IOM uint32_t OVW        : 1;            /*!< [6..6] desc OVW                                                           */
        } ICR_f;
    } ;

    union
    {
        __IM  uint32_t ISR;                         /*!< (@ 0x0000003C) Interrupt status register                                  */

        struct
        {
            __IM  uint32_t EOC        : 1;            /*!< [0..0] desc EOC                                                           */
            __IM  uint32_t EOS        : 1;            /*!< [1..1] desc EOS                                                           */
            __IM  uint32_t EOA        : 1;            /*!< [2..2] desc EOA                                                           */
            __IM  uint32_t WDTL       : 1;            /*!< [3..3] desc WDTL                                                          */
            __IM  uint32_t WDTH       : 1;            /*!< [4..4] desc WDTH                                                          */
            __IM  uint32_t WDTR       : 1;            /*!< [5..5] desc WDTR                                                          */
            __IM  uint32_t OVW        : 1;            /*!< [6..6] desc OVW                                                           */
            __IM  uint32_t READY      : 1;            /*!< [7..7] desc READY                                                         */
        } ISR_f;
    } ;

} ADC_TypeDef;                                     /*!< Size = 140 (0x8c)                                                         */



/* =========================================================================================================================== */
/* ================                                           ATIM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc ATIM (ATIM)
  */

typedef struct                                  /*!< (@ 0x40012C00) ATIM Structure                                             */
{

    union
    {
        __IOM uint32_t ARR;                         /*!< (@ 0x00000000) desc ARR                                                   */

        struct
        {
            __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
        } ARR_f;
    } ;

    union
    {
        __IOM uint32_t CNT;                         /*!< (@ 0x00000004) desc CNT                                                   */

        struct
        {
            __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
        } CNT_f;
    } ;
    __IM  uint32_t  RESERVED;

    union
    {
        __IOM uint32_t CR;                          /*!< (@ 0x0000000C) desc CR                                                    */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t COMP       : 1;            /*!< [1..1] desc COMP                                                          */
            __IOM uint32_t CT         : 1;            /*!< [2..2] desc CT                                                            */
            __IOM uint32_t PWM2S      : 1;            /*!< [3..3] desc PWM2S                                                         */
            __IOM uint32_t PRS        : 3;            /*!< [6..4] desc PRS                                                           */
            __IOM uint32_t BUFPEN     : 1;            /*!< [7..7] desc BUFPEN                                                        */
            __IM  uint32_t            : 2;
            __IOM uint32_t UIE        : 1;            /*!< [10..10] desc UIE                                                         */
            __IM  uint32_t            : 1;
            __IOM uint32_t MODE       : 2;            /*!< [13..12] Please keep 10/11                                                */
            __IOM uint32_t ONESHOT    : 1;            /*!< [14..14] desc ONESHOT                                                     */
            __IM  uint32_t            : 1;
            __IOM uint32_t OCCS       : 1;            /*!< [16..16] desc OCCS                                                        */
            __IOM uint32_t URS        : 1;            /*!< [17..17] desc URS                                                         */
            __IM  uint32_t            : 1;
            __IOM uint32_t TIE        : 1;            /*!< [19..19] desc TIE                                                         */
            __IOM uint32_t BIE        : 1;            /*!< [20..20] desc BIE                                                         */
            __IOM uint32_t CISA       : 2;            /*!< [22..21] desc CISA                                                        */
            __IOM uint32_t OCCE       : 1;            /*!< [23..23] desc OCCE                                                        */
            __IOM uint32_t TG         : 1;            /*!< [24..24] desc TG                                                          */
            __IOM uint32_t UG         : 1;            /*!< [25..25] desc UG                                                          */
            __IOM uint32_t BG         : 1;            /*!< [26..26] desc BG                                                          */
            __IOM uint32_t DIR        : 1;            /*!< [27..27] desc DIR                                                         */
            __IOM uint32_t OVE        : 1;            /*!< [28..28] desc OVE                                                         */
            __IOM uint32_t UNDE       : 1;            /*!< [29..29] desc UNDE                                                        */
        } CR_f;
    } ;

    union
    {
        __IM  uint32_t ISR;                         /*!< (@ 0x00000010) desc ISR                                                   */

