rushairer/LearnCW32/Libraries/inc/cw32f030.h
        struct
        {
            __IM  uint32_t UIF        : 1;            /*!< [0..0] desc UIF                                                           */
            __IM  uint32_t            : 1;
            __IM  uint32_t C1AF       : 1;            /*!< [2..2] desc C1AF                                                          */
            __IM  uint32_t C2AF       : 1;            /*!< [3..3] desc C2AF                                                          */
            __IM  uint32_t C3AF       : 1;            /*!< [4..4] desc C3AF                                                          */
            __IM  uint32_t C1BF       : 1;            /*!< [5..5] desc C1BF                                                          */
            __IM  uint32_t C2BF       : 1;            /*!< [6..6] desc C2BF                                                          */
            __IM  uint32_t C3BF       : 1;            /*!< [7..7] desc C3BF                                                          */
            __IM  uint32_t C1AE       : 1;            /*!< [8..8] desc C1AE                                                          */
            __IM  uint32_t C2AE       : 1;            /*!< [9..9] desc C2AE                                                          */
            __IM  uint32_t C3AE       : 1;            /*!< [10..10] desc C3AE                                                        */
            __IM  uint32_t C1BE       : 1;            /*!< [11..11] desc C1BE                                                        */
            __IM  uint32_t C2BE       : 1;            /*!< [12..12] desc C2BE                                                        */
            __IM  uint32_t C3BE       : 1;            /*!< [13..13] desc C3BE                                                        */
            __IM  uint32_t BIF        : 1;            /*!< [14..14] desc BIF                                                         */
            __IM  uint32_t TIF        : 1;            /*!< [15..15] desc TIF                                                         */
            __IM  uint32_t OVF        : 1;            /*!< [16..16] desc OVF                                                         */
            __IM  uint32_t UNDF       : 1;            /*!< [17..17] desc UNDF                                                        */
            __IM  uint32_t C4AF       : 1;            /*!< [18..18] desc C4AF                                                        */
        } ISR_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x00000014) desc ICR                                                   */

        struct
        {
            __IOM uint32_t UIF        : 1;            /*!< [0..0] desc UIF                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t C1AF       : 1;            /*!< [2..2] desc C1AF                                                          */
            __IOM uint32_t C2AF       : 1;            /*!< [3..3] desc C2AF                                                          */
            __IOM uint32_t C3AF       : 1;            /*!< [4..4] desc C3AF                                                          */
            __IOM uint32_t C1BF       : 1;            /*!< [5..5] desc C1BF                                                          */
            __IOM uint32_t C2BF       : 1;            /*!< [6..6] desc C2BF                                                          */
            __IOM uint32_t C3BF       : 1;            /*!< [7..7] desc C3BF                                                          */
            __IOM uint32_t C1AE       : 1;            /*!< [8..8] desc C1AE                                                          */
            __IOM uint32_t C2AE       : 1;            /*!< [9..9] desc C2AE                                                          */
            __IOM uint32_t C3AE       : 1;            /*!< [10..10] desc C3AE                                                        */
            __IOM uint32_t C1BE       : 1;            /*!< [11..11] desc C1BE                                                        */
            __IOM uint32_t C2BE       : 1;            /*!< [12..12] desc C2BE                                                        */
            __IOM uint32_t C3BE       : 1;            /*!< [13..13] desc C3BE                                                        */
            __IOM uint32_t BIF        : 1;            /*!< [14..14] desc BIF                                                         */
            __IOM uint32_t TIF        : 1;            /*!< [15..15] desc TIF                                                         */
            __IOM uint32_t OVF        : 1;            /*!< [16..16] desc OVF                                                         */
            __IOM uint32_t UNDF       : 1;            /*!< [17..17] desc UNDF                                                        */
            __IOM uint32_t C4AF       : 1;            /*!< [18..18] desc C4AF                                                        */
        } ICR_f;
    } ;

    union
    {
        __IOM uint32_t MSCR;                        /*!< (@ 0x00000018) desc MSCR                                                  */

        struct
        {
            __IOM uint32_t MMS        : 3;            /*!< [2..0] desc MMS                                                           */
            __IOM uint32_t CCDS       : 1;            /*!< [3..3] desc CCDS                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t TS         : 3;            /*!< [7..5] desc TS                                                            */
            __IOM uint32_t SMS        : 3;            /*!< [10..8] desc SMS                                                          */
            __IOM uint32_t IA1S       : 1;            /*!< [11..11] desc IA1S                                                        */
            __IOM uint32_t IB1S       : 1;            /*!< [12..12] desc IB1S                                                        */
        } MSCR_f;
    } ;

    union
    {
        __IOM uint32_t FLTR;                        /*!< (@ 0x0000001C) desc FLTR                                                  */

        struct
        {
            __IOM uint32_t OCM1AFLT1A : 3;            /*!< [2..0] desc OCM1AFLT1A                                                    */
            __IOM uint32_t CCP1A      : 1;            /*!< [3..3] desc CCP1A                                                         */
            __IOM uint32_t OCM1BFLT1B : 3;            /*!< [6..4] desc OCM1BFLT1B                                                    */
            __IOM uint32_t CCP1B      : 1;            /*!< [7..7] desc CCP1B                                                         */
            __IOM uint32_t OCM2AFLT2A : 3;            /*!< [10..8] desc OCM2AFLT2A                                                   */
            __IOM uint32_t CCP2A      : 1;            /*!< [11..11] desc CCP2A                                                       */
            __IOM uint32_t OCM2BFLT2B : 3;            /*!< [14..12] desc OCM2BFLT2B                                                  */
            __IOM uint32_t CCP2B      : 1;            /*!< [15..15] desc CCP2B                                                       */
            __IOM uint32_t OCM3AFLT3A : 3;            /*!< [18..16] desc OCM3AFLT3A                                                  */
            __IOM uint32_t CCP3A      : 1;            /*!< [19..19] desc CCP3A                                                       */
            __IOM uint32_t OCM3BFLT3B : 3;            /*!< [22..20] desc OCM3BFLT3B                                                  */
            __IOM uint32_t CCP3B      : 1;            /*!< [23..23] desc CCP3B                                                       */
            __IOM uint32_t FLTBK      : 3;            /*!< [26..24] desc FLTBK                                                       */
            __IOM uint32_t BKP        : 1;            /*!< [27..27] desc BKP                                                         */
            __IOM uint32_t FLTET      : 3;            /*!< [30..28] desc FLTET                                                       */
            __IOM uint32_t ETP        : 1;            /*!< [31..31] desc ETP                                                         */
        } FLTR_f;
    } ;

    union
    {
        __IOM uint32_t TRIG;                        /*!< (@ 0x00000020) desc TRIG                                                  */

        struct
        {
            __IOM uint32_t UEVE       : 1;            /*!< [0..0] desc UEVE                                                          */
            __IOM uint32_t CM1AE      : 1;            /*!< [1..1] desc CM1AE                                                         */
            __IOM uint32_t CM2AE      : 1;            /*!< [2..2] desc CM2AE                                                         */
            __IOM uint32_t CM3AE      : 1;            /*!< [3..3] desc CM3AE                                                         */
            __IOM uint32_t CM1BE      : 1;            /*!< [4..4] desc CM1BE                                                         */
            __IOM uint32_t CM2BE      : 1;            /*!< [5..5] desc CM2BE                                                         */
            __IOM uint32_t CM3BE      : 1;            /*!< [6..6] desc CM3BE                                                         */
            __IOM uint32_t ADTE       : 1;            /*!< [7..7] desc ADTE                                                          */
        } TRIG_f;
    } ;

    union
    {
        __IOM uint32_t CH1CR;                       /*!< (@ 0x00000024) desc CH1CR                                                 */

        struct
        {
            __IOM uint32_t BKSA       : 2;            /*!< [1..0] desc BKSA                                                          */
            __IOM uint32_t BKSB       : 2;            /*!< [3..2] desc BKSB                                                          */
            __IOM uint32_t CSA        : 1;            /*!< [4..4] desc CSA                                                           */
            __IOM uint32_t CSB        : 1;            /*!< [5..5] desc CSB                                                           */
            __IOM uint32_t BUFEA      : 1;            /*!< [6..6] desc BUFEA                                                         */
            __IOM uint32_t BUFEB      : 1;            /*!< [7..7] desc BUFEB                                                         */
            __IOM uint32_t CIEA       : 1;            /*!< [8..8] desc CIEA                                                          */
            __IOM uint32_t CIEB       : 1;            /*!< [9..9] desc CIEB                                                          */
            __IOM uint32_t CDEA       : 1;            /*!< [10..10] desc CDEA                                                        */
            __IOM uint32_t CDEB       : 1;            /*!< [11..11] desc CDEB                                                        */
            __IOM uint32_t CISB       : 2;            /*!< [13..12] desc CISB                                                        */
            __IOM uint32_t CCGA       : 1;            /*!< [14..14] desc CCGA                                                        */
            __IOM uint32_t CCGB       : 1;            /*!< [15..15] desc CCGB                                                        */
        } CH1CR_f;
    } ;

    union
    {
        __IOM uint32_t CH2CR;                       /*!< (@ 0x00000028) desc CH2CR                                                 */

        struct
        {
            __IOM uint32_t BKSA       : 2;            /*!< [1..0] desc BKSA                                                          */
            __IOM uint32_t BKSB       : 2;            /*!< [3..2] desc BKSB                                                          */
            __IOM uint32_t CSA        : 1;            /*!< [4..4] desc CSA                                                           */
            __IOM uint32_t CSB        : 1;            /*!< [5..5] desc CSB                                                           */
            __IOM uint32_t BUFEA      : 1;            /*!< [6..6] desc BUFEA                                                         */
            __IOM uint32_t BUFEB      : 1;            /*!< [7..7] desc BUFEB                                                         */
            __IOM uint32_t CIEA       : 1;            /*!< [8..8] desc CIEA                                                          */
            __IOM uint32_t CIEB       : 1;            /*!< [9..9] desc CIEB                                                          */
            __IOM uint32_t CDEA       : 1;            /*!< [10..10] desc CDEA                                                        */
            __IOM uint32_t CDEB       : 1;            /*!< [11..11] desc CDEB                                                        */
            __IOM uint32_t CISB       : 2;            /*!< [13..12] desc CISB                                                        */
            __IOM uint32_t CCGA       : 1;            /*!< [14..14] desc CCGA                                                        */
            __IOM uint32_t CCGB       : 1;            /*!< [15..15] desc CCGB                                                        */
        } CH2CR_f;
    } ;

    union
    {
        __IOM uint32_t CH3CR;                       /*!< (@ 0x0000002C) desc CH3CR                                                 */

        struct
        {
            __IOM uint32_t BKSA       : 2;            /*!< [1..0] desc BKSA                                                          */
            __IOM uint32_t BKSB       : 2;            /*!< [3..2] desc BKSB                                                          */
            __IOM uint32_t CSA        : 1;            /*!< [4..4] desc CSA                                                           */
            __IOM uint32_t CSB        : 1;            /*!< [5..5] desc CSB                                                           */
            __IOM uint32_t BUFEA      : 1;            /*!< [6..6] desc BUFEA                                                         */
            __IOM uint32_t BUFEB      : 1;            /*!< [7..7] desc BUFEB                                                         */
            __IOM uint32_t CIEA       : 1;            /*!< [8..8] desc CIEA                                                          */
            __IOM uint32_t CIEB       : 1;            /*!< [9..9] desc CIEB                                                          */
            __IOM uint32_t CDEA       : 1;            /*!< [10..10] desc CDEA                                                        */
            __IOM uint32_t CDEB       : 1;            /*!< [11..11] desc CDEB                                                        */
            __IOM uint32_t CISB       : 2;            /*!< [13..12] desc CISB                                                        */
            __IOM uint32_t CCGA       : 1;            /*!< [14..14] desc CCGA                                                        */
            __IOM uint32_t CCGB       : 1;            /*!< [15..15] desc CCGB                                                        */
        } CH3CR_f;
    } ;

    union
    {
        __IOM uint32_t DTR;                         /*!< (@ 0x00000030) desc DTR                                                   */

        struct
        {
            __IOM uint32_t DTR        : 8;            /*!< [7..0] desc DTR                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t DTEN       : 1;            /*!< [9..9] desc DTEN                                                          */
            __IOM uint32_t BKE        : 1;            /*!< [10..10] desc BKE                                                         */
            __IOM uint32_t AOE        : 1;            /*!< [11..11] desc AOE                                                         */
            __IOM uint32_t MOE        : 1;            /*!< [12..12] desc MOE                                                         */
            __IOM uint32_t SAFEEN     : 1;            /*!< [13..13] desc SAFEEN                                                      */
            __IOM uint32_t VCE        : 1;            /*!< [14..14] desc VCE                                                         */
        } DTR_f;
    } ;

    union
    {
        __IOM uint32_t RCR;                         /*!< (@ 0x00000034) desc RCR                                                   */

        struct
        {
            __IOM uint32_t RCR        : 8;            /*!< [7..0] desc RCR                                                           */
            __IOM uint32_t OV         : 1;            /*!< [8..8] desc OV                                                            */
            __IOM uint32_t UD         : 1;            /*!< [9..9] desc UD                                                            */
        } RCR_f;
    } ;
    __IM  uint32_t  RESERVED1;

    union
    {
        __IOM uint32_t CH1CCRA;                     /*!< (@ 0x0000003C) desc CH1CCRA                                               */

        struct
        {
            __IOM uint32_t CCR1A      : 16;           /*!< [15..0] desc CCR1A                                                        */
        } CH1CCRA_f;
    } ;

    union
    {
        __IOM uint32_t CH1CCRB;                     /*!< (@ 0x00000040) desc CH1CCRB                                               */

        struct
        {
            __IOM uint32_t CCR1B      : 16;           /*!< [15..0] desc CCR1B                                                        */
        } CH1CCRB_f;
    } ;

    union
    {
        __IOM uint32_t CH2CCRA;                     /*!< (@ 0x00000044) desc CH2CCRA                                               */

        struct
        {
            __IOM uint32_t CCR2A      : 16;           /*!< [15..0] desc CCR2A                                                        */
        } CH2CCRA_f;
    } ;

    union
    {
        __IOM uint32_t CH2CCRB;                     /*!< (@ 0x00000048) desc CH2CCRB                                               */

        struct
        {
            __IOM uint32_t CCR2B      : 16;           /*!< [15..0] desc CCR2B                                                        */
        } CH2CCRB_f;
    } ;

    union
    {
        __IOM uint32_t CH3CCRA;                     /*!< (@ 0x0000004C) desc CH3CCRA                                               */

        struct
        {
            __IOM uint32_t CCR3A      : 16;           /*!< [15..0] desc CCR3A                                                        */
        } CH3CCRA_f;
    } ;

    union
    {
        __IOM uint32_t CH3CCRB;                     /*!< (@ 0x00000050) desc CH3CCRB                                               */

        struct
        {
            __IOM uint32_t CCR3B      : 16;           /*!< [15..0] desc CCR3B                                                        */
        } CH3CCRB_f;
    } ;

    union
    {
        __IOM uint32_t CH4CCR;                      /*!< (@ 0x00000054) desc CH4CCR                                                */

        struct
        {
            __IOM uint32_t CCR4       : 16;           /*!< [15..0] desc CCR4                                                         */
        } CH4CCR_f;
    } ;

    union
    {
        __IOM uint32_t CH4CR;                       /*!< (@ 0x00000058) desc CH4CR                                                 */

        struct
        {
            __IOM uint32_t BUFE       : 1;            /*!< [0..0] desc BUFE                                                          */
            __IOM uint32_t CIE        : 1;            /*!< [1..1] desc CIE                                                           */
            __IOM uint32_t CDE        : 1;            /*!< [2..2] desc CDE                                                           */
            __IOM uint32_t CIS        : 2;            /*!< [4..3] desc CIS                                                           */
            __IOM uint32_t C4EN       : 1;            /*!< [5..5] desc C4EN                                                          */
        } CH4CR_f;
    } ;
} ATIM_TypeDef;                                    /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                            AWT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc AWT (AWT)
  */

typedef struct                                  /*!< (@ 0x40014C00) AWT Structure                                              */
{

    union
    {
        __IOM uint32_t CR;                          /*!< (@ 0x00000000) Control register                                           */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t MD         : 2;            /*!< [2..1] desc MD                                                            */
            __IM  uint32_t            : 1;
            __IOM uint32_t PRS        : 4;            /*!< [7..4] desc PRS                                                           */
            __IOM uint32_t SRC        : 3;            /*!< [10..8] desc SRC                                                          */
        } CR_f;
    } ;

    union
    {
        __IOM uint32_t ARR;                         /*!< (@ 0x00000004) Auto reload register                                       */

        struct
        {
            __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
        } ARR_f;
    } ;

    union
    {
        __IM  uint32_t CNT;                         /*!< (@ 0x00000008) counter                                                    */

        struct
        {
            __IM  uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
        } CNT_f;
    } ;
    __IM  uint32_t  RESERVED;

    union
    {
        __IOM uint32_t IER;                         /*!< (@ 0x00000010) Interrupt enable register                                  */

        struct
        {
            __IM  uint32_t            : 3;
            __IOM uint32_t UD         : 1;            /*!< [3..3] desc UD                                                            */
        } IER_f;
    } ;

