rushairer/LearnCW32/Libraries/inc/cw32f030.h
    union
    {
        __IM  uint32_t ISR;                         /*!< (@ 0x00000014) Interrupt status register                                  */

        struct
        {
            __IM  uint32_t            : 3;
            __IM  uint32_t UD         : 1;            /*!< [3..3] desc UD                                                            */
        } ISR_f;
    } ;
    __IM  uint32_t  RESERVED1;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x0000001C) Interrupt flag clear register                              */

        struct
        {
            __IM  uint32_t            : 3;
            __IOM uint32_t UD         : 1;            /*!< [3..3] desc UD                                                            */
        } ICR_f;
    } ;
} AWT_TypeDef;                                     /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                           BTIM1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Base Timer 1 (BTIM1)
  */

typedef struct                                  /*!< (@ 0x40014800) BTIM1 Structure                                            */
{

    union
    {
        __IOM uint32_t ARR;                         /*!< (@ 0x00000000) Auto Reload Register                                       */

        struct
        {
            __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
        } ARR_f;
    } ;

    union
    {
        __IOM uint32_t CNT;                         /*!< (@ 0x00000004) Counter Register                                           */

        struct
        {
            __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
        } CNT_f;
    } ;
    __IM  uint32_t  RESERVED;

    union
    {
        __IOM uint32_t ACR;                         /*!< (@ 0x0000000C) Advanced Control register                                  */

        struct
        {
            __IM  uint32_t            : 4;
            __IOM uint32_t ETRFLT     : 3;            /*!< [6..4] desc ETRFLT                                                        */
        } ACR_f;
    } ;

    union
    {
        __IOM uint32_t BCR;                         /*!< (@ 0x00000010) Base Control register                                      */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t MODE       : 2;            /*!< [2..1] desc MODE                                                          */
            __IOM uint32_t TRS        : 1;            /*!< [3..3] desc TRS                                                           */
            __IOM uint32_t POL        : 1;            /*!< [4..4] desc POL                                                           */
            __IOM uint32_t ONESHOT    : 1;            /*!< [5..5] desc ONESHOT                                                       */
            __IOM uint32_t TOGEN      : 1;            /*!< [6..6] desc TOGEN                                                         */
            __IOM uint32_t PRS        : 4;            /*!< [10..7] desc PRS                                                          */
            __IM  uint32_t PRSSTATUS  : 4;            /*!< [14..11] desc PRSSTATUS                                                   */
        } BCR_f;
    } ;

    union
    {
        __IOM uint32_t IER;                         /*!< (@ 0x00000014) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t OV         : 1;            /*!< [0..0] desc OV                                                            */
            __IOM uint32_t TI         : 1;            /*!< [1..1] desc TI                                                            */
            __IOM uint32_t TOP        : 1;            /*!< [2..2] desc TOP                                                           */
        } IER_f;
    } ;

    union
    {
        __IM  uint32_t ISR;                         /*!< (@ 0x00000018) Interrupt status register                                  */

        struct
        {
            __IM  uint32_t OV         : 1;            /*!< [0..0] desc OV                                                            */
            __IM  uint32_t TI         : 1;            /*!< [1..1] desc TI                                                            */
            __IM  uint32_t TOP        : 1;            /*!< [2..2] desc TOP                                                           */
        } ISR_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x0000001C) Interrupt flag clear register                              */

        struct
        {
            __IOM uint32_t OV         : 1;            /*!< [0..0] desc OV                                                            */
            __IOM uint32_t TI         : 1;            /*!< [1..1] desc TI                                                            */
            __IOM uint32_t TOP        : 1;            /*!< [2..2] desc TOP                                                           */
        } ICR_f;
    } ;

    union
    {
        __IOM uint32_t DMA;                         /*!< (@ 0x00000020) DMA control register                                       */

        struct
        {
            __IOM uint32_t OV         : 1;            /*!< [0..0] desc OV                                                            */
            __IOM uint32_t TRS        : 1;            /*!< [1..1] desc TRS                                                           */
        } DMA_f;
    } ;
} BTIM_TypeDef;                                    /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc CRC (CRC)
  */

typedef struct                                  /*!< (@ 0x40023000) CRC Structure                                              */
{

    union
    {
        __IOM uint32_t CR;                          /*!< (@ 0x00000000) Control register                                           */

        struct
        {
            __IOM uint32_t MODE       : 4;            /*!< [3..0] desc MODE                                                          */
        } CR_f;
    } ;
    __IM  uint32_t  RESERVED;

    union
    {
        union
        {
            __IOM uint32_t DR32;                      /*!< (@ 0x00000008) Data register                                              */

            struct
            {
                __IOM uint32_t DR32     : 32;           /*!< [31..0] desc DR32                                                         */
            } DR32_f;
        } ;

        union
        {
            __IOM uint16_t DR16;                      /*!< (@ 0x00000008) Data register                                              */

            struct
            {
                __IOM uint16_t DR16     : 16;           /*!< [15..0] desc DR16                                                         */
            } DR16_f;
        } ;

        union
        {
            __IOM uint8_t DR8;                        /*!< (@ 0x00000008) Data register                                              */
            __IOM uint8_t DR;
            struct
            {
                __IOM uint8_t DR8       : 8;            /*!< [7..0] desc DR8                                                           */
            } DR8_f;
        } ;
    };

    union
    {
        union
        {
            __IM  uint32_t RESULT32;                  /*!< (@ 0x0000000C) Result register                                            */

            struct
            {
                __IM  uint32_t RESULT32 : 32;           /*!< [31..0] desc RESULT32                                                     */
            } RESULT32_f;
        } ;

        union
        {
            __IM  uint16_t RESULT16;                  /*!< (@ 0x0000000C) Result register                                            */
            __IM  uint16_t RESULT;

            struct
            {
                __IM  uint16_t RESULT16 : 16;           /*!< [15..0] desc RESULT16                                                     */
            } RESULT16_f;
        } ;
    };
} CRC_TypeDef;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc DMA (DMA)
  */

