rushairer/LearnCW32/Libraries/inc/cw32f030.h
typedef struct                                  /*!< (@ 0x40020000) DMA Structure                                              */
{

    union
    {
        __IM  uint32_t ISR;                         /*!< (@ 0x00000000) Interrupt status register                                  */

        struct
        {
            __IM  uint32_t TC1        : 1;            /*!< [0..0] desc TC1                                                           */
            __IM  uint32_t TE1        : 1;            /*!< [1..1] desc TE1                                                           */
            __IM  uint32_t            : 2;
            __IM  uint32_t TC2        : 1;            /*!< [4..4] desc TC2                                                           */
            __IM  uint32_t TE2        : 1;            /*!< [5..5] desc TE2                                                           */
            __IM  uint32_t            : 2;
            __IM  uint32_t TC3        : 1;            /*!< [8..8] desc TC3                                                           */
            __IM  uint32_t TE3        : 1;            /*!< [9..9] desc TE3                                                           */
            __IM  uint32_t            : 2;
            __IM  uint32_t TC4        : 1;            /*!< [12..12] desc TC4                                                         */
            __IM  uint32_t TE4        : 1;            /*!< [13..13] desc TE4                                                         */
            __IM  uint32_t            : 2;
            __IM  uint32_t TC5        : 1;            /*!< [16..16] desc TC5                                                         */
            __IM  uint32_t TE5        : 1;            /*!< [17..17] desc TE5                                                         */
        } ISR_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x00000004) Interrupt flag clear register                              */

        struct
        {
            __IOM uint32_t TC1        : 1;            /*!< [0..0] desc TC1                                                           */
            __IOM uint32_t TE1        : 1;            /*!< [1..1] desc TE1                                                           */
            __IM  uint32_t            : 2;
            __IOM uint32_t TC2        : 1;            /*!< [4..4] desc TC2                                                           */
            __IOM uint32_t TE2        : 1;            /*!< [5..5] desc TE2                                                           */
            __IM  uint32_t            : 2;
            __IOM uint32_t TC3        : 1;            /*!< [8..8] desc TC3                                                           */
            __IOM uint32_t TE3        : 1;            /*!< [9..9] desc TE3                                                           */
            __IM  uint32_t            : 2;
            __IOM uint32_t TC4        : 1;            /*!< [12..12] desc TC4                                                         */
            __IOM uint32_t TE4        : 1;            /*!< [13..13] desc TE4                                                         */
            __IM  uint32_t            : 2;
            __IOM uint32_t TC5        : 1;            /*!< [16..16] desc TC5                                                         */
            __IOM uint32_t TE5        : 1;            /*!< [17..17] desc TE5                                                         */
        } ICR_f;
    } ;
    __IM  uint32_t  RESERVED[6];

    union
    {
        __IOM uint32_t CSR1;                        /*!< (@ 0x00000020) Channel1 control and status register                       */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t TCIE       : 1;            /*!< [1..1] desc TCIE                                                          */
            __IOM uint32_t TEIE       : 1;            /*!< [2..2] desc TEIE                                                          */
            __IOM uint32_t TRANS      : 1;            /*!< [3..3] desc TRANS                                                         */
            __IOM uint32_t SRCINC     : 1;            /*!< [4..4] desc SRCINC                                                        */
            __IOM uint32_t DSTINC     : 1;            /*!< [5..5] desc DSTINC                                                        */
            __IOM uint32_t SIZE       : 2;            /*!< [7..6] desc SIZE                                                          */
            __IM  uint32_t STATUS     : 3;            /*!< [10..8] desc STATUS                                                       */
        } CSR1_f;
    } ;

    union
    {
        __IOM uint32_t CNT1;                        /*!< (@ 0x00000024) Channel1 counter register                                  */

        struct
        {
            __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
            __IOM uint32_t REPEAT     : 4;            /*!< [19..16] desc REPEAT                                                      */
        } CNT1_f;
    } ;

    union
    {
        __IOM uint32_t SRCADDR1;                    /*!< (@ 0x00000028) Channel1 source address register                           */

        struct
        {
            __IOM uint32_t SRCADDR    : 32;           /*!< [31..0] desc SRCADDR                                                      */
        } SRCADDR1_f;
    } ;

    union
    {
        __IOM uint32_t DSTADDR1;                    /*!< (@ 0x0000002C) Channel1 destination address register                      */

        struct
        {
            __IOM uint32_t DSTADDR    : 32;           /*!< [31..0] desc DSTADDR                                                      */
        } DSTADDR1_f;
    } ;

    union
    {
        __IOM uint32_t TRIG1;                       /*!< (@ 0x00000030) Channel1 trigger register                                  */

        struct
        {
            __IOM uint32_t TYPE       : 1;            /*!< [0..0] desc TYPE                                                          */
            __IOM uint32_t SOFTSRC    : 1;            /*!< [1..1] desc SOFTSRC                                                       */
            __IOM uint32_t HARDSRC    : 6;            /*!< [7..2] desc HARDSRC                                                       */
        } TRIG1_f;
    } ;
    __IM  uint32_t  RESERVED1[3];

    union
    {
        __IOM uint32_t CSR2;                        /*!< (@ 0x00000040) Channel2 control and status register                       */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t TCIE       : 1;            /*!< [1..1] desc TCIE                                                          */
            __IOM uint32_t TEIE       : 1;            /*!< [2..2] desc TEIE                                                          */
            __IOM uint32_t TRANS      : 1;            /*!< [3..3] desc TRANS                                                         */
            __IOM uint32_t SRCINC     : 1;            /*!< [4..4] desc SRCINC                                                        */
            __IOM uint32_t DSTINC     : 1;            /*!< [5..5] desc DSTINC                                                        */
            __IOM uint32_t SIZE       : 2;            /*!< [7..6] desc SIZE                                                          */
            __IM  uint32_t STATUS     : 3;            /*!< [10..8] desc STATUS                                                       */
        } CSR2_f;
    } ;

    union
    {
        __IOM uint32_t CNT2;                        /*!< (@ 0x00000044) Channel2 counter register                                  */

        struct
        {
            __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
            __IOM uint32_t REPEAT     : 4;            /*!< [19..16] desc REPEAT                                                      */
        } CNT2_f;
    } ;

    union
    {
        __IOM uint32_t SRCADDR2;                    /*!< (@ 0x00000048) Channel2 source address register                           */

        struct
        {
            __IOM uint32_t SRCADDR    : 32;           /*!< [31..0] desc SRCADDR                                                      */
        } SRCADDR2_f;
    } ;

    union
    {
        __IOM uint32_t DSTADDR2;                    /*!< (@ 0x0000004C) Channel2 destination address register                      */

        struct
        {
            __IOM uint32_t DSTADDR    : 32;           /*!< [31..0] desc DSTADDR                                                      */
        } DSTADDR2_f;
    } ;

    union
    {
        __IOM uint32_t TRIG2;                       /*!< (@ 0x00000050) Channel2 trigger register                                  */

        struct
        {
            __IOM uint32_t TYPE       : 1;            /*!< [0..0] desc TYPE                                                          */
            __IOM uint32_t SOFTSRC    : 1;            /*!< [1..1] desc SOFTSRC                                                       */
            __IOM uint32_t HARDSRC    : 6;            /*!< [7..2] desc HARDSRC                                                       */
        } TRIG2_f;
    } ;
    __IM  uint32_t  RESERVED2[3];

    union
    {
        __IOM uint32_t CSR3;                        /*!< (@ 0x00000060) Channel3 control and status register                       */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t TCIE       : 1;            /*!< [1..1] desc TCIE                                                          */
            __IOM uint32_t TEIE       : 1;            /*!< [2..2] desc TEIE                                                          */
            __IOM uint32_t TRANS      : 1;            /*!< [3..3] desc TRANS                                                         */
            __IOM uint32_t SRCINC     : 1;            /*!< [4..4] desc SRCINC                                                        */
            __IOM uint32_t DSTINC     : 1;            /*!< [5..5] desc DSTINC                                                        */
            __IOM uint32_t SIZE       : 2;            /*!< [7..6] desc SIZE                                                          */
            __IM  uint32_t STATUS     : 3;            /*!< [10..8] desc STATUS                                                       */
        } CSR3_f;
    } ;

    union
    {
        __IOM uint32_t CNT3;                        /*!< (@ 0x00000064) Channel3 counter register                                  */

        struct
        {
            __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
            __IOM uint32_t REPEAT     : 4;            /*!< [19..16] desc REPEAT                                                      */
        } CNT3_f;
    } ;

    union
    {
        __IOM uint32_t SRCADDR3;                    /*!< (@ 0x00000068) Channel3 source address register                           */

        struct
        {
            __IOM uint32_t SRCADDR    : 32;           /*!< [31..0] desc SRCADDR                                                      */
        } SRCADDR3_f;
    } ;

    union
    {
        __IOM uint32_t DSTADDR3;                    /*!< (@ 0x0000006C) Channel3 destination address register                      */

        struct
        {
            __IOM uint32_t DSTADDR    : 32;           /*!< [31..0] desc DSTADDR                                                      */
        } DSTADDR3_f;
    } ;

    union
    {
        __IOM uint32_t TRIG3;                       /*!< (@ 0x00000070) Channel3 trigger register                                  */

        struct
        {
            __IOM uint32_t TYPE       : 1;            /*!< [0..0] desc TYPE                                                          */
            __IOM uint32_t SOFTSRC    : 1;            /*!< [1..1] desc SOFTSRC                                                       */
            __IOM uint32_t HARDSRC    : 6;            /*!< [7..2] desc HARDSRC                                                       */
        } TRIG3_f;
    } ;
    __IM  uint32_t  RESERVED3[3];

    union
    {
        __IOM uint32_t CSR4;                        /*!< (@ 0x00000080) Channel4 control and status register                       */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t TCIE       : 1;            /*!< [1..1] desc TCIE                                                          */
            __IOM uint32_t TEIE       : 1;            /*!< [2..2] desc TEIE                                                          */
            __IOM uint32_t TRANS      : 1;            /*!< [3..3] desc TRANS                                                         */
            __IOM uint32_t SRCINC     : 1;            /*!< [4..4] desc SRCINC                                                        */
            __IOM uint32_t DSTINC     : 1;            /*!< [5..5] desc DSTINC                                                        */
            __IOM uint32_t SIZE       : 2;            /*!< [7..6] desc SIZE                                                          */
            __IM  uint32_t STATUS     : 3;            /*!< [10..8] desc STATUS                                                       */
        } CSR4_f;
    } ;

    union
    {
        __IOM uint32_t CNT4;                        /*!< (@ 0x00000084) Channel4 counter register                                  */

        struct
        {
            __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
            __IOM uint32_t REPEAT     : 4;            /*!< [19..16] desc REPEAT                                                      */
        } CNT4_f;
    } ;

    union
    {
        __IOM uint32_t SRCADDR4;                    /*!< (@ 0x00000088) Channel4 source address register                           */

        struct
        {
            __IOM uint32_t SRCADDR    : 32;           /*!< [31..0] desc SRCADDR                                                      */
        } SRCADDR4_f;
    } ;

    union
    {
        __IOM uint32_t DSTADDR4;                    /*!< (@ 0x0000008C) Channel4 destination address register                      */

        struct
        {
            __IOM uint32_t DSTADDR    : 32;           /*!< [31..0] desc DSTADDR                                                      */
        } DSTADDR4_f;
    } ;

    union
    {
        __IOM uint32_t TRIG4;                       /*!< (@ 0x00000090) Channel4 trigger register                                  */

        struct
        {
            __IOM uint32_t TYPE       : 1;            /*!< [0..0] desc TYPE                                                          */
            __IOM uint32_t SOFTSRC    : 1;            /*!< [1..1] desc SOFTSRC                                                       */
            __IOM uint32_t HARDSRC    : 6;            /*!< [7..2] desc HARDSRC                                                       */
        } TRIG4_f;
    } ;
    __IM  uint32_t  RESERVED4[3];

    union
    {
        __IOM uint32_t CSR5;                        /*!< (@ 0x000000A0) Channel5 control and status register                       */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t TCIE       : 1;            /*!< [1..1] desc TCIE                                                          */
            __IOM uint32_t TEIE       : 1;            /*!< [2..2] desc TEIE                                                          */
            __IOM uint32_t TRANS      : 1;            /*!< [3..3] desc TRANS                                                         */
            __IOM uint32_t SRCINC     : 1;            /*!< [4..4] desc SRCINC                                                        */
            __IOM uint32_t DSTINC     : 1;            /*!< [5..5] desc DSTINC                                                        */
            __IOM uint32_t SIZE       : 2;            /*!< [7..6] desc SIZE                                                          */
            __IM  uint32_t STATUS     : 3;            /*!< [10..8] desc STATUS                                                       */
        } CSR5_f;
    } ;

    union
    {
        __IOM uint32_t CNT5;                        /*!< (@ 0x000000A4) Channel5 counter register                                  */

        struct
        {
            __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
            __IOM uint32_t REPEAT     : 4;            /*!< [19..16] desc REPEAT                                                      */
        } CNT5_f;
    } ;

    union
    {
        __IOM uint32_t SRCADDR5;                    /*!< (@ 0x000000A8) Channel5 source address register                           */

        struct
        {
            __IOM uint32_t SRCADDR    : 32;           /*!< [31..0] desc SRCADDR                                                      */
        } SRCADDR5_f;
    } ;

    union
    {
        __IOM uint32_t DSTADDR5;                    /*!< (@ 0x000000AC) Channel5 destination address register                      */

        struct
        {
            __IOM uint32_t DSTADDR    : 32;           /*!< [31..0] desc DSTADDR                                                      */
        } DSTADDR5_f;
    } ;

    union
    {
        __IOM uint32_t TRIG5;                       /*!< (@ 0x000000B0) Channel5 trigger register                                  */

        struct
        {
            __IOM uint32_t TYPE       : 1;            /*!< [0..0] desc TYPE                                                          */
            __IOM uint32_t SOFTSRC    : 1;            /*!< [1..1] desc SOFTSRC                                                       */
            __IOM uint32_t HARDSRC    : 6;            /*!< [7..2] desc HARDSRC                                                       */
        } TRIG5_f;
    } ;
} DMA_TypeDef;                                     /*!< Size = 180 (0xb4)                                                         */



/* =========================================================================================================================== */
/* ================                                        DMACHANNEL1                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA Channel 1 (DMACHANNEL1)
  */

