rushairer/LearnCW32/Libraries/inc/cw32f030.h
typedef struct                                  /*!< (@ 0x40020020) DMACHANNEL1 Structure                                      */
{

    union
    {
        __IOM uint32_t CSR;                         /*!< (@ 0x00000000) Channel.y control and status register                      */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t TCIE       : 1;            /*!< [1..1] desc TCIE                                                          */
            __IOM uint32_t TEIE       : 1;            /*!< [2..2] desc TEIE                                                          */
            __IOM uint32_t TRANS      : 1;            /*!< [3..3] desc TRANS                                                         */
            __IOM uint32_t SRCINC     : 1;            /*!< [4..4] desc SRCINC                                                        */
            __IOM uint32_t DSTINC     : 1;            /*!< [5..5] desc DSTINC                                                        */
            __IOM uint32_t SIZE       : 2;            /*!< [7..6] desc SIZE                                                          */
            __IM  uint32_t STATUS     : 3;            /*!< [10..8] desc STATUS                                                       */
        } CSR_f;
    } ;

    union
    {
        __IOM uint32_t CNT;                         /*!< (@ 0x00000004) Channel.y counter register                                 */

        struct
        {
            __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
            __IOM uint32_t REPEAT     : 4;            /*!< [19..16] desc REPEAT                                                      */
        } CNT_f;
    } ;

    union
    {
        __IOM uint32_t SRCADDR;                     /*!< (@ 0x00000008) Channel.y source address register                          */

        struct
        {
            __IOM uint32_t SRCADDR    : 32;           /*!< [31..0] desc SRCADDR                                                      */
        } SRCADDR_f;
    } ;

    union
    {
        __IOM uint32_t DSTADDR;                     /*!< (@ 0x0000000C) Channel.y destination address register                     */

        struct
        {
            __IOM uint32_t DSTADDR    : 32;           /*!< [31..0] desc DSTADDR                                                      */
        } DSTADDR_f;
    } ;

    union
    {
        __IOM uint32_t TRIG;                        /*!< (@ 0x00000010) Channel.y trigger register                                 */

        struct
        {
            __IOM uint32_t TYPE       : 1;            /*!< [0..0] desc TYPE                                                          */
            __IOM uint32_t SOFTSRC    : 1;            /*!< [1..1] desc SOFTSRC                                                       */
            __IOM uint32_t HARDSRC    : 6;            /*!< [7..2] desc HARDSRC                                                       */
        } TRIG_f;
    } ;
} DMACHANNEL_TypeDef;                              /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc FLASH (FLASH)
  */

typedef struct                                  /*!< (@ 0x40022000) FLASH Structure                                            */
{

    union
    {
        __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control register1                                          */

        struct
        {
            __IOM uint32_t MODE       : 2;            /*!< [1..0] desc MODE                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t STANDBY    : 1;            /*!< [4..4] desc STANDBY                                                       */
            __IM  uint32_t BUSY       : 1;            /*!< [5..5] desc BUSY                                                          */
            __IM  uint32_t SECURITY   : 2;            /*!< [7..6] desc SECURITY                                                      */
            __IM  uint32_t            : 8;
            __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
        } CR1_f;
    } ;

    union
    {
        __IOM uint32_t CR2;                         /*!< (@ 0x00000004) Control register2                                          */

        struct
        {
            __IOM uint32_t WAIT       : 3;            /*!< [2..0] desc WAIT                                                          */
            __IOM uint32_t FETCH      : 1;            /*!< [3..3] desc FETCH                                                         */
            __IOM uint32_t CACHE      : 1;            /*!< [4..4] desc CACHE                                                         */
            __IM  uint32_t            : 11;
            __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
        } CR2_f;
    } ;

    union
    {
        __IOM uint32_t PAGELOCK;                    /*!< (@ 0x00000008) Page Write Erase Lock                                      */

        struct
        {
            __IOM uint32_t LOCK0      : 1;            /*!< [0..0] Page0 - 7                                                          */
            __IOM uint32_t LOCK1      : 1;            /*!< [1..1] Page8 - 15                                                         */
            __IOM uint32_t LOCK2      : 1;            /*!< [2..2] Page16 - 23                                                        */
            __IOM uint32_t LOCK3      : 1;            /*!< [3..3] Page24 - 31                                                        */
            __IOM uint32_t LOCK4      : 1;            /*!< [4..4] Page32 - 39                                                        */
            __IOM uint32_t LOCK5      : 1;            /*!< [5..5] Page40 - 47                                                        */
            __IOM uint32_t LOCK6      : 1;            /*!< [6..6] Page48 - 55                                                        */
            __IOM uint32_t LOCK7      : 1;            /*!< [7..7] Page56 - 63                                                        */
            __IOM uint32_t LOCK8      : 1;            /*!< [8..8] Page64 - 71                                                        */
            __IOM uint32_t LOCK9      : 1;            /*!< [9..9] Page72 - 79                                                        */
            __IOM uint32_t LOCK10     : 1;            /*!< [10..10] Page80 - 87                                                      */
            __IOM uint32_t LOCK11     : 1;            /*!< [11..11] Page88 - 95                                                      */
            __IOM uint32_t LOCK12     : 1;            /*!< [12..12] Page96 - 103                                                     */
            __IOM uint32_t LOCK13     : 1;            /*!< [13..13] Page104 - 111                                                    */
            __IOM uint32_t LOCK14     : 1;            /*!< [14..14] Page112 - 119                                                    */
            __IOM uint32_t LOCK15     : 1;            /*!< [15..15] Page120 - 127                                                    */
            __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
        } PAGELOCK_f;
    } ;
    __IM  uint32_t  RESERVED[5];

    union
    {
        __IOM uint32_t IER;                         /*!< (@ 0x00000020) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t PC         : 1;            /*!< [0..0] desc PC                                                            */
            __IOM uint32_t PAGELOCK   : 1;            /*!< [1..1] desc PAGELOCK                                                      */
            __IM  uint32_t            : 2;
            __IOM uint32_t PROG       : 1;            /*!< [4..4] desc PROG                                                          */
        } IER_f;
    } ;

    union
    {
        __IM  uint32_t ISR;                         /*!< (@ 0x00000024) Interrupt status register                                  */

        struct
        {
            __IM  uint32_t PC         : 1;            /*!< [0..0] desc PC                                                            */
            __IM  uint32_t PAGELOCK   : 1;            /*!< [1..1] desc PAGELOCK                                                      */
            __IM  uint32_t            : 2;
            __IM  uint32_t PROG       : 1;            /*!< [4..4] desc PROG                                                          */
        } ISR_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x00000028) Interrupt flag clear register                              */

        struct
        {
            __IOM uint32_t PC         : 1;            /*!< [0..0] desc PC                                                            */
            __IOM uint32_t PAGELOCK   : 1;            /*!< [1..1] desc PAGELOCK                                                      */
            __IM  uint32_t            : 2;
            __IOM uint32_t PROG       : 1;            /*!< [4..4] desc PROG                                                          */
        } ICR_f;
    } ;
} FLASH_TypeDef;                                   /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIOA                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc GPIOA (GPIOA)
  */

typedef struct                                  /*!< (@ 0x48000000) GPIOA Structure                                            */
{

    union
    {
        __IOM uint32_t DIR;                         /*!< (@ 0x00000000) desc DIR                                                   */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } DIR_f;
    } ;

    union
    {
        __IOM uint32_t OPENDRAIN;                   /*!< (@ 0x00000004) desc OPENDRAIN                                             */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } OPENDRAIN_f;
    } ;

    union
    {
        __IOM uint32_t SPEED;                       /*!< (@ 0x00000008) desc SPEED                                                 */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } SPEED_f;
    } ;

    union
    {
        __IOM uint32_t PDR;                         /*!< (@ 0x0000000C) desc PDR                                                   */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } PDR_f;
    } ;

    union
    {
        __IOM uint32_t PUR;                         /*!< (@ 0x00000010) desc PUR                                                   */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } PUR_f;
    } ;

    union
    {
        __IOM uint32_t AFRH;                        /*!< (@ 0x00000014) desc AFRH                                                  */

