rushairer/LearnCW32/Libraries/inc/cw32f030.h
        struct
        {
            __IOM uint32_t AFR8       : 4;            /*!< [3..0] desc AFR8                                                          */
            __IOM uint32_t AFR9       : 4;            /*!< [7..4] desc AFR9                                                          */
            __IOM uint32_t AFR10      : 4;            /*!< [11..8] desc AFR10                                                        */
            __IOM uint32_t AFR11      : 4;            /*!< [15..12] desc AFR11                                                       */
            __IOM uint32_t AFR12      : 4;            /*!< [19..16] desc AFR12                                                       */
            __IOM uint32_t AFR13      : 4;            /*!< [23..20] desc AFR13                                                       */
            __IOM uint32_t AFR14      : 4;            /*!< [27..24] desc AFR14                                                       */
            __IOM uint32_t AFR15      : 4;            /*!< [31..28] desc AFR15                                                       */
        } AFRH_f;
    } ;

    union
    {
        __IOM uint32_t AFRL;                        /*!< (@ 0x00000018) desc AFRL                                                  */

        struct
        {
            __IOM uint32_t AFR0       : 4;            /*!< [3..0] desc AFR0                                                          */
            __IOM uint32_t AFR1       : 4;            /*!< [7..4] desc AFR1                                                          */
            __IOM uint32_t AFR2       : 4;            /*!< [11..8] desc AFR2                                                         */
            __IOM uint32_t AFR3       : 4;            /*!< [15..12] desc AFR3                                                        */
            __IOM uint32_t AFR4       : 4;            /*!< [19..16] desc AFR4                                                        */
            __IOM uint32_t AFR5       : 4;            /*!< [23..20] desc AFR5                                                        */
            __IOM uint32_t AFR6       : 4;            /*!< [27..24] desc AFR6                                                        */
            __IOM uint32_t AFR7       : 4;            /*!< [31..28] desc AFR7                                                        */
        } AFRL_f;
    } ;

    union
    {
        __IOM uint32_t ANALOG;                      /*!< (@ 0x0000001C) desc ANALOG                                                */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } ANALOG_f;
    } ;

    union
    {
        __IOM uint32_t DRIVER;                      /*!< (@ 0x00000020) desc DRIVER                                                */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } DRIVER_f;
    } ;

    union
    {
        __IOM uint32_t RISEIE;                      /*!< (@ 0x00000024) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } RISEIE_f;
    } ;

    union
    {
        __IOM uint32_t FALLIE;                      /*!< (@ 0x00000028) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } FALLIE_f;
    } ;

    union
    {
        __IOM uint32_t HIGHIE;                      /*!< (@ 0x0000002C) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } HIGHIE_f;
    } ;

    union
    {
        __IOM uint32_t LOWIE;                       /*!< (@ 0x00000030) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } LOWIE_f;
    } ;

    union
    {
        __IOM uint32_t ISR;                         /*!< (@ 0x00000034) Interrupt status register                                  */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } ISR_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x00000038) Interrupt flag clear register                              */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } ICR_f;
    } ;

    union
    {
        __IOM uint32_t LOCK;                        /*!< (@ 0x0000003C) desc LOCK                                                  */

