rushairer/LearnCW32/Libraries/inc/cw32f030.h
        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
            __OM  uint32_t KEY        : 16;           /*!< [31..16] KEY = 0x5A5A                                                     */
        } LOCK_f;
    } ;

    union
    {
        __IOM uint32_t FILTER;                      /*!< (@ 0x00000040) desc FILTER                                                */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
            __IOM uint32_t FLTCLK     : 3;            /*!< [18..16] desc FLTCLK                                                      */
        } FILTER_f;
    } ;
    __IM  uint32_t  RESERVED[3];

    union
    {
        __IOM uint32_t IDR;                         /*!< (@ 0x00000050) desc IDR                                                   */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } IDR_f;
    } ;

    union
    {
        union
        {
            __IOM uint32_t ODR;                       /*!< (@ 0x00000054) desc ODR                                                   */

            struct
            {
                __IOM uint32_t PIN0     : 1;            /*!< [0..0] desc PIN0                                                          */
                __IOM uint32_t PIN1     : 1;            /*!< [1..1] desc PIN1                                                          */
                __IOM uint32_t PIN2     : 1;            /*!< [2..2] desc PIN2                                                          */
                __IOM uint32_t PIN3     : 1;            /*!< [3..3] desc PIN3                                                          */
                __IOM uint32_t PIN4     : 1;            /*!< [4..4] desc PIN4                                                          */
                __IOM uint32_t PIN5     : 1;            /*!< [5..5] desc PIN5                                                          */
                __IOM uint32_t PIN6     : 1;            /*!< [6..6] desc PIN6                                                          */
                __IOM uint32_t PIN7     : 1;            /*!< [7..7] desc PIN7                                                          */
                __IOM uint32_t PIN8     : 1;            /*!< [8..8] desc PIN8                                                          */
                __IOM uint32_t PIN9     : 1;            /*!< [9..9] desc PIN9                                                          */
                __IOM uint32_t PIN10    : 1;            /*!< [10..10] desc PIN10                                                       */
                __IOM uint32_t PIN11    : 1;            /*!< [11..11] desc PIN11                                                       */
                __IOM uint32_t PIN12    : 1;            /*!< [12..12] desc PIN12                                                       */
                __IOM uint32_t PIN13    : 1;            /*!< [13..13] desc PIN13                                                       */
                __IOM uint32_t PIN14    : 1;            /*!< [14..14] desc PIN14                                                       */
                __IOM uint32_t PIN15    : 1;            /*!< [15..15] desc PIN15                                                       */
            } ODR_f;
        } ;

        struct
        {
            union
            {
                __IOM uint8_t ODRLOWBYTE;               /*!< (@ 0x00000054) desc ODRLOWBYTE                                            */

                struct
                {
                    __IOM uint8_t LOWBYTE : 8;            /*!< [7..0] desc LOWBYTE                                                       */
                } ODRLOWBYTE_f;
            } ;

            union
            {
                __IOM uint8_t ODRHIGHBYTE;              /*!< (@ 0x00000055) desc ODRHIGHBYTE                                           */

                struct
                {
                    __IOM uint8_t HIGHBYTE : 8;           /*!< [7..0] desc HIGHBYTE                                                      */
                } ODRHIGHBYTE_f;
            } ;
        };
    };

    union
    {
        __IOM uint32_t BRR;                         /*!< (@ 0x00000058) desc BRR                                                   */

        struct
        {
            __IOM uint32_t BRR0       : 1;            /*!< [0..0] desc BRR0                                                          */
            __IOM uint32_t BRR1       : 1;            /*!< [1..1] desc BRR1                                                          */
            __IOM uint32_t BRR2       : 1;            /*!< [2..2] desc BRR2                                                          */
            __IOM uint32_t BRR3       : 1;            /*!< [3..3] desc BRR3                                                          */
            __IOM uint32_t BRR4       : 1;            /*!< [4..4] desc BRR4                                                          */
            __IOM uint32_t BRR5       : 1;            /*!< [5..5] desc BRR5                                                          */
            __IOM uint32_t BRR6       : 1;            /*!< [6..6] desc BRR6                                                          */
            __IOM uint32_t BRR7       : 1;            /*!< [7..7] desc BRR7                                                          */
            __IOM uint32_t BRR8       : 1;            /*!< [8..8] desc BRR8                                                          */
            __IOM uint32_t BRR9       : 1;            /*!< [9..9] desc BRR9                                                          */
            __IOM uint32_t BRR10      : 1;            /*!< [10..10] desc BRR10                                                       */
            __IOM uint32_t BRR11      : 1;            /*!< [11..11] desc BRR11                                                       */
            __IOM uint32_t BRR12      : 1;            /*!< [12..12] desc BRR12                                                       */
            __IOM uint32_t BRR13      : 1;            /*!< [13..13] desc BRR13                                                       */
            __IOM uint32_t BRR14      : 1;            /*!< [14..14] desc BRR14                                                       */
            __IOM uint32_t BRR15      : 1;            /*!< [15..15] desc BRR15                                                       */
        } BRR_f;
    } ;

    union
    {
        __IOM uint32_t BSRR;                        /*!< (@ 0x0000005C) desc BSRR                                                  */

        struct
        {
            __IOM uint32_t BSS0       : 1;            /*!< [0..0] desc BSS0                                                          */
            __IOM uint32_t BSS1       : 1;            /*!< [1..1] desc BSS1                                                          */
            __IOM uint32_t BSS2       : 1;            /*!< [2..2] desc BSS2                                                          */
            __IOM uint32_t BSS3       : 1;            /*!< [3..3] desc BSS3                                                          */
            __IOM uint32_t BSS4       : 1;            /*!< [4..4] desc BSS4                                                          */
            __IOM uint32_t BSS5       : 1;            /*!< [5..5] desc BSS5                                                          */
            __IOM uint32_t BSS6       : 1;            /*!< [6..6] desc BSS6                                                          */
            __IOM uint32_t BSS7       : 1;            /*!< [7..7] desc BSS7                                                          */
            __IOM uint32_t BSS8       : 1;            /*!< [8..8] desc BSS8                                                          */
            __IOM uint32_t BSS9       : 1;            /*!< [9..9] desc BSS9                                                          */
            __IOM uint32_t BSS10      : 1;            /*!< [10..10] desc BSS10                                                       */
            __IOM uint32_t BSS11      : 1;            /*!< [11..11] desc BSS11                                                       */
            __IOM uint32_t BSS12      : 1;            /*!< [12..12] desc BSS12                                                       */
            __IOM uint32_t BSS13      : 1;            /*!< [13..13] desc BSS13                                                       */
            __IOM uint32_t BSS14      : 1;            /*!< [14..14] desc BSS14                                                       */
            __IOM uint32_t BSS15      : 1;            /*!< [15..15] desc BSS15                                                       */
            __IOM uint32_t BRR0       : 1;            /*!< [16..16] desc BRR0                                                        */
            __IOM uint32_t BRR1       : 1;            /*!< [17..17] desc BRR1                                                        */
            __IOM uint32_t BRR2       : 1;            /*!< [18..18] desc BRR2                                                        */
            __IOM uint32_t BRR3       : 1;            /*!< [19..19] desc BRR3                                                        */
            __IOM uint32_t BRR4       : 1;            /*!< [20..20] desc BRR4                                                        */
            __IOM uint32_t BRR5       : 1;            /*!< [21..21] desc BRR5                                                        */
            __IOM uint32_t BRR6       : 1;            /*!< [22..22] desc BRR6                                                        */
            __IOM uint32_t BRR7       : 1;            /*!< [23..23] desc BRR7                                                        */
            __IOM uint32_t BRR8       : 1;            /*!< [24..24] desc BRR8                                                        */
            __IOM uint32_t BRR9       : 1;            /*!< [25..25] desc BRR9                                                        */
            __IOM uint32_t BRR10      : 1;            /*!< [26..26] desc BRR10                                                       */
            __IOM uint32_t BRR11      : 1;            /*!< [27..27] desc BRR11                                                       */
            __IOM uint32_t BRR12      : 1;            /*!< [28..28] desc BRR12                                                       */
            __IOM uint32_t BRR13      : 1;            /*!< [29..29] desc BRR13                                                       */
            __IOM uint32_t BRR14      : 1;            /*!< [30..30] desc BRR14                                                       */
            __IOM uint32_t BRR15      : 1;            /*!< [31..31] desc BRR15                                                       */
        } BSRR_f;
    } ;

    union
    {
        __IOM uint32_t TOG;                         /*!< (@ 0x00000060) desc TOG                                                   */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
            __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
            __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
            __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
            __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
            __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } TOG_f;
    } ;
} GPIO_TypeDef;                                    /*!< Size = 100 (0x64)                                                         */



/* =========================================================================================================================== */
/* ================                                           GPIOC                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc GPIOC (GPIOC)
  */

typedef struct                                  /*!< (@ 0x48000800) GPIOC Structure                                            */
{

    union
    {
        __IOM uint32_t DIR;                         /*!< (@ 0x00000000) desc DIR                                                   */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } DIR_f;
    } ;

    union
    {
        __IOM uint32_t OPENDRAIN;                   /*!< (@ 0x00000004) desc OPENDRAIN                                             */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } OPENDRAIN_f;
    } ;

    union
    {
        __IOM uint32_t SPEED;                       /*!< (@ 0x00000008) desc SPEED                                                 */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } SPEED_f;
    } ;

    union
    {
        __IOM uint32_t PDR;                         /*!< (@ 0x0000000C) desc PDR                                                   */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } PDR_f;
    } ;

    union
    {
        __IOM uint32_t PUR;                         /*!< (@ 0x00000010) desc PUR                                                   */

