rushairer/LearnCW32/Libraries/inc/cw32f030.h
        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } PUR_f;
    } ;

    union
    {
        __IOM uint32_t AFRH;                        /*!< (@ 0x00000014) desc AFRH                                                  */

        struct
        {
            __IM  uint32_t            : 20;
            __IOM uint32_t AFR13      : 4;            /*!< [23..20] desc AFR13                                                       */
            __IOM uint32_t AFR14      : 4;            /*!< [27..24] desc AFR14                                                       */
            __IOM uint32_t AFR15      : 4;            /*!< [31..28] desc AFR15                                                       */
        } AFRH_f;
    } ;
    __IM  uint32_t  RESERVED;

    union
    {
        __IOM uint32_t ANALOG;                      /*!< (@ 0x0000001C) desc ANALOG                                                */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } ANALOG_f;
    } ;

    union
    {
        __IOM uint32_t DRIVER;                      /*!< (@ 0x00000020) desc DRIVER                                                */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } DRIVER_f;
    } ;

    union
    {
        __IOM uint32_t RISEIE;                      /*!< (@ 0x00000024) Interrupt enable register                                  */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } RISEIE_f;
    } ;

    union
    {
        __IOM uint32_t FALLIE;                      /*!< (@ 0x00000028) Interrupt enable register                                  */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } FALLIE_f;
    } ;

    union
    {
        __IOM uint32_t HIGHIE;                      /*!< (@ 0x0000002C) Interrupt enable register                                  */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } HIGHIE_f;
    } ;

    union
    {
        __IOM uint32_t LOWIE;                       /*!< (@ 0x00000030) Interrupt enable register                                  */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } LOWIE_f;
    } ;

    union
    {
        __IOM uint32_t ISR;                         /*!< (@ 0x00000034) Interrupt status register                                  */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } ISR_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x00000038) Interrupt flag clear register                              */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } ICR_f;
    } ;

    union
    {
        __IOM uint32_t LOCK;                        /*!< (@ 0x0000003C) desc LOCK                                                  */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
            __OM  uint32_t KEY        : 16;           /*!< [31..16] KEY = 0x5A5A                                                     */
        } LOCK_f;
    } ;

    union
    {
        __IOM uint32_t FILTER;                      /*!< (@ 0x00000040) desc FILTER                                                */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
            __IOM uint32_t FLTCLK     : 3;            /*!< [18..16] desc FLTCLK                                                      */
        } FILTER_f;
    } ;
    __IM  uint32_t  RESERVED1[3];

    union
    {
        __IOM uint32_t IDR;                         /*!< (@ 0x00000050) desc IDR                                                   */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } IDR_f;
    } ;

    union
    {
        union
        {
            __IOM uint32_t ODR;                       /*!< (@ 0x00000054) desc ODR                                                   */

            struct
            {
                __IM  uint32_t          : 13;
                __IOM uint32_t PIN13    : 1;            /*!< [13..13] desc PIN13                                                       */
                __IOM uint32_t PIN14    : 1;            /*!< [14..14] desc PIN14                                                       */
                __IOM uint32_t PIN15    : 1;            /*!< [15..15] desc PIN15                                                       */
            } ODR_f;
        } ;

        struct
        {
            union
            {
                __IOM uint8_t ODRLOWBYTE;               /*!< (@ 0x00000054) desc ODRLOWBYTE                                            */

                struct
                {
                    __IOM uint8_t LOWBYTE : 8;            /*!< [7..0] desc LOWBYTE                                                       */
                } ODRLOWBYTE_f;
            } ;

            union
            {
                __IOM uint8_t ODRHIGHBYTE;              /*!< (@ 0x00000055) desc ODRHIGHBYTE                                           */

                struct
                {
                    __IOM uint8_t HIGHBYTE : 8;           /*!< [7..0] desc HIGHBYTE                                                      */
                } ODRHIGHBYTE_f;
            } ;
        };
    };

    union
    {
        __IOM uint32_t BRR;                         /*!< (@ 0x00000058) desc BRR                                                   */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t BRR13      : 1;            /*!< [13..13] desc BRR13                                                       */
            __IOM uint32_t BRR14      : 1;            /*!< [14..14] desc BRR14                                                       */
            __IOM uint32_t BRR15      : 1;            /*!< [15..15] desc BRR15                                                       */
        } BRR_f;
    } ;

    union
    {
        __IOM uint32_t BSRR;                        /*!< (@ 0x0000005C) desc BSRR                                                  */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t BSS13      : 1;            /*!< [13..13] desc BSS13                                                       */
            __IOM uint32_t BSS14      : 1;            /*!< [14..14] desc BSS14                                                       */
            __IOM uint32_t BSS15      : 1;            /*!< [15..15] desc BSS15                                                       */
            __IM  uint32_t            : 13;
            __IOM uint32_t BRR13      : 1;            /*!< [29..29] desc BRR13                                                       */
            __IOM uint32_t BRR14      : 1;            /*!< [30..30] desc BRR14                                                       */
            __IOM uint32_t BRR15      : 1;            /*!< [31..31] desc BRR15                                                       */
        } BSRR_f;
    } ;

    union
    {
        __IOM uint32_t TOG;                         /*!< (@ 0x00000060) desc TOG                                                   */

        struct
        {
            __IM  uint32_t            : 13;
            __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
            __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
            __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
        } TOG_f;
    } ;
} GPIOC_TypeDef;                                   /*!< Size = 100 (0x64)                                                         */



/* =========================================================================================================================== */
/* ================                                           GPIOF                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc GPIOF (GPIOF)
  */

