rushairer/LearnCW32/Libraries/inc/cw32f030.h
typedef struct                                  /*!< (@ 0x48001400) GPIOF Structure                                            */
{

    union
    {
        __IOM uint32_t DIR;                         /*!< (@ 0x00000000) desc DIR                                                   */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } DIR_f;
    } ;

    union
    {
        __IOM uint32_t OPENDRAIN;                   /*!< (@ 0x00000004) desc OPENDRAIN                                             */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } OPENDRAIN_f;
    } ;

    union
    {
        __IOM uint32_t SPEED;                       /*!< (@ 0x00000008) desc SPEED                                                 */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } SPEED_f;
    } ;

    union
    {
        __IOM uint32_t PDR;                         /*!< (@ 0x0000000C) desc PDR                                                   */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } PDR_f;
    } ;

    union
    {
        __IOM uint32_t PUR;                         /*!< (@ 0x00000010) desc PUR                                                   */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } PUR_f;
    } ;
    __IM  uint32_t  RESERVED;

    union
    {
        __IOM uint32_t AFRL;                        /*!< (@ 0x00000018) desc AFRL                                                  */

        struct
        {
            __IOM uint32_t AFR0       : 4;            /*!< [3..0] desc AFR0                                                          */
            __IOM uint32_t AFR1       : 4;            /*!< [7..4] desc AFR1                                                          */
            __IM  uint32_t            : 4;
            __IOM uint32_t AFR3       : 4;            /*!< [15..12] desc AFR3                                                        */
            __IM  uint32_t            : 8;
            __IOM uint32_t AFR6       : 4;            /*!< [27..24] desc AFR6                                                        */
            __IOM uint32_t AFR7       : 4;            /*!< [31..28] desc AFR7                                                        */
        } AFRL_f;
    } ;

    union
    {
        __IOM uint32_t ANALOG;                      /*!< (@ 0x0000001C) desc ANALOG                                                */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } ANALOG_f;
    } ;

    union
    {
        __IOM uint32_t DRIVER;                      /*!< (@ 0x00000020) desc DRIVER                                                */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } DRIVER_f;
    } ;

    union
    {
        __IOM uint32_t RISEIE;                      /*!< (@ 0x00000024) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } RISEIE_f;
    } ;

    union
    {
        __IOM uint32_t FALLIE;                      /*!< (@ 0x00000028) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } FALLIE_f;
    } ;

    union
    {
        __IOM uint32_t HIGHIE;                      /*!< (@ 0x0000002C) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } HIGHIE_f;
    } ;

    union
    {
        __IOM uint32_t LOWIE;                       /*!< (@ 0x00000030) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } LOWIE_f;
    } ;

    union
    {
        __IOM uint32_t ISR;                         /*!< (@ 0x00000034) Interrupt status register                                  */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } ISR_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x00000038) Interrupt flag clear register                              */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } ICR_f;
    } ;

    union
    {
        __IOM uint32_t LOCK;                        /*!< (@ 0x0000003C) desc LOCK                                                  */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IM  uint32_t            : 8;
            __OM  uint32_t KEY        : 16;           /*!< [31..16] KEY = 0x5A5A                                                     */
        } LOCK_f;
    } ;

    union
    {
        __IOM uint32_t FILTER;                      /*!< (@ 0x00000040) desc FILTER                                                */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
            __IM  uint32_t            : 8;
            __IOM uint32_t FLTCLK     : 3;            /*!< [18..16] desc FLTCLK                                                      */
        } FILTER_f;
    } ;
    __IM  uint32_t  RESERVED1[3];

    union
    {
        __IOM uint32_t IDR;                         /*!< (@ 0x00000050) desc IDR                                                   */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } IDR_f;
    } ;

    union
    {
        union
        {
            __IOM uint32_t ODR;                       /*!< (@ 0x00000054) desc ODR                                                   */

            struct
            {
                __IOM uint32_t PIN0     : 1;            /*!< [0..0] desc PIN0                                                          */
                __IOM uint32_t PIN1     : 1;            /*!< [1..1] desc PIN1                                                          */
                __IM  uint32_t          : 1;
                __IOM uint32_t PIN3     : 1;            /*!< [3..3] desc PIN3                                                          */
                __IM  uint32_t          : 2;
                __IOM uint32_t PIN6     : 1;            /*!< [6..6] desc PIN6                                                          */
                __IOM uint32_t PIN7     : 1;            /*!< [7..7] desc PIN7                                                          */
            } ODR_f;
        } ;

        union
        {
            __IOM uint8_t ODRLOWBYTE;                 /*!< (@ 0x00000054) desc ODRLOWBYTE                                            */

            struct
            {
                __IOM uint8_t LOWBYTE   : 8;            /*!< [7..0] desc LOWBYTE                                                       */
            } ODRLOWBYTE_f;
        } ;
    };

    union
    {
        __IOM uint32_t BRR;                         /*!< (@ 0x00000058) desc BRR                                                   */

        struct
        {
            __IOM uint32_t BRR0       : 1;            /*!< [0..0] desc BRR0                                                          */
            __IOM uint32_t BRR1       : 1;            /*!< [1..1] desc BRR1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t BRR3       : 1;            /*!< [3..3] desc BRR3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t BRR6       : 1;            /*!< [6..6] desc BRR6                                                          */
            __IOM uint32_t BRR7       : 1;            /*!< [7..7] desc BRR7                                                          */
        } BRR_f;
    } ;

    union
    {
        __IOM uint32_t BSRR;                        /*!< (@ 0x0000005C) desc BSRR                                                  */

        struct
        {
            __IOM uint32_t BSS0       : 1;            /*!< [0..0] desc BSS0                                                          */
            __IOM uint32_t BSS1       : 1;            /*!< [1..1] desc BSS1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t BSS3       : 1;            /*!< [3..3] desc BSS3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t BSS6       : 1;            /*!< [6..6] desc BSS6                                                          */
            __IOM uint32_t BSS7       : 1;            /*!< [7..7] desc BSS7                                                          */
        } BSRR_f;
    } ;

    union
    {
        __IOM uint32_t TOG;                         /*!< (@ 0x00000060) desc TOG                                                   */

        struct
        {
            __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
            __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
            __IM  uint32_t            : 2;
            __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
            __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
        } TOG_f;
    } ;
} GPIOF_TypeDef;                                   /*!< Size = 100 (0x64)                                                         */



/* =========================================================================================================================== */
/* ================                                           GTIM1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General Timer 1 (GTIM1)
  */

typedef struct                                  /*!< (@ 0x40000400) GTIM1 Structure                                            */
{
    __IM  uint32_t  RESERVED[192];

    union
    {
        __IOM uint32_t ARR;                         /*!< (@ 0x00000300) Auto Reload Register                                       */

        struct
        {
            __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
        } ARR_f;
    } ;

    union
    {
        __IOM uint32_t CNT;                         /*!< (@ 0x00000304) Counter Register                                           */

        struct
        {
            __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
        } CNT_f;
    } ;

    union
    {
        __IOM uint32_t CMMR;                        /*!< (@ 0x00000308) Capture compare control Register                           */

        struct
        {
            __IOM uint32_t CC1M       : 4;            /*!< [3..0] desc CC1M                                                          */
            __IOM uint32_t CC2M       : 4;            /*!< [7..4] desc CC2M                                                          */
            __IOM uint32_t CC3M       : 4;            /*!< [11..8] desc CC3M                                                         */
            __IOM uint32_t CC4M       : 4;            /*!< [15..12] desc CC4M                                                        */
        } CMMR_f;
    } ;

