rushairer/LearnCW32/Libraries/inc/cw32f030.h
    union
    {
        __IOM uint32_t ETR;                         /*!< (@ 0x0000030C) ETR Control register                                       */

        struct
        {
            __IM  uint32_t            : 4;
            __IOM uint32_t ETRFLT     : 3;            /*!< [6..4] desc ETRFLT                                                        */
        } ETR_f;
    } ;

    union
    {
        __IOM uint32_t CR0;                         /*!< (@ 0x00000310) Control register0                                          */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t MODE       : 2;            /*!< [2..1] desc MODE                                                          */
            __IOM uint32_t TRS        : 1;            /*!< [3..3] desc TRS                                                           */
            __IOM uint32_t POL        : 1;            /*!< [4..4] desc POL                                                           */
            __IOM uint32_t ONESHOT    : 1;            /*!< [5..5] desc ONESHOT                                                       */
            __IOM uint32_t TOGEN      : 1;            /*!< [6..6] desc TOGEN                                                         */
            __IOM uint32_t PRS        : 4;            /*!< [10..7] desc PRS                                                          */
            __IM  uint32_t PRSSTATUS  : 4;            /*!< [14..11] desc PRSSTATUS                                                   */
            __IOM uint32_t ENCMODE    : 2;            /*!< [16..15] desc ENCMODE                                                     */
            __IOM uint32_t ENCRESET   : 2;            /*!< [18..17] desc ENCRESET                                                    */
            __IOM uint32_t ENCRELOAD  : 2;            /*!< [20..19] desc ENCRELOAD                                                   */
        } CR0_f;
    } ;

    union
    {
        __IOM uint32_t IER;                         /*!< (@ 0x00000314) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t OV         : 1;            /*!< [0..0] desc OV                                                            */
            __IOM uint32_t TI         : 1;            /*!< [1..1] desc TI                                                            */
            __IOM uint32_t UD         : 1;            /*!< [2..2] desc UD                                                            */
            __IOM uint32_t CC1        : 1;            /*!< [3..3] desc CC1                                                           */
            __IOM uint32_t CC2        : 1;            /*!< [4..4] desc CC2                                                           */
            __IOM uint32_t CC3        : 1;            /*!< [5..5] desc CC3                                                           */
            __IOM uint32_t CC4        : 1;            /*!< [6..6] desc CC4                                                           */
            __IM  uint32_t            : 2;
            __IOM uint32_t DIRCHANGE  : 1;            /*!< [9..9] desc DIRCHANGE                                                     */
        } IER_f;
    } ;

    union
    {
        __IOM uint32_t ISR;                         /*!< (@ 0x00000318) Interrupt status register                                  */

        struct
        {
            __IOM uint32_t OV         : 1;            /*!< [0..0] desc OV                                                            */
            __IOM uint32_t TI         : 1;            /*!< [1..1] desc TI                                                            */
            __IOM uint32_t UD         : 1;            /*!< [2..2] desc UD                                                            */
            __IM  uint32_t CC1        : 1;            /*!< [3..3] desc CC1                                                           */
            __IM  uint32_t CC2        : 1;            /*!< [4..4] desc CC2                                                           */
            __IM  uint32_t CC3        : 1;            /*!< [5..5] desc CC3                                                           */
            __IM  uint32_t CC4        : 1;            /*!< [6..6] desc CC4                                                           */
            __IM  uint32_t            : 2;
            __IM  uint32_t DIRCHANGE  : 1;            /*!< [9..9] desc DIRCHANGE                                                     */
            __IM  uint32_t DIR        : 1;            /*!< [10..10] desc DIR                                                         */
        } ISR_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x0000031C) Interrupt flag clear register                              */

        struct
        {
            __IOM uint32_t OV         : 1;            /*!< [0..0] desc OV                                                            */
            __IOM uint32_t TI         : 1;            /*!< [1..1] desc TI                                                            */
            __IOM uint32_t UD         : 1;            /*!< [2..2] desc UD                                                            */
            __IOM uint32_t CC1        : 1;            /*!< [3..3] desc CC1                                                           */
            __IOM uint32_t CC2        : 1;            /*!< [4..4] desc CC2                                                           */
            __IOM uint32_t CC3        : 1;            /*!< [5..5] desc CC3                                                           */
            __IOM uint32_t CC4        : 1;            /*!< [6..6] desc CC4                                                           */
            __IM  uint32_t            : 2;
            __IOM uint32_t DIRCHANGE  : 1;            /*!< [9..9] desc DIRCHANGE                                                     */
        } ICR_f;
    } ;

    union
    {
        __IOM uint32_t CCR1;                        /*!< (@ 0x00000320) capture compare register                                   */

        struct
        {
            __IOM uint32_t CCR        : 16;           /*!< [15..0] desc CCR                                                          */
        } CCR1_f;
    } ;

    union
    {
        __IOM uint32_t CCR2;                        /*!< (@ 0x00000324) capture compare register                                   */

        struct
        {
            __IOM uint32_t CCR        : 16;           /*!< [15..0] desc CCR                                                          */
        } CCR2_f;
    } ;

    union
    {
        __IOM uint32_t CCR3;                        /*!< (@ 0x00000328) capture compare register                                   */

        struct
        {
            __IOM uint32_t CCR        : 16;           /*!< [15..0] desc CCR                                                          */
        } CCR3_f;
    } ;

    union
    {
        __IOM uint32_t CCR4;                        /*!< (@ 0x0000032C) capture compare register                                   */

        struct
        {
            __IOM uint32_t CCR        : 16;           /*!< [15..0] desc CCR                                                          */
        } CCR4_f;
    } ;

    union
    {
        __IOM uint32_t CR1;                         /*!< (@ 0x00000330) Control register1                                          */

        struct
        {
            __IOM uint32_t CH1FLT     : 3;            /*!< [2..0] desc CH1FLT                                                        */
            __IOM uint32_t CH1POL     : 1;            /*!< [3..3] desc CH1POL                                                        */
            __IOM uint32_t CH2FLT     : 3;            /*!< [6..4] desc CH2FLT                                                        */
            __IOM uint32_t CH2POL     : 1;            /*!< [7..7] desc CH2POL                                                        */
            __IOM uint32_t CH3FLT     : 3;            /*!< [10..8] desc CH3FLT                                                       */
            __IOM uint32_t CH3POL     : 1;            /*!< [11..11] desc CH3POL                                                      */
            __IOM uint32_t CH4FLT     : 3;            /*!< [14..12] desc CH4FLT                                                      */
            __IOM uint32_t CH4POL     : 1;            /*!< [15..15] desc CH4POL                                                      */
        } CR1_f;
    } ;
    __IM  uint32_t  RESERVED1[3];

    union
    {
        __IOM uint32_t DMA;                         /*!< (@ 0x00000340) DMA Control register                                       */

        struct
        {
            __IOM uint32_t OV         : 1;            /*!< [0..0] desc OV                                                            */
            __IOM uint32_t TRS        : 1;            /*!< [1..1] desc TRS                                                           */
            __IOM uint32_t CC1        : 1;            /*!< [2..2] desc CC1                                                           */
            __IOM uint32_t CC2        : 1;            /*!< [3..3] desc CC2                                                           */
            __IOM uint32_t CC3        : 1;            /*!< [4..4] desc CC3                                                           */
            __IOM uint32_t CC4        : 1;            /*!< [5..5] desc CC4                                                           */
        } DMA_f;
    } ;
} GTIM_TypeDef;                                    /*!< Size = 836 (0x344)                                                        */



/* =========================================================================================================================== */
/* ================                                           I2C1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc I2C1 (I2C1)
  */

typedef struct                                  /*!< (@ 0x40005400) I2C1 Structure                                             */
{

    union
    {
        __IOM uint32_t BRREN;                       /*!< (@ 0x00000000) desc BRREN                                                 */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
        } BRREN_f;
    } ;

    union
    {
        __IOM uint32_t BRR;                         /*!< (@ 0x00000004) desc BRR                                                   */

        struct
        {
            __IOM uint32_t BRR        : 8;            /*!< [7..0] fSCL = fPCLK / 8 / (BRR+1)                                         */
        } BRR_f;
    } ;

    union
    {
        __IOM uint32_t CR;                          /*!< (@ 0x00000008) Control register                                           */

        struct
        {
            __IOM uint32_t FLT        : 1;            /*!< [0..0] desc FLT                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t AA         : 1;            /*!< [2..2] desc AA                                                            */
            __IOM uint32_t SI         : 1;            /*!< [3..3] desc SI                                                            */
            __IOM uint32_t STO        : 1;            /*!< [4..4] desc STO                                                           */
            __IOM uint32_t STA        : 1;            /*!< [5..5] desc STA                                                           */
            __IOM uint32_t EN         : 1;            /*!< [6..6] desc EN                                                            */
        } CR_f;
    } ;

    union
    {
        __IOM uint32_t DR;                          /*!< (@ 0x0000000C) Data register                                              */

        struct
        {
            __IOM uint32_t DR         : 8;            /*!< [7..0] desc DR                                                            */
        } DR_f;
    } ;

    union
    {
        __IOM uint32_t ADDR0;                       /*!< (@ 0x00000010) Slave Addrress0                                            */

        struct
        {
            __IOM uint32_t GC         : 1;            /*!< [0..0] desc GC                                                            */
            __IOM uint32_t ADDR0      : 7;            /*!< [7..1] desc ADDR0                                                         */
        } ADDR0_f;
    } ;

    union
    {
        __IM  uint32_t STAT;                        /*!< (@ 0x00000014) Status register                                            */

        struct
        {
            __IM  uint32_t STAT       : 8;            /*!< [7..0] desc STAT                                                          */
        } STAT_f;
    } ;
    __IM  uint32_t  RESERVED[2];

    union
    {
        __IOM uint32_t ADDR1;                       /*!< (@ 0x00000020) Slave Addrress1                                            */

        struct
        {
            __IM  uint32_t            : 1;
            __IOM uint32_t ADDR1      : 7;            /*!< [7..1] desc ADDR1                                                         */
        } ADDR1_f;
    } ;

    union
    {
        __IOM uint32_t ADDR2;                       /*!< (@ 0x00000024) Slave Addrress2                                            */

        struct
        {
            __IM  uint32_t            : 1;
            __IOM uint32_t ADDR2      : 7;            /*!< [7..1] desc ADDR2                                                         */
        } ADDR2_f;
    } ;

    union
    {
        __IM  uint32_t MATCH;                       /*!< (@ 0x00000028) Slave Addrress match flag                                  */

        struct
        {
            __IM  uint32_t ADDR0      : 1;            /*!< [0..0] desc ADDR0                                                         */
            __IM  uint32_t ADDR1      : 1;            /*!< [1..1] desc ADDR1                                                         */
            __IM  uint32_t ADDR2      : 1;            /*!< [2..2] desc ADDR2                                                         */
        } MATCH_f;
    } ;
} I2C_TypeDef;                                     /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           IWDT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc IWDT (IWDT)
  */

