rushairer/LearnCW32/Libraries/inc/cw32f030.h
typedef struct                                  /*!< (@ 0x40003000) IWDT Structure                                             */
{

    union
    {
        __OM  uint32_t KR;                          /*!< (@ 0x00000000) Key register                                               */

        struct
        {
            __OM  uint32_t KR         : 16;           /*!< [15..0] desc KR                                                           */
        } KR_f;
    } ;

    union
    {
        __IOM uint32_t CR;                          /*!< (@ 0x00000004) Control register                                           */

        struct
        {
            __IOM uint32_t PRS        : 3;            /*!< [2..0] desc PRS                                                           */
            __IOM uint32_t ACTION     : 1;            /*!< [3..3] desc ACTION                                                        */
            __IOM uint32_t IE         : 1;            /*!< [4..4] desc IE                                                            */
            __IOM uint32_t PAUSE      : 1;            /*!< [5..5] desc PAUSE                                                         */
        } CR_f;
    } ;

    union
    {
        __IOM uint32_t ARR;                         /*!< (@ 0x00000008) Auto reload register                                       */

        struct
        {
            __IOM uint32_t ARR        : 12;           /*!< [11..0] desc ARR                                                          */
        } ARR_f;
    } ;

    union
    {
        __IOM uint32_t SR;                          /*!< (@ 0x0000000C) Status register                                            */

        struct
        {
            __IM  uint32_t CRF        : 1;            /*!< [0..0] desc CRF                                                           */
            __IM  uint32_t ARRF       : 1;            /*!< [1..1] desc ARRF                                                          */
            __IM  uint32_t WINRF      : 1;            /*!< [2..2] desc WINRF                                                         */
            __IOM uint32_t OV         : 1;            /*!< [3..3] desc OV                                                            */
            __IM  uint32_t RUN        : 1;            /*!< [4..4] desc RUN                                                           */
            __IM  uint32_t RELOAD     : 1;            /*!< [5..5] desc RELOAD                                                        */
        } SR_f;
    } ;

    union
    {
        __IOM uint32_t WINR;                        /*!< (@ 0x00000010) Window register                                            */

        struct
        {
            __IOM uint32_t WINR       : 12;           /*!< [11..0] desc WINR                                                         */
        } WINR_f;
    } ;
    __IM  uint32_t  RESERVED[4];

    union
    {
        __IM  uint32_t CNT;                         /*!< (@ 0x00000024) counter                                                    */

        struct
        {
            __IM  uint32_t CNT        : 12;           /*!< [11..0] desc CNT                                                          */
        } CNT_f;
    } ;
} IWDT_TypeDef;                                    /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                            LVD                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc LVD (LVD)
  */

typedef struct                                  /*!< (@ 0x40012A80) LVD Structure                                              */
{

    union
    {
        __IOM uint32_t CR0;                         /*!< (@ 0x00000000) Control register0                                          */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t ACTION     : 1;            /*!< [1..1] desc ACTION                                                        */
            __IOM uint32_t SOURCE     : 2;            /*!< [3..2] desc SOURCE                                                        */
            __IOM uint32_t VTH        : 4;            /*!< [7..4] desc VTH                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t IE         : 1;            /*!< [9..9] desc IE                                                            */
        } CR0_f;
    } ;

    union
    {
        __IOM uint32_t CR1;                         /*!< (@ 0x00000004) Control register1                                          */

        struct
        {
            __IOM uint32_t FLTEN      : 1;            /*!< [0..0] desc FLTEN                                                         */
            __IOM uint32_t FLTTIME    : 3;            /*!< [3..1] desc FLTTIME                                                       */
            __IOM uint32_t FLTCLK     : 1;            /*!< [4..4] desc FLTCLK                                                        */
            __IOM uint32_t RISE       : 1;            /*!< [5..5] desc RISE                                                          */
            __IOM uint32_t FALL       : 1;            /*!< [6..6] desc FALL                                                          */
            __IOM uint32_t LEVEL      : 1;            /*!< [7..7] desc LEVEL                                                         */
        } CR1_f;
    } ;

    union
    {
        __IOM uint32_t SR;                          /*!< (@ 0x00000008) status register                                            */

        struct
        {
            __IOM uint32_t INTF       : 1;            /*!< [0..0] desc INTF                                                          */
            __IM  uint32_t FLTV       : 1;            /*!< [1..1] desc FLTV                                                          */
        } SR_f;
    } ;
} LVD_TypeDef;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                            RAM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc RAM (RAM)
  */

typedef struct                                  /*!< (@ 0x40022400) RAM Structure                                              */
{

    union
    {
        __IOM uint32_t IER;                         /*!< (@ 0x00000000) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t PARITY     : 1;            /*!< [1..1] desc PARITY                                                        */
        } IER_f;
    } ;

    union
    {
        __IM  uint32_t ADDR;                        /*!< (@ 0x00000004) Parity check error addr register                           */

        struct
        {
            __IM  uint32_t ADDR       : 32;           /*!< [31..0] desc ADDR                                                         */
        } ADDR_f;
    } ;

    union
    {
        __IM  uint32_t ISR;                         /*!< (@ 0x00000008) Interrupt flag register                                    */

        struct
        {
            __IM  uint32_t PARITY     : 1;            /*!< [0..0] desc PARITY                                                        */
        } ISR_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x0000000C) Interrupt flag clear register                              */

        struct
        {
            __IOM uint32_t PARITY     : 1;            /*!< [0..0] desc PARITY                                                        */
        } ICR_f;
    } ;
} RAM_TypeDef;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc RTC (RTC)
  */

typedef struct                                  /*!< (@ 0x40002800) RTC Structure                                              */
{

    union
    {
        __OM  uint32_t KEY;                         /*!< (@ 0x00000000) desc KEY                                                   */

        struct
        {
            __OM  uint32_t KEY        : 8;            /*!< [7..0] Key = 0xCA - 0x53                                                  */
        } KEY_f;
    } ;

    union
    {
        __IOM uint32_t CR0;                         /*!< (@ 0x00000004) Control register0                                          */

        struct
        {
            __IOM uint32_t INTERVAL   : 3;            /*!< [2..0] desc INTERVAL                                                      */
            __IOM uint32_t H24        : 1;            /*!< [3..3] desc H24                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t RTC1HZ     : 2;            /*!< [6..5] desc RTC1HZ                                                        */
            __IOM uint32_t START      : 1;            /*!< [7..7] desc START                                                         */
        } CR0_f;
    } ;

    union
    {
        __IOM uint32_t CR1;                         /*!< (@ 0x00000008) Control register1                                          */

        struct
        {
            __IOM uint32_t ACCESS     : 1;            /*!< [0..0] desc ACCESS                                                        */
            __IM  uint32_t WINDOW     : 1;            /*!< [1..1] desc WINDOW                                                        */
            __IM  uint32_t            : 6;
            __IOM uint32_t SOURCE     : 3;            /*!< [10..8] desc SOURCE                                                       */
        } CR1_f;
    } ;

    union
    {
        __IOM uint32_t CR2;                         /*!< (@ 0x0000000C) Control register2                                          */

        struct
        {
            __IOM uint32_t AWTSRC     : 3;            /*!< [2..0] desc AWTSRC                                                        */
            __IOM uint32_t TAMPEDGE   : 1;            /*!< [3..3] desc TAMPEDGE                                                      */
            __IOM uint32_t RTCOUT     : 2;            /*!< [5..4] desc RTCOUT                                                        */
            __IOM uint32_t TAMPEN     : 1;            /*!< [6..6] desc TAMPEN                                                        */
            __IOM uint32_t AWTEN      : 1;            /*!< [7..7] desc AWTEN                                                         */
            __IM  uint32_t            : 1;
            __IOM uint32_t ALARMAEN   : 1;            /*!< [9..9] desc ALARMAEN                                                      */
            __IOM uint32_t ALARMBEN   : 1;            /*!< [10..10] desc ALARMBEN                                                    */
        } CR2_f;
    } ;

    union
    {
        __IOM uint32_t COMPEN;                      /*!< (@ 0x00000010) Compen register                                            */

        struct
        {
            __IOM uint32_t COMP       : 12;           /*!< [11..0] desc COMP                                                         */
            __IOM uint32_t STEP       : 2;            /*!< [13..12] desc STEP                                                        */
            __IOM uint32_t SIGN       : 1;            /*!< [14..14] desc SIGN                                                        */
            __IOM uint32_t EN         : 1;            /*!< [15..15] desc EN                                                          */
            __IOM uint32_t FREQ       : 4;            /*!< [19..16] desc FREQ                                                        */
        } COMPEN_f;
    } ;

    union
    {
        __IOM uint32_t DATE;                        /*!< (@ 0x00000014) Time.Second register                                       */

        struct
        {
            __IOM uint32_t DAY        : 8;            /*!< [7..0] desc DAY                                                           */
            __IOM uint32_t MONTH      : 8;            /*!< [15..8] desc MONTH                                                        */
            __IOM uint32_t YEAR       : 8;            /*!< [23..16] desc YEAR                                                        */
            __IOM uint32_t WEEK       : 3;            /*!< [26..24] desc WEEK                                                        */
        } DATE_f;
    } ;

    union
    {
        __IOM uint32_t TIME;                        /*!< (@ 0x00000018) Time.Second register                                       */

        struct
        {
            __IOM uint32_t SECOND     : 7;            /*!< [6..0] desc SECOND                                                        */
            __IM  uint32_t            : 1;
            __IOM uint32_t MINUTE     : 7;            /*!< [14..8] desc MINUTE                                                       */
            __IM  uint32_t            : 1;
            __IOM uint32_t HOUR       : 6;            /*!< [21..16] desc HOUR                                                        */
        } TIME_f;
    } ;

    union
    {
        __IOM uint32_t ALARMA;                      /*!< (@ 0x0000001C) Alarm - A                                                  */

        struct
        {
            __IOM uint32_t SECOND     : 7;            /*!< [6..0] desc SECOND                                                        */
            __IOM uint32_t SECONDEN   : 1;            /*!< [7..7] desc SECONDRN                                                      */
            __IOM uint32_t MINUTE     : 7;            /*!< [14..8] desc MINUTE                                                       */
            __IOM uint32_t MINUTEEN   : 1;            /*!< [15..15] desc MINUTEEM                                                    */
            __IOM uint32_t HOUR       : 6;            /*!< [21..16] desc HOUR                                                        */
            __IM  uint32_t            : 1;
            __IOM uint32_t HOURRN     : 1;            /*!< [23..23] desc HOURMEN                                                     */
            __IOM uint32_t WEEKMASK   : 7;            /*!< [30..24] desc WEEKMASK                                                    */
        } ALARMA_f;
    } ;

    union
    {
        __IOM uint32_t ALARMB;                      /*!< (@ 0x00000020) Alarm - B                                                  */

        struct
        {
            __IOM uint32_t SECOND     : 7;            /*!< [6..0] desc SECOND                                                        */
            __IOM uint32_t SECONDEN   : 1;            /*!< [7..7] desc SECONDEN                                                      */
            __IOM uint32_t MINUTE     : 7;            /*!< [14..8] desc MINUTE                                                       */
            __IOM uint32_t MINUTEEN   : 1;            /*!< [15..15] desc MINUTEEN                                                    */
            __IOM uint32_t HOUR       : 6;            /*!< [21..16] desc HOUR                                                        */
            __IM  uint32_t            : 1;
            __IOM uint32_t HOUREN     : 1;            /*!< [23..23] desc HOUREN                                                      */
            __IOM uint32_t WEEKMASK   : 7;            /*!< [30..24] desc WEEKMASK                                                    */
        } ALARMB_f;
    } ;

    union
    {
        __IOM uint32_t TAMPDATE;                    /*!< (@ 0x00000024) desc TAMPDATE                                              */

        struct
        {
            __IOM uint32_t DAY        : 6;            /*!< [5..0] desc DAY                                                           */
            __IM  uint32_t            : 2;
            __IOM uint32_t MONTH      : 5;            /*!< [12..8] desc MONTH                                                        */
            __IOM uint32_t WEEK       : 3;            /*!< [15..13] desc WEEK                                                        */
        } TAMPDATE_f;
    } ;

    union
    {
        __IOM uint32_t TAMPTIME;                    /*!< (@ 0x00000028) desc TAMPTIME                                              */

        struct
        {
            __IOM uint32_t SECOND     : 7;            /*!< [6..0] desc SECOND                                                        */
            __IM  uint32_t            : 1;
            __IOM uint32_t MINUTE     : 7;            /*!< [14..8] desc MINUTE                                                       */
            __IM  uint32_t            : 1;
            __IOM uint32_t HOUR       : 6;            /*!< [21..16] desc HOUR                                                        */
        } TAMPTIME_f;
    } ;

    union
    {
        __IOM uint32_t AWTARR;                      /*!< (@ 0x0000002C) Auto Wakeup Timer Auto Reload Register                     */

        struct
        {
            __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
        } AWTARR_f;
    } ;

    union
    {
        __IOM uint32_t IER;                         /*!< (@ 0x00000030) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t ALARMA     : 1;            /*!< [0..0] desc ALARMA                                                        */
            __IOM uint32_t ALARMB     : 1;            /*!< [1..1] desc ALARMB                                                        */
            __IOM uint32_t AWTIMER    : 1;            /*!< [2..2] desc AWTIMER                                                       */
            __IOM uint32_t TAMP       : 1;            /*!< [3..3] desc TAMP                                                          */
            __IOM uint32_t TAMPOV     : 1;            /*!< [4..4] desc TAMPOV                                                        */
            __IM  uint32_t            : 1;
            __IOM uint32_t INTERVAL   : 1;            /*!< [6..6] desc INTERVAL                                                      */
        } IER_f;
    } ;

    union
    {
        __IM  uint32_t ISR;                         /*!< (@ 0x00000034) Interrupt status register                                  */

        struct
        {
            __IM  uint32_t ALARMA     : 1;            /*!< [0..0] desc ALARMA                                                        */
            __IM  uint32_t ALARMB     : 1;            /*!< [1..1] desc ALARMB                                                        */
            __IM  uint32_t AWTIMER    : 1;            /*!< [2..2] desc AWTIMER                                                       */
            __IM  uint32_t TAMP       : 1;            /*!< [3..3] desc TAMP                                                          */
            __IM  uint32_t TAMPOV     : 1;            /*!< [4..4] desc TAMPOV                                                        */
            __IM  uint32_t            : 1;
            __IM  uint32_t INTERVAL   : 1;            /*!< [6..6] desc INTERVAL                                                      */
        } ISR_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x00000038) Interrupt flag clear register                              */

        struct
        {
            __IOM uint32_t ALARMA     : 1;            /*!< [0..0] desc ALARMA                                                        */
            __IOM uint32_t ALARMB     : 1;            /*!< [1..1] desc ALARMB                                                        */
            __IOM uint32_t AWTIMER    : 1;            /*!< [2..2] desc AWTIMER                                                       */
            __IOM uint32_t TAMP       : 1;            /*!< [3..3] desc TAMP                                                          */
            __IOM uint32_t TAMPOV     : 1;            /*!< [4..4] desc TAMPOV                                                        */
            __IM  uint32_t            : 1;
            __IOM uint32_t INTERVAL   : 1;            /*!< [6..6] desc INTERVAL                                                      */
        } ICR_f;
    } ;
} RTC_TypeDef;                                     /*!< Size = 60 (0x3c)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc SPI1 (SPI1)
  */

typedef struct                                  /*!< (@ 0x40013000) SPI1 Structure                                             */
{

    union
    {
        __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control register1                                          */

