rushairer/LearnCW32/Libraries/inc/cw32f030.h
        struct
        {
            __IOM uint32_t CPHA       : 1;            /*!< [0..0] desc CPHA                                                          */
            __IOM uint32_t CPOL       : 1;            /*!< [1..1] desc CPOL                                                          */
            __IOM uint32_t MSTR       : 1;            /*!< [2..2] desc MSTR                                                          */
            __IOM uint32_t BR         : 3;            /*!< [5..3] desc BR                                                            */
            __IOM uint32_t EN         : 1;            /*!< [6..6] desc EN                                                            */
            __IOM uint32_t LSBF       : 1;            /*!< [7..7] desc LSBF                                                          */
            __IOM uint32_t SMP        : 1;            /*!< [8..8] desc SMP                                                           */
            __IOM uint32_t SSM        : 1;            /*!< [9..9] desc SSM                                                           */
            __IOM uint32_t WIDTH      : 4;            /*!< [13..10] desc WIDTH                                                       */
            __IOM uint32_t MODE       : 2;            /*!< [15..14] desc MODE                                                        */
            __IOM uint32_t DMARX      : 1;            /*!< [16..16] desc DMARX                                                       */
            __IOM uint32_t DMATX      : 1;            /*!< [17..17] desc DMATX                                                       */
            __IOM uint32_t MISOHD     : 1;            /*!< [18..18] desc MISOHD                                                      */
        } CR1_f;
    } ;

    union
    {
        __IOM uint32_t IER;                         /*!< (@ 0x00000004) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
            __IOM uint32_t RXNE       : 1;            /*!< [1..1] desc RXNE                                                          */
            __IOM uint32_t SSF        : 1;            /*!< [2..2] desc SSF                                                           */
            __IOM uint32_t SSR        : 1;            /*!< [3..3] desc SSR                                                           */
            __IOM uint32_t UD         : 1;            /*!< [4..4] desc UD                                                            */
            __IOM uint32_t OV         : 1;            /*!< [5..5] desc OV                                                            */
            __IOM uint32_t SSERR      : 1;            /*!< [6..6] desc SSERR                                                         */
            __IOM uint32_t MODF       : 1;            /*!< [7..7] desc MODF                                                          */
        } IER_f;
    } ;

    union
    {
        __IOM uint32_t CR2;                         /*!< (@ 0x00000008) Control register2                                          */

        struct
        {
            __IOM uint32_t HDOE       : 1;            /*!< [0..0] desc HDOE                                                          */
        } CR2_f;
    } ;

    union
    {
        __IOM uint32_t SSI;                         /*!< (@ 0x0000000C) Slave slect register                                       */

        struct
        {
            __IOM uint32_t SSI        : 1;            /*!< [0..0] desc SSI                                                           */
        } SSI_f;
    } ;

    union
    {
        __IM  uint32_t ISR;                         /*!< (@ 0x00000010) Interrupt status register                                  */

        struct
        {
            __IM  uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
            __IM  uint32_t RXNE       : 1;            /*!< [1..1] desc RXNE                                                          */
            __IM  uint32_t SSF        : 1;            /*!< [2..2] desc SSF                                                           */
            __IM  uint32_t SSR        : 1;            /*!< [3..3] desc SSR                                                           */
            __IM  uint32_t UD         : 1;            /*!< [4..4] desc UD                                                            */
            __IM  uint32_t OV         : 1;            /*!< [5..5] desc OV                                                            */
            __IM  uint32_t SSERR      : 1;            /*!< [6..6] desc SSERR                                                         */
            __IM  uint32_t MODF       : 1;            /*!< [7..7] desc MODF                                                          */
            __IM  uint32_t BUSY       : 1;            /*!< [8..8] desc BUSY                                                          */
            __IM  uint32_t SSLVL      : 1;            /*!< [9..9] desc SSLVL                                                         */
        } ISR_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x00000014) Interrupt flag clear register                              */

        struct
        {
            __IOM uint32_t FLUSH      : 1;            /*!< [0..0] desc FLUSH                                                         */
            __IOM uint32_t RXNE       : 1;            /*!< [1..1] desc RXNE                                                          */
            __IOM uint32_t SSF        : 1;            /*!< [2..2] desc SSF                                                           */
            __IOM uint32_t SSR        : 1;            /*!< [3..3] desc SSR                                                           */
            __IOM uint32_t UD         : 1;            /*!< [4..4] desc UD                                                            */
            __IOM uint32_t OV         : 1;            /*!< [5..5] desc OV                                                            */
            __IOM uint32_t SSERR      : 1;            /*!< [6..6] desc SSERR                                                         */
            __IOM uint32_t MODF       : 1;            /*!< [7..7] desc MODF                                                          */
        } ICR_f;
    } ;

    union
    {
        __IOM uint32_t DR;                          /*!< (@ 0x00000018) Data register                                              */

        struct
        {
            __IOM uint32_t DR         : 16;           /*!< [15..0] desc DR                                                           */
        } DR_f;
    } ;
} SPI_TypeDef;                                     /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                          SYSCTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief System Ctrl (SYSCTRL)
  */

