rushairer/LearnCW32/Libraries/inc/cw32f030.h
typedef struct                                  /*!< (@ 0x40010000) SYSCTRL Structure                                          */
{

    union
    {
        __IOM uint32_t CR0;                         /*!< (@ 0x00000000) Control Reg0                                               */

        struct
        {
            __IOM uint32_t SYSCLK     : 3;            /*!< [2..0] desc SYSCLK                                                        */
            __IOM uint32_t PCLKPRS    : 2;            /*!< [4..3] desc PCLKPRS                                                       */
            __IOM uint32_t HCLKPRS    : 3;            /*!< [7..5] desc HCLKPRS                                                       */
            __IM  uint32_t            : 8;
            __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
        } CR0_f;
    } ;

    union
    {
        __IOM uint32_t CR1;                         /*!< (@ 0x00000004) Control Reg1                                               */

        struct
        {
            __IOM uint32_t HSIEN      : 1;            /*!< [0..0] desc HSIEN                                                         */
            __IOM uint32_t HSEEN      : 1;            /*!< [1..1] desc HSEEN                                                         */
            __IOM uint32_t PLLEN      : 1;            /*!< [2..2] desc PLLEN                                                         */
            __IOM uint32_t LSIEN      : 1;            /*!< [3..3] desc LSIEN                                                         */
            __IOM uint32_t LSEEN      : 1;            /*!< [4..4] desc LSEEN                                                         */
            __IOM uint32_t LSELOCK    : 1;            /*!< [5..5] desc LSELOCK                                                       */
            __IOM uint32_t LSECCS     : 1;            /*!< [6..6] desc LSECCS                                                        */
            __IOM uint32_t HSECCS     : 1;            /*!< [7..7] desc HSECCS                                                        */
            __IOM uint32_t CLKCCS     : 1;            /*!< [8..8] desc CLKCCS                                                        */
            __IM  uint32_t            : 7;
            __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
        } CR1_f;
    } ;

    union
    {
        __IOM uint32_t CR2;                         /*!< (@ 0x00000008) Control Reg2                                               */

        struct
        {
            __IM  uint32_t            : 1;
            __IOM uint32_t SWDIO      : 1;            /*!< [1..1] desc SWDIO                                                         */
            __IOM uint32_t LOCKUP     : 1;            /*!< [2..2] desc LOCKUP                                                        */
            __IOM uint32_t WAKEUPCLK  : 1;            /*!< [3..3] desc WAKEUPCLK                                                     */
            __IM  uint32_t            : 12;
            __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
        } CR2_f;
    } ;

    union
    {
        __IOM uint32_t IER;                         /*!< (@ 0x0000000C) Interupt Enable Reg                                        */

        struct
        {
            __IOM uint32_t HSIRDY     : 1;            /*!< [0..0] desc HSIRDY                                                        */
            __IOM uint32_t HSERDY     : 1;            /*!< [1..1] desc HSERDY                                                        */
            __IOM uint32_t PLLRDY     : 1;            /*!< [2..2] desc PLLRDY                                                        */
            __IOM uint32_t LSIRDY     : 1;            /*!< [3..3] desc LSIRDY                                                        */
            __IOM uint32_t LSERDY     : 1;            /*!< [4..4] desc LSERDY                                                        */
            __IOM uint32_t LSEFAIL    : 1;            /*!< [5..5] desc LSEFAIL                                                       */
            __IOM uint32_t HSEFAIL    : 1;            /*!< [6..6] desc HSEFAIL                                                       */
            __IOM uint32_t LSEFAULT   : 1;            /*!< [7..7] desc LSEFAULT                                                      */
            __IOM uint32_t HSEFAULT   : 1;            /*!< [8..8] desc HSEFAULT                                                      */
            __IM  uint32_t            : 7;
            __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
        } IER_f;
    } ;

    union
    {
        __IM  uint32_t ISR;                         /*!< (@ 0x00000010) Interupt Status Reg                                        */

        struct
        {
            __IM  uint32_t HSIRDY     : 1;            /*!< [0..0] desc HSIRDY                                                        */
            __IM  uint32_t HSERDY     : 1;            /*!< [1..1] desc HSERDY                                                        */
            __IM  uint32_t PLLRDY     : 1;            /*!< [2..2] desc PLLRDY                                                        */
            __IM  uint32_t LSIRDY     : 1;            /*!< [3..3] desc LSIRDY                                                        */
            __IM  uint32_t LSERDY     : 1;            /*!< [4..4] desc LSERDY                                                        */
            __IM  uint32_t LSEFAIL    : 1;            /*!< [5..5] desc LSEFAIL                                                       */
            __IM  uint32_t HSEFAIL    : 1;            /*!< [6..6] desc HSEFAIL                                                       */
            __IM  uint32_t LSEFAULT   : 1;            /*!< [7..7] desc LSEFAULT                                                      */
            __IM  uint32_t HSEFAULT   : 1;            /*!< [8..8] desc HSEFAULT                                                      */
            __IM  uint32_t            : 2;
            __IM  uint32_t HSISTABLE  : 1;            /*!< [11..11] desc HSISTABLE                                                   */
            __IM  uint32_t HSESTABLE  : 1;            /*!< [12..12] desc HSESTABLE                                                   */
            __IM  uint32_t PLLSTABLE  : 1;            /*!< [13..13] desc PLLSTABLE                                                   */
            __IM  uint32_t LSISTABLE  : 1;            /*!< [14..14] desc LSISTABLE                                                   */
            __IM  uint32_t LSESTABLE  : 1;            /*!< [15..15] desc LSESTABLE                                                   */
        } ISR_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x00000014) Interupt Clear Reg                                         */

        struct
        {
            __IOM uint32_t HSIRDY     : 1;            /*!< [0..0] desc HSIRDY                                                        */
            __IOM uint32_t HSERDY     : 1;            /*!< [1..1] desc HSERDY                                                        */
            __IOM uint32_t PLLRDY     : 1;            /*!< [2..2] desc PLLRDY                                                        */
            __IOM uint32_t LSIRDY     : 1;            /*!< [3..3] desc LSIRDY                                                        */
            __IOM uint32_t LSERDY     : 1;            /*!< [4..4] desc LSERDY                                                        */
            __IOM uint32_t LSEFAIL    : 1;            /*!< [5..5] desc LSEFAIL                                                       */
            __IOM uint32_t HSEFAIL    : 1;            /*!< [6..6] desc HSEFAIL                                                       */
            __IOM uint32_t LSEFAULT   : 1;            /*!< [7..7] desc LSEFAULT                                                      */
            __IOM uint32_t HSEFAULT   : 1;            /*!< [8..8] desc HSEFAULT                                                      */
        } ICR_f;
    } ;

    union
    {
        __IOM uint32_t HSI;                         /*!< (@ 0x00000018) HSI Control Reg                                            */

        struct
        {
            __IOM uint32_t TRIM       : 11;           /*!< [10..0] desc TRIM                                                         */
            __IOM uint32_t DIV        : 4;            /*!< [14..11] desc DIV                                                         */
            __IM  uint32_t STABLE     : 1;            /*!< [15..15] desc STABLE                                                      */
        } HSI_f;
    } ;

    union
    {
        __IOM uint32_t HSE;                         /*!< (@ 0x0000001C) HSE Control Reg                                            */

        struct
        {
            __IOM uint32_t DRIVER     : 2;            /*!< [1..0] desc DRIVER                                                        */
            __IOM uint32_t FREQRANGE  : 2;            /*!< [3..2] desc FREQRANGE                                                     */
            __IOM uint32_t WAITCYCLE  : 2;            /*!< [5..4] desc WAITCYCLE                                                     */
            __IOM uint32_t MODE       : 1;            /*!< [6..6] desc MODE                                                          */
            __IOM uint32_t FLT        : 1;            /*!< [7..7] desc FLT                                                           */
            __IOM uint32_t DETCNT     : 11;           /*!< [18..8] desc DETCNT                                                       */
            __IM  uint32_t STABLE     : 1;            /*!< [19..19] desc STABLE                                                      */
        } HSE_f;
    } ;

    union
    {
        __IOM uint32_t LSI;                         /*!< (@ 0x00000020) LSI Control Reg                                            */

        struct
        {
            __IOM uint32_t TRIM       : 10;           /*!< [9..0] desc TRIM                                                          */
            __IOM uint32_t WAITCYCLE  : 2;            /*!< [11..10] desc WAITCYCLE                                                   */
            __IM  uint32_t            : 3;
            __IM  uint32_t STABLE     : 1;            /*!< [15..15] desc STABLE                                                      */
        } LSI_f;
    } ;

    union
    {
        __IOM uint32_t LSE;                         /*!< (@ 0x00000024) LSE Control Reg                                            */

        struct
        {
            __IOM uint32_t DRIVER     : 2;            /*!< [1..0] desc DRIVER                                                        */
            __IOM uint32_t AMP        : 2;            /*!< [3..2] desc AMP                                                           */
            __IOM uint32_t WAITCYCLE  : 2;            /*!< [5..4] desc WAITCYCLE                                                     */
            __IOM uint32_t MODE       : 1;            /*!< [6..6] desc MODE                                                          */
            __IM  uint32_t            : 8;
            __IM  uint32_t STABLE     : 1;            /*!< [15..15] desc STABLE                                                      */
        } LSE_f;
    } ;

    union
    {
        __IOM uint32_t PLL;                         /*!< (@ 0x00000028) PLL Control Reg                                            */

        struct
        {
            __IOM uint32_t SOURCE     : 2;            /*!< [1..0] desc SOURCE                                                        */
            __IOM uint32_t FREQIN     : 2;            /*!< [3..2] desc FREQIN                                                        */
            __IOM uint32_t MUL        : 5;            /*!< [8..4] desc MUL                                                           */
            __IOM uint32_t FREQOUT    : 3;            /*!< [11..9] desc FREQOUT                                                      */
            __IOM uint32_t WAITCYCLE  : 3;            /*!< [14..12] desc WAITCYCLE                                                   */
            __IM  uint32_t STABLE     : 1;            /*!< [15..15] desc STABLE                                                      */
        } PLL_f;
    } ;

    union
    {
        __IOM uint32_t DEBUG;                       /*!< (@ 0x0000002C) Debug Control Reg                                          */

        struct
        {
            __IOM uint32_t ATIM       : 1;            /*!< [0..0] desc ATIM                                                          */
            __IOM uint32_t GTIM1      : 1;            /*!< [1..1] desc GTIM1                                                         */
            __IOM uint32_t GTIM2      : 1;            /*!< [2..2] desc GTIM2                                                         */
            __IOM uint32_t GTIM3      : 1;            /*!< [3..3] desc GTIM3                                                         */
            __IOM uint32_t GTIM4      : 1;            /*!< [4..4] desc GTIM4                                                         */
            __IOM uint32_t BTIM123    : 1;            /*!< [5..5] desc BTIM123                                                       */
            __IOM uint32_t AWT        : 1;            /*!< [6..6] desc AWT                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t RTC        : 1;            /*!< [8..8] desc RTC                                                           */
            __IOM uint32_t IWDT       : 1;            /*!< [9..9] desc IWDT                                                          */
            __IOM uint32_t WWDT       : 1;            /*!< [10..10] desc WWDT                                                        */
        } DEBUG_f;
    } ;

    union
    {
        __IOM uint32_t AHBEN;                       /*!< (@ 0x00000030) AHB Clock Control Reg                                      */

        struct
        {
            __IOM uint32_t DMA        : 1;            /*!< [0..0] desc DMA                                                           */
            __IOM uint32_t FLASH      : 1;            /*!< [1..1] desc FLASH                                                         */
            __IOM uint32_t CRC        : 1;            /*!< [2..2] desc CRC                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t GPIOA      : 1;            /*!< [4..4] desc GPIOA                                                         */
            __IOM uint32_t GPIOB      : 1;            /*!< [5..5] desc GPIOB                                                         */
            __IOM uint32_t GPIOC      : 1;            /*!< [6..6] desc GPIOC                                                         */
            __IM  uint32_t            : 2;
            __IOM uint32_t GPIOF      : 1;            /*!< [9..9] desc GPIOF                                                         */
        } AHBEN_f;
    } ;

    union
    {
        __IOM uint32_t APBEN2;                      /*!< (@ 0x00000034) APB Clock Control Reg2                                     */

        struct
        {
            __IM  uint32_t            : 2;
            __IOM uint32_t ADC        : 1;            /*!< [2..2] desc ADC                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t VC         : 1;            /*!< [4..4] desc VC                                                            */
            __IM  uint32_t            : 2;
            __IOM uint32_t ATIM       : 1;            /*!< [7..7] desc ATIM                                                          */
            __IOM uint32_t SPI1       : 1;            /*!< [8..8] desc SPI1                                                          */
            __IOM uint32_t UART1      : 1;            /*!< [9..9] desc UART1                                                         */
            __IOM uint32_t GTIM3      : 1;            /*!< [10..10] desc GTIM3                                                       */
            __IOM uint32_t GTIM4      : 1;            /*!< [11..11] desc GTIM4                                                       */
            __IOM uint32_t BTIM       : 1;            /*!< [12..12] desc BTIM                                                        */
            __IOM uint32_t AWT        : 1;            /*!< [13..13] desc AWT                                                         */
        } APBEN2_f;
    } ;

    union
    {
        __IOM uint32_t APBEN1;                      /*!< (@ 0x00000038) APB Clock Control Reg1                                     */

        struct
        {
            __IM  uint32_t            : 1;
            __IOM uint32_t GTIM1      : 1;            /*!< [1..1] desc GTIM1                                                         */
            __IOM uint32_t GTIM2      : 1;            /*!< [2..2] desc GTIM2                                                         */
            __IOM uint32_t RTC        : 1;            /*!< [3..3] desc RTC                                                           */
            __IOM uint32_t WWDT       : 1;            /*!< [4..4] desc WWDT                                                          */
            __IOM uint32_t IWDT       : 1;            /*!< [5..5] desc IWDT                                                          */
            __IOM uint32_t SPI2       : 1;            /*!< [6..6] desc SPI2                                                          */
            __IOM uint32_t UART2      : 1;            /*!< [7..7] desc UART2                                                         */
            __IOM uint32_t UART3      : 1;            /*!< [8..8] desc UART3                                                         */
            __IM  uint32_t            : 2;
            __IOM uint32_t I2C1       : 1;            /*!< [11..11] desc I2C1                                                        */
            __IOM uint32_t I2C2       : 1;            /*!< [12..12] desc I2C2                                                        */
        } APBEN1_f;
    } ;
    __IM  uint32_t  RESERVED;

    union
    {
        __IOM uint32_t AHBRST;                      /*!< (@ 0x00000040) AHB Reset Control Reg                                      */

        struct
        {
            __IOM uint32_t DMA        : 1;            /*!< [0..0] desc DMA                                                           */
            __IOM uint32_t FLASH      : 1;            /*!< [1..1] desc FLASH                                                         */
            __IOM uint32_t CRC        : 1;            /*!< [2..2] desc CRC                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t GPIOA      : 1;            /*!< [4..4] desc GPIOA                                                         */
            __IOM uint32_t GPIOB      : 1;            /*!< [5..5] desc GPIOB                                                         */
            __IOM uint32_t GPIOC      : 1;            /*!< [6..6] desc GPIOC                                                         */
            __IM  uint32_t            : 2;
            __IOM uint32_t GPIOF      : 1;            /*!< [9..9] desc GPIOF                                                         */
        } AHBRST_f;
    } ;

    union
    {
        __IOM uint32_t APBRST2;                     /*!< (@ 0x00000044) APB Reset Control Reg2                                     */

        struct
        {
            __IM  uint32_t            : 2;
            __IOM uint32_t ADC        : 1;            /*!< [2..2] desc ADC                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t VC         : 1;            /*!< [4..4] desc VC                                                            */
            __IM  uint32_t            : 2;
            __IOM uint32_t ATIM       : 1;            /*!< [7..7] desc ATIM                                                          */
            __IOM uint32_t SPI1       : 1;            /*!< [8..8] desc SPI1                                                          */
            __IOM uint32_t UART1      : 1;            /*!< [9..9] desc UART1                                                         */
            __IOM uint32_t GTIM3      : 1;            /*!< [10..10] desc GTIM3                                                       */
            __IOM uint32_t GTIM4      : 1;            /*!< [11..11] desc GTIM4                                                       */
            __IOM uint32_t BTIM       : 1;            /*!< [12..12] desc BTIM                                                        */
            __IOM uint32_t AWT        : 1;            /*!< [13..13] desc AWT                                                         */
        } APBRST2_f;
    } ;

    union
    {
        __IOM uint32_t APBRST1;                     /*!< (@ 0x00000048) APB Reset Control Reg1                                     */

        struct
        {
            __IM  uint32_t            : 1;
            __IOM uint32_t GTIM1      : 1;            /*!< [1..1] desc GTIM1                                                         */
            __IOM uint32_t GTIM2      : 1;            /*!< [2..2] desc GTIM2                                                         */
            __IOM uint32_t RTC        : 1;            /*!< [3..3] desc RTC                                                           */
            __IOM uint32_t WWDT       : 1;            /*!< [4..4] desc WWDT                                                          */
            __IOM uint32_t IWDT       : 1;            /*!< [5..5] desc IWDT                                                          */
            __IOM uint32_t SPI2       : 1;            /*!< [6..6] desc SPI2                                                          */
            __IOM uint32_t UART2      : 1;            /*!< [7..7] desc UART2                                                         */
            __IOM uint32_t UART3      : 1;            /*!< [8..8] desc UART3                                                         */
            __IM  uint32_t            : 2;
            __IOM uint32_t I2C1       : 1;            /*!< [11..11] desc I2C1                                                        */
            __IOM uint32_t I2C2       : 1;            /*!< [12..12] desc I2C2                                                        */
        } APBRST1_f;
    } ;

    union
    {
        __IOM uint32_t RESETFLAG;                   /*!< (@ 0x0000004C) Reset Status Reg                                           */

