rushairer/LearnCW32/Libraries/inc/cw32f030.h
        struct
        {
            __IOM uint32_t POR        : 1;            /*!< [0..0] desc POR                                                           */
            __IM  uint32_t            : 2;
            __IOM uint32_t LVD        : 1;            /*!< [3..3] desc LVD                                                           */
            __IOM uint32_t IWDT       : 1;            /*!< [4..4] desc IWDT                                                          */
            __IOM uint32_t WWDT       : 1;            /*!< [5..5] desc WWDT                                                          */
            __IOM uint32_t RSTB       : 1;            /*!< [6..6] desc RSTB                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t LOCKUP     : 1;            /*!< [8..8] desc LOCKUP                                                        */
            __IOM uint32_t SYSRESETREQ : 1;           /*!< [9..9] desc SYSRESETREQ                                                   */
        } RESETFLAG_f;
    } ;

    union
    {
        __IOM uint32_t GTIM1CAP;                    /*!< (@ 0x00000050) GTIM1 CAP Control Reg                                      */

        struct
        {
            __IOM uint32_t CH1        : 3;            /*!< [2..0] desc CH1                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t CH2        : 3;            /*!< [6..4] desc CH2                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t CH3        : 3;            /*!< [10..8] desc CH3                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t CH4        : 3;            /*!< [14..12] desc CH4                                                         */
        } GTIM1CAP_f;
    } ;

    union
    {
        __IOM uint32_t GTIM2CAP;                    /*!< (@ 0x00000054) GTIM2 CAP Control Reg                                      */

        struct
        {
            __IOM uint32_t CH1        : 3;            /*!< [2..0] desc CH1                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t CH2        : 3;            /*!< [6..4] desc CH2                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t CH3        : 3;            /*!< [10..8] desc CH3                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t CH4        : 3;            /*!< [14..12] desc CH4                                                         */
        } GTIM2CAP_f;
    } ;

    union
    {
        __IOM uint32_t GTIM3CAP;                    /*!< (@ 0x00000058) GTIM3 CAP Control Reg                                      */

        struct
        {
            __IOM uint32_t CH1        : 3;            /*!< [2..0] desc CH1                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t CH2        : 3;            /*!< [6..4] desc CH2                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t CH3        : 3;            /*!< [10..8] desc CH3                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t CH4        : 3;            /*!< [14..12] desc CH4                                                         */
        } GTIM3CAP_f;
    } ;

    union
    {
        __IOM uint32_t GTIM4CAP;                    /*!< (@ 0x0000005C) GTIM4 CAP Control Reg                                      */

        struct
        {
            __IOM uint32_t CH1        : 3;            /*!< [2..0] desc CH1                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t CH2        : 3;            /*!< [6..4] desc CH2                                                           */
            __IM  uint32_t            : 1;
            __IOM uint32_t CH3        : 3;            /*!< [10..8] desc CH3                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t CH4        : 3;            /*!< [14..12] desc CH4                                                         */
        } GTIM4CAP_f;
    } ;

    union
    {
        __IOM uint32_t ATIMETR;                     /*!< (@ 0x00000060) ATIM ETR Control Reg                                       */

        struct
        {
            __IOM uint32_t ATIMETR    : 3;            /*!< [2..0] desc ATIMETR                                                       */
        } ATIMETR_f;
    } ;

    union
    {
        __IOM uint32_t GTIMETR;                     /*!< (@ 0x00000064) GTIM1-4 ETR Control Reg                                    */

        struct
        {
            __IOM uint32_t GTIM1ETR   : 3;            /*!< [2..0] desc GTIM1ETR                                                      */
            __IM  uint32_t            : 1;
            __IOM uint32_t GTIM2ETR   : 3;            /*!< [6..4] desc GTIM2ETR                                                      */
            __IM  uint32_t            : 1;
            __IOM uint32_t GTIM3ETR   : 3;            /*!< [10..8] desc GTIM3ETR                                                     */
            __IM  uint32_t            : 1;
            __IOM uint32_t GTIM4ETR   : 3;            /*!< [14..12] desc GTIM4ETR                                                    */
        } GTIMETR_f;
    } ;
    __IM  uint32_t  RESERVED1;

    union
    {
        __IOM uint32_t TIMITR;                      /*!< (@ 0x0000006C) BTIMx GTIMx ATIM ITR Control Reg                           */

        struct
        {
            __IOM uint32_t ATIMITR    : 3;            /*!< [2..0] desc ATIMITR                                                       */
            __IOM uint32_t GTIM1ITR   : 3;            /*!< [5..3] desc GTIM1ITR                                                      */
            __IOM uint32_t GTIM2ITR   : 3;            /*!< [8..6] desc GTIM2ITR                                                      */
            __IOM uint32_t GTIM3ITR   : 3;            /*!< [11..9] desc GTIM3ITR                                                     */
            __IOM uint32_t GTIM4ITR   : 3;            /*!< [14..12] desc GTIM4ITR                                                    */
            __IOM uint32_t BTIM1ITR   : 3;            /*!< [17..15] desc BTIM1ITR                                                    */
            __IOM uint32_t BTIM2ITR   : 3;            /*!< [20..18] desc BTIM2ITR                                                    */
            __IOM uint32_t BTIM3ITR   : 3;            /*!< [23..21] desc BTIM3ITR                                                    */
        } TIMITR_f;
    } ;

    union
    {
        __IOM uint32_t MCO;                         /*!< (@ 0x00000070) Master Clock Output Control Reg                            */

        struct
        {
            __IOM uint32_t SOURCE     : 4;            /*!< [3..0] desc SOURCE                                                        */
            __IOM uint32_t DIV        : 3;            /*!< [6..4] desc DIV                                                           */
        } MCO_f;
    } ;

    union
    {
        __IOM uint32_t IRMOD;                       /*!< (@ 0x00000074) IR MOD Control Reg                                         */

        struct
        {
            __IOM uint32_t MOD        : 4;            /*!< [3..0] desc MOD                                                           */
        } IRMOD_f;
    } ;
} SYSCTRL_TypeDef;                                 /*!< Size = 120 (0x78)                                                         */



/* =========================================================================================================================== */
/* ================                                           UART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc UART1 (UART1)
  */

typedef struct                                  /*!< (@ 0x40013800) UART1 Structure                                            */
{

    union
    {
        __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control register1                                          */

        struct
        {
            __IOM uint32_t TXEN       : 1;            /*!< [0..0] desc TXEN                                                          */
            __IOM uint32_t RXEN       : 1;            /*!< [1..1] desc RXEN                                                          */
            __IOM uint32_t PARITY     : 2;            /*!< [3..2] desc PARITY                                                        */
            __IOM uint32_t STOP       : 2;            /*!< [5..4] desc STOP                                                          */
            __IOM uint32_t SYNC       : 1;            /*!< [6..6] desc SYNC                                                          */
            __IM  uint32_t            : 1;
            __IOM uint32_t START      : 1;            /*!< [8..8] desc START                                                         */
            __IOM uint32_t OVER       : 2;            /*!< [10..9] desc OVER                                                         */
        } CR1_f;
    } ;

    union
    {
        __IOM uint32_t CR2;                         /*!< (@ 0x00000004) Control register2                                          */

        struct
        {
            __IOM uint32_t ADDREN     : 1;            /*!< [0..0] desc ADDREN                                                        */
            __IOM uint32_t SIGNAL     : 1;            /*!< [1..1] desc SIGNAL                                                        */
            __IOM uint32_t CTSEN      : 1;            /*!< [2..2] desc CTSEN                                                         */
            __IOM uint32_t RTSEN      : 1;            /*!< [3..3] desc RTSEN                                                         */
            __IOM uint32_t RXINV      : 1;            /*!< [4..4] desc RXINV                                                         */
            __IOM uint32_t TXINV      : 1;            /*!< [5..5] desc TXINV                                                         */
            __IOM uint32_t DMARX      : 1;            /*!< [6..6] desc DMARX                                                         */
            __IOM uint32_t DMATX      : 1;            /*!< [7..7] desc DMATX                                                         */
            __IOM uint32_t SOURCE     : 2;            /*!< [9..8] desc SOURCE                                                        */
        } CR2_f;
    } ;

    union
    {
        __IOM uint32_t IER;                         /*!< (@ 0x00000008) Interrupt enable register                                  */

        struct
        {
            __IOM uint32_t TXE        : 1;            /*!< [0..0] TxBuf empty                                                        */
            __IOM uint32_t TC         : 1;            /*!< [1..1] Transmit complete                                                  */
            __IOM uint32_t RC         : 1;            /*!< [2..2] Receive complete                                                   */
            __IOM uint32_t FE         : 1;            /*!< [3..3] Frame error                                                        */
            __IOM uint32_t PE         : 1;            /*!< [4..4] Parity error                                                       */
            __IM  uint32_t            : 1;
            __IOM uint32_t CTS        : 1;            /*!< [6..6] CTS change                                                         */
        } IER_f;
    } ;

    union
    {
        __IOM uint32_t BRRI;                        /*!< (@ 0x0000000C) desc BRRI                                                  */

        struct
        {
            __IOM uint32_t BRRI       : 16;           /*!< [15..0] desc BRRI                                                         */
        } BRRI_f;
    } ;

    union
    {
        __IOM uint32_t BRRF;                        /*!< (@ 0x00000010) desc BRRF                                                  */

        struct
        {
            __IOM uint32_t BRRF       : 4;            /*!< [3..0] desc BRRF                                                          */
        } BRRF_f;
    } ;
    __IM  uint32_t  RESERVED[2];

    union
    {
        __IM  uint32_t ISR;                         /*!< (@ 0x0000001C) Interrupt status register                                  */

        struct
        {
            __IM  uint32_t TXE        : 1;            /*!< [0..0] TxBuf empty                                                        */
            __IM  uint32_t TC         : 1;            /*!< [1..1] Transmit complete                                                  */
            __IM  uint32_t RC         : 1;            /*!< [2..2] Receive complete                                                   */
            __IM  uint32_t FE         : 1;            /*!< [3..3] Frame error                                                        */
            __IM  uint32_t PE         : 1;            /*!< [4..4] Parity error                                                       */
            __IM  uint32_t MATCH      : 1;            /*!< [5..5] Slave addr match                                                   */
            __IM  uint32_t CTS        : 1;            /*!< [6..6] CTS change                                                         */
            __IM  uint32_t CTSLV      : 1;            /*!< [7..7] CTS PIN level                                                      */
            __IM  uint32_t TXBUSY     : 1;            /*!< [8..8] desc TXBUSY                                                        */
        } ISR_f;
    } ;

    union
    {
        __IOM uint32_t ICR;                         /*!< (@ 0x00000020) Interrupt flag clear register                              */

        struct
        {
            __IM  uint32_t            : 1;
            __IOM uint32_t TC         : 1;            /*!< [1..1] Transmit complete                                                  */
            __IOM uint32_t RC         : 1;            /*!< [2..2] Receive complete                                                   */
            __IOM uint32_t FE         : 1;            /*!< [3..3] Frame error                                                        */
            __IOM uint32_t PE         : 1;            /*!< [4..4] Parity error                                                       */
            __IM  uint32_t            : 1;
            __IOM uint32_t CTS        : 1;            /*!< [6..6] CTS change                                                         */
        } ICR_f;
    } ;

    union
    {
        __IM  uint32_t RDR;                         /*!< (@ 0x00000024) Data reg for read                                          */

        struct
        {
            __IM  uint32_t RDR        : 9;            /*!< [8..0] desc RDR                                                           */
        } RDR_f;
    } ;

    union
    {
        __OM  uint32_t TDR;                         /*!< (@ 0x00000028) Data reg for write                                         */

        struct
        {
            __OM  uint32_t TDR        : 9;            /*!< [8..0] desc TDR                                                           */
        } TDR_f;
    } ;
    __IM  uint32_t  RESERVED1;

    union
    {
        __IOM uint32_t ADDR;                        /*!< (@ 0x00000030) Slave addr                                                 */

        struct
        {
            __IOM uint32_t ADDR       : 8;            /*!< [7..0] desc ADDR                                                          */
        } ADDR_f;
    } ;

    union
    {
        __IOM uint32_t MASK;                        /*!< (@ 0x00000034) Slave addr mask                                            */

        struct
        {
            __IOM uint32_t MASK       : 8;            /*!< [7..0] desc MASK                                                          */
        } MASK_f;
    } ;
} UART_TypeDef;                                    /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                            VC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc VC1 (VC1)
  */

typedef struct                                  /*!< (@ 0x40012A00) VC1 Structure                                              */
{

    union
    {
        __IOM uint32_t DIV;                         /*!< (@ 0x00000000) desc DIV                                                   */

        struct
        {
            __IOM uint32_t DIV        : 6;            /*!< [5..0] desc DIV                                                           */
            __IOM uint32_t EN         : 1;            /*!< [6..6] desc EN                                                            */
            __IOM uint32_t VIN        : 1;            /*!< [7..7] desc VIN                                                           */
        } DIV_f;
    } ;

    union
    {
        __IOM uint32_t CR0;                         /*!< (@ 0x00000004) Control register0                                          */

        struct
        {
            __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
            __IOM uint32_t RESP       : 2;            /*!< [2..1] desc RESP                                                          */
            __IOM uint32_t HYS        : 2;            /*!< [4..3] desc HYS                                                           */
            __IOM uint32_t IE         : 1;            /*!< [5..5] desc IE                                                            */
            __IOM uint32_t POL        : 1;            /*!< [6..6] desc POL                                                           */
            __IOM uint32_t WINDOW     : 1;            /*!< [7..7] desc WINDOW                                                        */
            __IOM uint32_t INP        : 4;            /*!< [11..8] desc INP                                                          */
            __IOM uint32_t INN        : 4;            /*!< [15..12] desc INN                                                         */
        } CR0_f;
    } ;

    union
    {
        __IOM uint32_t CR1;                         /*!< (@ 0x00000008) Control register1                                          */

        struct
        {
            __IOM uint32_t FLTEN      : 1;            /*!< [0..0] desc FLTEN                                                         */
            __IOM uint32_t FLTTIME    : 3;            /*!< [3..1] desc FLTTIME                                                       */
            __IOM uint32_t FLTCLK     : 1;            /*!< [4..4] desc FLTCLK                                                        */
            __IOM uint32_t FALLIE     : 1;            /*!< [5..5] desc FALLIE                                                        */
            __IOM uint32_t RISEIE     : 1;            /*!< [6..6] desc RISEIE                                                        */
            __IOM uint32_t HIGHIE     : 1;            /*!< [7..7] desc HIGHIE                                                        */
            __IOM uint32_t ATIMCLR    : 1;            /*!< [8..8] desc ATIMCLR                                                       */
            __IOM uint32_t ATIMBK     : 1;            /*!< [9..9] desc ATIMBK                                                        */
            __IOM uint32_t BLANKCH1B  : 1;            /*!< [10..10] desc BLANKCH1B                                                   */
            __IOM uint32_t BLANKCH2B  : 1;            /*!< [11..11] desc BLANKCH2B                                                   */
            __IOM uint32_t BLANKCH3B  : 1;            /*!< [12..12] desc BLANKCH3B                                                   */
            __IOM uint32_t BLANKFLT   : 3;            /*!< [15..13] desc BLANKFLT                                                    */
        } CR1_f;
    } ;

    union
    {
        __IOM uint32_t SR;                          /*!< (@ 0x0000000C) Status register                                            */

        struct
        {
            __IOM uint32_t INTF       : 1;            /*!< [0..0] desc INTF                                                          */
            __IM  uint32_t FLTV       : 1;            /*!< [1..1] desc FLTV                                                          */
            __IM  uint32_t READY      : 1;            /*!< [2..2] desc READY                                                         */
        } SR_f;
    } ;
} VC_TypeDef;                                      /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                           WWDT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc WWDT (WWDT)
  */

typedef struct                                  /*!< (@ 0x40002C00) WWDT Structure                                             */
{

    union
    {
        __IOM uint32_t CR0;                         /*!< (@ 0x00000000) Control register1                                          */

        struct
        {
            __IOM uint32_t WCNT       : 7;            /*!< [6..0] desc WCNT                                                          */
            __IOM uint32_t EN         : 1;            /*!< [7..7] desc EN                                                            */
        } CR0_f;
    } ;

    union
    {
        __IOM uint32_t CR1;                         /*!< (@ 0x00000004) Control register2                                          */

