rushairer/LearnCW32/Libraries/inc/cw32f030.h
/* ==========================================================  ARR  ========================================================== */
#define BTIMx_ARR_ARR_Pos                 (0UL)                     /*!< ARR (Bit 0)                                        */
#define BTIMx_ARR_ARR_Msk                 (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                        */
/* ==========================================================  CNT  ========================================================== */
#define BTIMx_CNT_CNT_Pos                 (0UL)                     /*!< CNT (Bit 0)                                        */
#define BTIMx_CNT_CNT_Msk                 (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                        */
/* ==========================================================  ACR  ========================================================== */
#define BTIMx_ACR_ETRFLT_Pos              (4UL)                     /*!< ETRFLT (Bit 4)                                     */
#define BTIMx_ACR_ETRFLT_Msk              (0x70UL)                  /*!< ETRFLT (Bitfield-Mask: 0x07)                       */
/* ==========================================================  BCR  ========================================================== */
#define BTIMx_BCR_PRSSTATUS_Pos           (11UL)                    /*!< PRSSTATUS (Bit 11)                                 */
#define BTIMx_BCR_PRSSTATUS_Msk           (0x7800UL)                /*!< PRSSTATUS (Bitfield-Mask: 0x0f)                    */
#define BTIMx_BCR_PRS_Pos                 (7UL)                     /*!< PRS (Bit 7)                                        */
#define BTIMx_BCR_PRS_Msk                 (0x780UL)                 /*!< PRS (Bitfield-Mask: 0x0f)                          */
#define BTIMx_BCR_TOGEN_Pos               (6UL)                     /*!< TOGEN (Bit 6)                                      */
#define BTIMx_BCR_TOGEN_Msk               (0x40UL)                  /*!< TOGEN (Bitfield-Mask: 0x01)                        */
#define BTIMx_BCR_ONESHOT_Pos             (5UL)                     /*!< ONESHOT (Bit 5)                                    */
#define BTIMx_BCR_ONESHOT_Msk             (0x20UL)                  /*!< ONESHOT (Bitfield-Mask: 0x01)                      */
#define BTIMx_BCR_POL_Pos                 (4UL)                     /*!< POL (Bit 4)                                        */
#define BTIMx_BCR_POL_Msk                 (0x10UL)                  /*!< POL (Bitfield-Mask: 0x01)                          */
#define BTIMx_BCR_TRS_Pos                 (3UL)                     /*!< TRS (Bit 3)                                        */
#define BTIMx_BCR_TRS_Msk                 (0x8UL)                   /*!< TRS (Bitfield-Mask: 0x01)                          */
#define BTIMx_BCR_MODE_Pos                (1UL)                     /*!< MODE (Bit 1)                                       */
#define BTIMx_BCR_MODE_Msk                (0x6UL)                   /*!< MODE (Bitfield-Mask: 0x03)                         */
#define BTIMx_BCR_EN_Pos                  (0UL)                     /*!< EN (Bit 0)                                         */
#define BTIMx_BCR_EN_Msk                  (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  IER  ========================================================== */
#define BTIMx_IER_TOP_Pos                 (2UL)                     /*!< TOP (Bit 2)                                        */
#define BTIMx_IER_TOP_Msk                 (0x4UL)                   /*!< TOP (Bitfield-Mask: 0x01)                          */
#define BTIMx_IER_TI_Pos                  (1UL)                     /*!< TI (Bit 1)                                         */
#define BTIMx_IER_TI_Msk                  (0x2UL)                   /*!< TI (Bitfield-Mask: 0x01)                           */
#define BTIMx_IER_OV_Pos                  (0UL)                     /*!< OV (Bit 0)                                         */
#define BTIMx_IER_OV_Msk                  (0x1UL)                   /*!< OV (Bitfield-Mask: 0x01)                           */
/* ==========================================================  ISR  ========================================================== */
#define BTIMx_ISR_TOP_Pos                 (2UL)                     /*!< TOP (Bit 2)                                        */
#define BTIMx_ISR_TOP_Msk                 (0x4UL)                   /*!< TOP (Bitfield-Mask: 0x01)                          */
#define BTIMx_ISR_TI_Pos                  (1UL)                     /*!< TI (Bit 1)                                         */
#define BTIMx_ISR_TI_Msk                  (0x2UL)                   /*!< TI (Bitfield-Mask: 0x01)                           */
#define BTIMx_ISR_OV_Pos                  (0UL)                     /*!< OV (Bit 0)                                         */
#define BTIMx_ISR_OV_Msk                  (0x1UL)                   /*!< OV (Bitfield-Mask: 0x01)                           */
/* ==========================================================  ICR  ========================================================== */
#define BTIMx_ICR_TOP_Pos                 (2UL)                     /*!< TOP (Bit 2)                                        */
#define BTIMx_ICR_TOP_Msk                 (0x4UL)                   /*!< TOP (Bitfield-Mask: 0x01)                          */
#define BTIMx_ICR_TI_Pos                  (1UL)                     /*!< TI (Bit 1)                                         */
#define BTIMx_ICR_TI_Msk                  (0x2UL)                   /*!< TI (Bitfield-Mask: 0x01)                           */
#define BTIMx_ICR_OV_Pos                  (0UL)                     /*!< OV (Bit 0)                                         */
#define BTIMx_ICR_OV_Msk                  (0x1UL)                   /*!< OV (Bitfield-Mask: 0x01)                           */
/* ==========================================================  DMA  ========================================================== */
#define BTIMx_DMA_TRS_Pos                 (1UL)                     /*!< TRS (Bit 1)                                        */
#define BTIMx_DMA_TRS_Msk                 (0x2UL)                   /*!< TRS (Bitfield-Mask: 0x01)                          */
#define BTIMx_DMA_OV_Pos                  (0UL)                     /*!< OV (Bit 0)                                         */
#define BTIMx_DMA_OV_Msk                  (0x1UL)                   /*!< OV (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define CRC_CR_MODE_Pos                   (0UL)                     /*!< MODE (Bit 0)                                       */
#define CRC_CR_MODE_Msk                   (0xfUL)                   /*!< MODE (Bitfield-Mask: 0x0f)                         */
/* =========================================================  DR32  ========================================================== */
#define CRC_DR32_DR32_Pos                 (0UL)                     /*!< DR32 (Bit 0)                                       */
#define CRC_DR32_DR32_Msk                 (0xffffffffUL)            /*!< DR32 (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  DR16  ========================================================== */
#define CRC_DR16_DR16_Pos                 (0UL)                     /*!< DR16 (Bit 0)                                       */
#define CRC_DR16_DR16_Msk                 (0xffffUL)                /*!< DR16 (Bitfield-Mask: 0xffff)                       */
/* ==========================================================  DR8  ========================================================== */
#define CRC_DR8_DR8_Pos                   (0UL)                     /*!< DR8 (Bit 0)                                        */
#define CRC_DR8_DR8_Msk                   (0xffUL)                  /*!< DR8 (Bitfield-Mask: 0xff)                          */
/* =======================================================  RESULT32  ======================================================== */
#define CRC_RESULT32_RESULT32_Pos         (0UL)                     /*!< RESULT32 (Bit 0)                                   */
#define CRC_RESULT32_RESULT32_Msk         (0xffffffffUL)            /*!< RESULT32 (Bitfield-Mask: 0xffffffff)               */
/* =======================================================  RESULT16  ======================================================== */
#define CRC_RESULT16_RESULT16_Pos         (0UL)                     /*!< RESULT16 (Bit 0)                                   */
#define CRC_RESULT16_RESULT16_Msk         (0xffffUL)                /*!< RESULT16 (Bitfield-Mask: 0xffff)                   */


/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */

