rushairer/LearnCW32/Libraries/inc/cw32f030.h
/* ==========================================================  DIR  ========================================================== */
#define GPIOx_DIR_PIN15_Pos               (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOx_DIR_PIN15_Msk               (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOx_DIR_PIN14_Pos               (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOx_DIR_PIN14_Msk               (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOx_DIR_PIN13_Pos               (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOx_DIR_PIN13_Msk               (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
#define GPIOx_DIR_PIN12_Pos               (12UL)                    /*!< PIN12 (Bit 12)                                     */
#define GPIOx_DIR_PIN12_Msk               (0x1000UL)                /*!< PIN12 (Bitfield-Mask: 0x01)                        */
#define GPIOx_DIR_PIN11_Pos               (11UL)                    /*!< PIN11 (Bit 11)                                     */
#define GPIOx_DIR_PIN11_Msk               (0x800UL)                 /*!< PIN11 (Bitfield-Mask: 0x01)                        */
#define GPIOx_DIR_PIN10_Pos               (10UL)                    /*!< PIN10 (Bit 10)                                     */
#define GPIOx_DIR_PIN10_Msk               (0x400UL)                 /*!< PIN10 (Bitfield-Mask: 0x01)                        */
#define GPIOx_DIR_PIN9_Pos                (9UL)                     /*!< PIN9 (Bit 9)                                       */
#define GPIOx_DIR_PIN9_Msk                (0x200UL)                 /*!< PIN9 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DIR_PIN8_Pos                (8UL)                     /*!< PIN8 (Bit 8)                                       */
#define GPIOx_DIR_PIN8_Msk                (0x100UL)                 /*!< PIN8 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DIR_PIN7_Pos                (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOx_DIR_PIN7_Msk                (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DIR_PIN6_Pos                (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOx_DIR_PIN6_Msk                (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DIR_PIN5_Pos                (5UL)                     /*!< PIN5 (Bit 5)                                       */
#define GPIOx_DIR_PIN5_Msk                (0x20UL)                  /*!< PIN5 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DIR_PIN4_Pos                (4UL)                     /*!< PIN4 (Bit 4)                                       */
#define GPIOx_DIR_PIN4_Msk                (0x10UL)                  /*!< PIN4 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DIR_PIN3_Pos                (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOx_DIR_PIN3_Msk                (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DIR_PIN2_Pos                (2UL)                     /*!< PIN2 (Bit 2)                                       */
#define GPIOx_DIR_PIN2_Msk                (0x4UL)                   /*!< PIN2 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DIR_PIN1_Pos                (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOx_DIR_PIN1_Msk                (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DIR_PIN0_Pos                (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOx_DIR_PIN0_Msk                (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* =======================================================  OPENDRAIN  ======================================================= */
#define GPIOx_OPENDRAIN_PIN15_Pos         (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOx_OPENDRAIN_PIN15_Msk         (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOx_OPENDRAIN_PIN14_Pos         (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOx_OPENDRAIN_PIN14_Msk         (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOx_OPENDRAIN_PIN13_Pos         (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOx_OPENDRAIN_PIN13_Msk         (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
#define GPIOx_OPENDRAIN_PIN12_Pos         (12UL)                    /*!< PIN12 (Bit 12)                                     */
#define GPIOx_OPENDRAIN_PIN12_Msk         (0x1000UL)                /*!< PIN12 (Bitfield-Mask: 0x01)                        */
#define GPIOx_OPENDRAIN_PIN11_Pos         (11UL)                    /*!< PIN11 (Bit 11)                                     */
#define GPIOx_OPENDRAIN_PIN11_Msk         (0x800UL)                 /*!< PIN11 (Bitfield-Mask: 0x01)                        */
#define GPIOx_OPENDRAIN_PIN10_Pos         (10UL)                    /*!< PIN10 (Bit 10)                                     */
#define GPIOx_OPENDRAIN_PIN10_Msk         (0x400UL)                 /*!< PIN10 (Bitfield-Mask: 0x01)                        */
#define GPIOx_OPENDRAIN_PIN9_Pos          (9UL)                     /*!< PIN9 (Bit 9)                                       */
#define GPIOx_OPENDRAIN_PIN9_Msk          (0x200UL)                 /*!< PIN9 (Bitfield-Mask: 0x01)                         */
#define GPIOx_OPENDRAIN_PIN8_Pos          (8UL)                     /*!< PIN8 (Bit 8)                                       */
#define GPIOx_OPENDRAIN_PIN8_Msk          (0x100UL)                 /*!< PIN8 (Bitfield-Mask: 0x01)                         */
#define GPIOx_OPENDRAIN_PIN7_Pos          (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOx_OPENDRAIN_PIN7_Msk          (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOx_OPENDRAIN_PIN6_Pos          (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOx_OPENDRAIN_PIN6_Msk          (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOx_OPENDRAIN_PIN5_Pos          (5UL)                     /*!< PIN5 (Bit 5)                                       */
#define GPIOx_OPENDRAIN_PIN5_Msk          (0x20UL)                  /*!< PIN5 (Bitfield-Mask: 0x01)                         */
#define GPIOx_OPENDRAIN_PIN4_Pos          (4UL)                     /*!< PIN4 (Bit 4)                                       */
#define GPIOx_OPENDRAIN_PIN4_Msk          (0x10UL)                  /*!< PIN4 (Bitfield-Mask: 0x01)                         */
#define GPIOx_OPENDRAIN_PIN3_Pos          (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOx_OPENDRAIN_PIN3_Msk          (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOx_OPENDRAIN_PIN2_Pos          (2UL)                     /*!< PIN2 (Bit 2)                                       */
#define GPIOx_OPENDRAIN_PIN2_Msk          (0x4UL)                   /*!< PIN2 (Bitfield-Mask: 0x01)                         */
#define GPIOx_OPENDRAIN_PIN1_Pos          (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOx_OPENDRAIN_PIN1_Msk          (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOx_OPENDRAIN_PIN0_Pos          (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOx_OPENDRAIN_PIN0_Msk          (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* =========================================================  SPEED  ========================================================= */
#define GPIOx_SPEED_PIN15_Pos             (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOx_SPEED_PIN15_Msk             (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOx_SPEED_PIN14_Pos             (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOx_SPEED_PIN14_Msk             (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOx_SPEED_PIN13_Pos             (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOx_SPEED_PIN13_Msk             (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
#define GPIOx_SPEED_PIN12_Pos             (12UL)                    /*!< PIN12 (Bit 12)                                     */
#define GPIOx_SPEED_PIN12_Msk             (0x1000UL)                /*!< PIN12 (Bitfield-Mask: 0x01)                        */
#define GPIOx_SPEED_PIN11_Pos             (11UL)                    /*!< PIN11 (Bit 11)                                     */
#define GPIOx_SPEED_PIN11_Msk             (0x800UL)                 /*!< PIN11 (Bitfield-Mask: 0x01)                        */
#define GPIOx_SPEED_PIN10_Pos             (10UL)                    /*!< PIN10 (Bit 10)                                     */
#define GPIOx_SPEED_PIN10_Msk             (0x400UL)                 /*!< PIN10 (Bitfield-Mask: 0x01)                        */
#define GPIOx_SPEED_PIN9_Pos              (9UL)                     /*!< PIN9 (Bit 9)                                       */
#define GPIOx_SPEED_PIN9_Msk              (0x200UL)                 /*!< PIN9 (Bitfield-Mask: 0x01)                         */
#define GPIOx_SPEED_PIN8_Pos              (8UL)                     /*!< PIN8 (Bit 8)                                       */
#define GPIOx_SPEED_PIN8_Msk              (0x100UL)                 /*!< PIN8 (Bitfield-Mask: 0x01)                         */
#define GPIOx_SPEED_PIN7_Pos              (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOx_SPEED_PIN7_Msk              (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOx_SPEED_PIN6_Pos              (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOx_SPEED_PIN6_Msk              (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOx_SPEED_PIN5_Pos              (5UL)                     /*!< PIN5 (Bit 5)                                       */
#define GPIOx_SPEED_PIN5_Msk              (0x20UL)                  /*!< PIN5 (Bitfield-Mask: 0x01)                         */
#define GPIOx_SPEED_PIN4_Pos              (4UL)                     /*!< PIN4 (Bit 4)                                       */
#define GPIOx_SPEED_PIN4_Msk              (0x10UL)                  /*!< PIN4 (Bitfield-Mask: 0x01)                         */
#define GPIOx_SPEED_PIN3_Pos              (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOx_SPEED_PIN3_Msk              (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOx_SPEED_PIN2_Pos              (2UL)                     /*!< PIN2 (Bit 2)                                       */
#define GPIOx_SPEED_PIN2_Msk              (0x4UL)                   /*!< PIN2 (Bitfield-Mask: 0x01)                         */
#define GPIOx_SPEED_PIN1_Pos              (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOx_SPEED_PIN1_Msk              (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOx_SPEED_PIN0_Pos              (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOx_SPEED_PIN0_Msk              (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  PDR  ========================================================== */
#define GPIOx_PDR_PIN15_Pos               (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOx_PDR_PIN15_Msk               (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOx_PDR_PIN14_Pos               (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOx_PDR_PIN14_Msk               (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOx_PDR_PIN13_Pos               (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOx_PDR_PIN13_Msk               (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
#define GPIOx_PDR_PIN12_Pos               (12UL)                    /*!< PIN12 (Bit 12)                                     */
#define GPIOx_PDR_PIN12_Msk               (0x1000UL)                /*!< PIN12 (Bitfield-Mask: 0x01)                        */
#define GPIOx_PDR_PIN11_Pos               (11UL)                    /*!< PIN11 (Bit 11)                                     */
#define GPIOx_PDR_PIN11_Msk               (0x800UL)                 /*!< PIN11 (Bitfield-Mask: 0x01)                        */
#define GPIOx_PDR_PIN10_Pos               (10UL)                    /*!< PIN10 (Bit 10)                                     */
#define GPIOx_PDR_PIN10_Msk               (0x400UL)                 /*!< PIN10 (Bitfield-Mask: 0x01)                        */
#define GPIOx_PDR_PIN9_Pos                (9UL)                     /*!< PIN9 (Bit 9)                                       */
#define GPIOx_PDR_PIN9_Msk                (0x200UL)                 /*!< PIN9 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PDR_PIN8_Pos                (8UL)                     /*!< PIN8 (Bit 8)                                       */
#define GPIOx_PDR_PIN8_Msk                (0x100UL)                 /*!< PIN8 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PDR_PIN7_Pos                (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOx_PDR_PIN7_Msk                (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PDR_PIN6_Pos                (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOx_PDR_PIN6_Msk                (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PDR_PIN5_Pos                (5UL)                     /*!< PIN5 (Bit 5)                                       */
#define GPIOx_PDR_PIN5_Msk                (0x20UL)                  /*!< PIN5 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PDR_PIN4_Pos                (4UL)                     /*!< PIN4 (Bit 4)                                       */
#define GPIOx_PDR_PIN4_Msk                (0x10UL)                  /*!< PIN4 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PDR_PIN3_Pos                (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOx_PDR_PIN3_Msk                (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PDR_PIN2_Pos                (2UL)                     /*!< PIN2 (Bit 2)                                       */
#define GPIOx_PDR_PIN2_Msk                (0x4UL)                   /*!< PIN2 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PDR_PIN1_Pos                (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOx_PDR_PIN1_Msk                (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PDR_PIN0_Pos                (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOx_PDR_PIN0_Msk                (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  PUR  ========================================================== */
#define GPIOx_PUR_PIN15_Pos               (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOx_PUR_PIN15_Msk               (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOx_PUR_PIN14_Pos               (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOx_PUR_PIN14_Msk               (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOx_PUR_PIN13_Pos               (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOx_PUR_PIN13_Msk               (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
#define GPIOx_PUR_PIN12_Pos               (12UL)                    /*!< PIN12 (Bit 12)                                     */
#define GPIOx_PUR_PIN12_Msk               (0x1000UL)                /*!< PIN12 (Bitfield-Mask: 0x01)                        */
#define GPIOx_PUR_PIN11_Pos               (11UL)                    /*!< PIN11 (Bit 11)                                     */
#define GPIOx_PUR_PIN11_Msk               (0x800UL)                 /*!< PIN11 (Bitfield-Mask: 0x01)                        */
#define GPIOx_PUR_PIN10_Pos               (10UL)                    /*!< PIN10 (Bit 10)                                     */
#define GPIOx_PUR_PIN10_Msk               (0x400UL)                 /*!< PIN10 (Bitfield-Mask: 0x01)                        */
#define GPIOx_PUR_PIN9_Pos                (9UL)                     /*!< PIN9 (Bit 9)                                       */
#define GPIOx_PUR_PIN9_Msk                (0x200UL)                 /*!< PIN9 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PUR_PIN8_Pos                (8UL)                     /*!< PIN8 (Bit 8)                                       */
#define GPIOx_PUR_PIN8_Msk                (0x100UL)                 /*!< PIN8 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PUR_PIN7_Pos                (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOx_PUR_PIN7_Msk                (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PUR_PIN6_Pos                (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOx_PUR_PIN6_Msk                (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PUR_PIN5_Pos                (5UL)                     /*!< PIN5 (Bit 5)                                       */
#define GPIOx_PUR_PIN5_Msk                (0x20UL)                  /*!< PIN5 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PUR_PIN4_Pos                (4UL)                     /*!< PIN4 (Bit 4)                                       */
#define GPIOx_PUR_PIN4_Msk                (0x10UL)                  /*!< PIN4 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PUR_PIN3_Pos                (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOx_PUR_PIN3_Msk                (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PUR_PIN2_Pos                (2UL)                     /*!< PIN2 (Bit 2)                                       */
#define GPIOx_PUR_PIN2_Msk                (0x4UL)                   /*!< PIN2 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PUR_PIN1_Pos                (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOx_PUR_PIN1_Msk                (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOx_PUR_PIN0_Pos                (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOx_PUR_PIN0_Msk                (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* =========================================================  AFRH  ========================================================== */
#define GPIOx_AFRH_AFR15_Pos              (28UL)                    /*!< AFR15 (Bit 28)                                     */
#define GPIOx_AFRH_AFR15_Msk              (0xf0000000UL)            /*!< AFR15 (Bitfield-Mask: 0x0f)                        */
#define GPIOx_AFRH_AFR14_Pos              (24UL)                    /*!< AFR14 (Bit 24)                                     */
#define GPIOx_AFRH_AFR14_Msk              (0xf000000UL)             /*!< AFR14 (Bitfield-Mask: 0x0f)                        */
#define GPIOx_AFRH_AFR13_Pos              (20UL)                    /*!< AFR13 (Bit 20)                                     */
#define GPIOx_AFRH_AFR13_Msk              (0xf00000UL)              /*!< AFR13 (Bitfield-Mask: 0x0f)                        */
#define GPIOx_AFRH_AFR12_Pos              (16UL)                    /*!< AFR12 (Bit 16)                                     */
#define GPIOx_AFRH_AFR12_Msk              (0xf0000UL)               /*!< AFR12 (Bitfield-Mask: 0x0f)                        */
#define GPIOx_AFRH_AFR11_Pos              (12UL)                    /*!< AFR11 (Bit 12)                                     */
#define GPIOx_AFRH_AFR11_Msk              (0xf000UL)                /*!< AFR11 (Bitfield-Mask: 0x0f)                        */
#define GPIOx_AFRH_AFR10_Pos              (8UL)                     /*!< AFR10 (Bit 8)                                      */
#define GPIOx_AFRH_AFR10_Msk              (0xf00UL)                 /*!< AFR10 (Bitfield-Mask: 0x0f)                        */
#define GPIOx_AFRH_AFR9_Pos               (4UL)                     /*!< AFR9 (Bit 4)                                       */
#define GPIOx_AFRH_AFR9_Msk               (0xf0UL)                  /*!< AFR9 (Bitfield-Mask: 0x0f)                         */
#define GPIOx_AFRH_AFR8_Pos               (0UL)                     /*!< AFR8 (Bit 0)                                       */
#define GPIOx_AFRH_AFR8_Msk               (0xfUL)                   /*!< AFR8 (Bitfield-Mask: 0x0f)                         */
/* =========================================================  AFRL  ========================================================== */
#define GPIOx_AFRL_AFR7_Pos               (28UL)                    /*!< AFR7 (Bit 28)                                      */
#define GPIOx_AFRL_AFR7_Msk               (0xf0000000UL)            /*!< AFR7 (Bitfield-Mask: 0x0f)                         */
#define GPIOx_AFRL_AFR6_Pos               (24UL)                    /*!< AFR6 (Bit 24)                                      */
#define GPIOx_AFRL_AFR6_Msk               (0xf000000UL)             /*!< AFR6 (Bitfield-Mask: 0x0f)                         */
