rushairer/LearnCW32/Libraries/inc/cw32f030.h
#define GPIOx_AFRL_AFR5_Pos               (20UL)                    /*!< AFR5 (Bit 20)                                      */
#define GPIOx_AFRL_AFR5_Msk               (0xf00000UL)              /*!< AFR5 (Bitfield-Mask: 0x0f)                         */
#define GPIOx_AFRL_AFR4_Pos               (16UL)                    /*!< AFR4 (Bit 16)                                      */
#define GPIOx_AFRL_AFR4_Msk               (0xf0000UL)               /*!< AFR4 (Bitfield-Mask: 0x0f)                         */
#define GPIOx_AFRL_AFR3_Pos               (12UL)                    /*!< AFR3 (Bit 12)                                      */
#define GPIOx_AFRL_AFR3_Msk               (0xf000UL)                /*!< AFR3 (Bitfield-Mask: 0x0f)                         */
#define GPIOx_AFRL_AFR2_Pos               (8UL)                     /*!< AFR2 (Bit 8)                                       */
#define GPIOx_AFRL_AFR2_Msk               (0xf00UL)                 /*!< AFR2 (Bitfield-Mask: 0x0f)                         */
#define GPIOx_AFRL_AFR1_Pos               (4UL)                     /*!< AFR1 (Bit 4)                                       */
#define GPIOx_AFRL_AFR1_Msk               (0xf0UL)                  /*!< AFR1 (Bitfield-Mask: 0x0f)                         */
#define GPIOx_AFRL_AFR0_Pos               (0UL)                     /*!< AFR0 (Bit 0)                                       */
#define GPIOx_AFRL_AFR0_Msk               (0xfUL)                   /*!< AFR0 (Bitfield-Mask: 0x0f)                         */
/* ========================================================  ANALOG  ========================================================= */
#define GPIOx_ANALOG_PIN15_Pos            (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOx_ANALOG_PIN15_Msk            (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOx_ANALOG_PIN14_Pos            (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOx_ANALOG_PIN14_Msk            (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOx_ANALOG_PIN13_Pos            (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOx_ANALOG_PIN13_Msk            (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
#define GPIOx_ANALOG_PIN12_Pos            (12UL)                    /*!< PIN12 (Bit 12)                                     */
#define GPIOx_ANALOG_PIN12_Msk            (0x1000UL)                /*!< PIN12 (Bitfield-Mask: 0x01)                        */
#define GPIOx_ANALOG_PIN11_Pos            (11UL)                    /*!< PIN11 (Bit 11)                                     */
#define GPIOx_ANALOG_PIN11_Msk            (0x800UL)                 /*!< PIN11 (Bitfield-Mask: 0x01)                        */
#define GPIOx_ANALOG_PIN10_Pos            (10UL)                    /*!< PIN10 (Bit 10)                                     */
#define GPIOx_ANALOG_PIN10_Msk            (0x400UL)                 /*!< PIN10 (Bitfield-Mask: 0x01)                        */
#define GPIOx_ANALOG_PIN9_Pos             (9UL)                     /*!< PIN9 (Bit 9)                                       */
#define GPIOx_ANALOG_PIN9_Msk             (0x200UL)                 /*!< PIN9 (Bitfield-Mask: 0x01)                         */
#define GPIOx_ANALOG_PIN8_Pos             (8UL)                     /*!< PIN8 (Bit 8)                                       */
#define GPIOx_ANALOG_PIN8_Msk             (0x100UL)                 /*!< PIN8 (Bitfield-Mask: 0x01)                         */
#define GPIOx_ANALOG_PIN7_Pos             (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOx_ANALOG_PIN7_Msk             (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOx_ANALOG_PIN6_Pos             (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOx_ANALOG_PIN6_Msk             (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOx_ANALOG_PIN5_Pos             (5UL)                     /*!< PIN5 (Bit 5)                                       */
#define GPIOx_ANALOG_PIN5_Msk             (0x20UL)                  /*!< PIN5 (Bitfield-Mask: 0x01)                         */
#define GPIOx_ANALOG_PIN4_Pos             (4UL)                     /*!< PIN4 (Bit 4)                                       */
#define GPIOx_ANALOG_PIN4_Msk             (0x10UL)                  /*!< PIN4 (Bitfield-Mask: 0x01)                         */
#define GPIOx_ANALOG_PIN3_Pos             (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOx_ANALOG_PIN3_Msk             (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOx_ANALOG_PIN2_Pos             (2UL)                     /*!< PIN2 (Bit 2)                                       */
#define GPIOx_ANALOG_PIN2_Msk             (0x4UL)                   /*!< PIN2 (Bitfield-Mask: 0x01)                         */
#define GPIOx_ANALOG_PIN1_Pos             (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOx_ANALOG_PIN1_Msk             (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOx_ANALOG_PIN0_Pos             (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOx_ANALOG_PIN0_Msk             (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ========================================================  DRIVER  ========================================================= */
#define GPIOx_DRIVER_PIN15_Pos            (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOx_DRIVER_PIN15_Msk            (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOx_DRIVER_PIN14_Pos            (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOx_DRIVER_PIN14_Msk            (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOx_DRIVER_PIN13_Pos            (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOx_DRIVER_PIN13_Msk            (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
#define GPIOx_DRIVER_PIN12_Pos            (12UL)                    /*!< PIN12 (Bit 12)                                     */
#define GPIOx_DRIVER_PIN12_Msk            (0x1000UL)                /*!< PIN12 (Bitfield-Mask: 0x01)                        */
#define GPIOx_DRIVER_PIN11_Pos            (11UL)                    /*!< PIN11 (Bit 11)                                     */
#define GPIOx_DRIVER_PIN11_Msk            (0x800UL)                 /*!< PIN11 (Bitfield-Mask: 0x01)                        */
#define GPIOx_DRIVER_PIN10_Pos            (10UL)                    /*!< PIN10 (Bit 10)                                     */
#define GPIOx_DRIVER_PIN10_Msk            (0x400UL)                 /*!< PIN10 (Bitfield-Mask: 0x01)                        */
#define GPIOx_DRIVER_PIN9_Pos             (9UL)                     /*!< PIN9 (Bit 9)                                       */
#define GPIOx_DRIVER_PIN9_Msk             (0x200UL)                 /*!< PIN9 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DRIVER_PIN8_Pos             (8UL)                     /*!< PIN8 (Bit 8)                                       */
#define GPIOx_DRIVER_PIN8_Msk             (0x100UL)                 /*!< PIN8 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DRIVER_PIN7_Pos             (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOx_DRIVER_PIN7_Msk             (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DRIVER_PIN6_Pos             (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOx_DRIVER_PIN6_Msk             (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DRIVER_PIN5_Pos             (5UL)                     /*!< PIN5 (Bit 5)                                       */
#define GPIOx_DRIVER_PIN5_Msk             (0x20UL)                  /*!< PIN5 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DRIVER_PIN4_Pos             (4UL)                     /*!< PIN4 (Bit 4)                                       */
#define GPIOx_DRIVER_PIN4_Msk             (0x10UL)                  /*!< PIN4 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DRIVER_PIN3_Pos             (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOx_DRIVER_PIN3_Msk             (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DRIVER_PIN2_Pos             (2UL)                     /*!< PIN2 (Bit 2)                                       */
#define GPIOx_DRIVER_PIN2_Msk             (0x4UL)                   /*!< PIN2 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DRIVER_PIN1_Pos             (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOx_DRIVER_PIN1_Msk             (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOx_DRIVER_PIN0_Pos             (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOx_DRIVER_PIN0_Msk             (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ========================================================  RISEIE  ========================================================= */
#define GPIOx_RISEIE_PIN15_Pos            (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOx_RISEIE_PIN15_Msk            (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOx_RISEIE_PIN14_Pos            (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOx_RISEIE_PIN14_Msk            (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOx_RISEIE_PIN13_Pos            (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOx_RISEIE_PIN13_Msk            (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
#define GPIOx_RISEIE_PIN12_Pos            (12UL)                    /*!< PIN12 (Bit 12)                                     */
#define GPIOx_RISEIE_PIN12_Msk            (0x1000UL)                /*!< PIN12 (Bitfield-Mask: 0x01)                        */
#define GPIOx_RISEIE_PIN11_Pos            (11UL)                    /*!< PIN11 (Bit 11)                                     */
#define GPIOx_RISEIE_PIN11_Msk            (0x800UL)                 /*!< PIN11 (Bitfield-Mask: 0x01)                        */
#define GPIOx_RISEIE_PIN10_Pos            (10UL)                    /*!< PIN10 (Bit 10)                                     */
#define GPIOx_RISEIE_PIN10_Msk            (0x400UL)                 /*!< PIN10 (Bitfield-Mask: 0x01)                        */
#define GPIOx_RISEIE_PIN9_Pos             (9UL)                     /*!< PIN9 (Bit 9)                                       */
#define GPIOx_RISEIE_PIN9_Msk             (0x200UL)                 /*!< PIN9 (Bitfield-Mask: 0x01)                         */
#define GPIOx_RISEIE_PIN8_Pos             (8UL)                     /*!< PIN8 (Bit 8)                                       */
#define GPIOx_RISEIE_PIN8_Msk             (0x100UL)                 /*!< PIN8 (Bitfield-Mask: 0x01)                         */
#define GPIOx_RISEIE_PIN7_Pos             (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOx_RISEIE_PIN7_Msk             (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOx_RISEIE_PIN6_Pos             (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOx_RISEIE_PIN6_Msk             (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOx_RISEIE_PIN5_Pos             (5UL)                     /*!< PIN5 (Bit 5)                                       */
#define GPIOx_RISEIE_PIN5_Msk             (0x20UL)                  /*!< PIN5 (Bitfield-Mask: 0x01)                         */
#define GPIOx_RISEIE_PIN4_Pos             (4UL)                     /*!< PIN4 (Bit 4)                                       */
#define GPIOx_RISEIE_PIN4_Msk             (0x10UL)                  /*!< PIN4 (Bitfield-Mask: 0x01)                         */
#define GPIOx_RISEIE_PIN3_Pos             (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOx_RISEIE_PIN3_Msk             (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOx_RISEIE_PIN2_Pos             (2UL)                     /*!< PIN2 (Bit 2)                                       */
#define GPIOx_RISEIE_PIN2_Msk             (0x4UL)                   /*!< PIN2 (Bitfield-Mask: 0x01)                         */
#define GPIOx_RISEIE_PIN1_Pos             (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOx_RISEIE_PIN1_Msk             (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOx_RISEIE_PIN0_Pos             (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOx_RISEIE_PIN0_Msk             (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ========================================================  FALLIE  ========================================================= */
#define GPIOx_FALLIE_PIN15_Pos            (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOx_FALLIE_PIN15_Msk            (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOx_FALLIE_PIN14_Pos            (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOx_FALLIE_PIN14_Msk            (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOx_FALLIE_PIN13_Pos            (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOx_FALLIE_PIN13_Msk            (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
#define GPIOx_FALLIE_PIN12_Pos            (12UL)                    /*!< PIN12 (Bit 12)                                     */
#define GPIOx_FALLIE_PIN12_Msk            (0x1000UL)                /*!< PIN12 (Bitfield-Mask: 0x01)                        */
#define GPIOx_FALLIE_PIN11_Pos            (11UL)                    /*!< PIN11 (Bit 11)                                     */
#define GPIOx_FALLIE_PIN11_Msk            (0x800UL)                 /*!< PIN11 (Bitfield-Mask: 0x01)                        */
#define GPIOx_FALLIE_PIN10_Pos            (10UL)                    /*!< PIN10 (Bit 10)                                     */
#define GPIOx_FALLIE_PIN10_Msk            (0x400UL)                 /*!< PIN10 (Bitfield-Mask: 0x01)                        */
#define GPIOx_FALLIE_PIN9_Pos             (9UL)                     /*!< PIN9 (Bit 9)                                       */
#define GPIOx_FALLIE_PIN9_Msk             (0x200UL)                 /*!< PIN9 (Bitfield-Mask: 0x01)                         */
#define GPIOx_FALLIE_PIN8_Pos             (8UL)                     /*!< PIN8 (Bit 8)                                       */
#define GPIOx_FALLIE_PIN8_Msk             (0x100UL)                 /*!< PIN8 (Bitfield-Mask: 0x01)                         */
#define GPIOx_FALLIE_PIN7_Pos             (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOx_FALLIE_PIN7_Msk             (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOx_FALLIE_PIN6_Pos             (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOx_FALLIE_PIN6_Msk             (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOx_FALLIE_PIN5_Pos             (5UL)                     /*!< PIN5 (Bit 5)                                       */
#define GPIOx_FALLIE_PIN5_Msk             (0x20UL)                  /*!< PIN5 (Bitfield-Mask: 0x01)                         */
#define GPIOx_FALLIE_PIN4_Pos             (4UL)                     /*!< PIN4 (Bit 4)                                       */
#define GPIOx_FALLIE_PIN4_Msk             (0x10UL)                  /*!< PIN4 (Bitfield-Mask: 0x01)                         */
#define GPIOx_FALLIE_PIN3_Pos             (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOx_FALLIE_PIN3_Msk             (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOx_FALLIE_PIN2_Pos             (2UL)                     /*!< PIN2 (Bit 2)                                       */
#define GPIOx_FALLIE_PIN2_Msk             (0x4UL)                   /*!< PIN2 (Bitfield-Mask: 0x01)                         */
#define GPIOx_FALLIE_PIN1_Pos             (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOx_FALLIE_PIN1_Msk             (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOx_FALLIE_PIN0_Pos             (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOx_FALLIE_PIN0_Msk             (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ========================================================  HIGHIE  ========================================================= */
#define GPIOx_HIGHIE_PIN15_Pos            (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOx_HIGHIE_PIN15_Msk            (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOx_HIGHIE_PIN14_Pos            (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOx_HIGHIE_PIN14_Msk            (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOx_HIGHIE_PIN13_Pos            (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOx_HIGHIE_PIN13_Msk            (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
#define GPIOx_HIGHIE_PIN12_Pos            (12UL)                    /*!< PIN12 (Bit 12)                                     */
#define GPIOx_HIGHIE_PIN12_Msk            (0x1000UL)                /*!< PIN12 (Bitfield-Mask: 0x01)                        */
#define GPIOx_HIGHIE_PIN11_Pos            (11UL)                    /*!< PIN11 (Bit 11)                                     */
#define GPIOx_HIGHIE_PIN11_Msk            (0x800UL)                 /*!< PIN11 (Bitfield-Mask: 0x01)                        */
#define GPIOx_HIGHIE_PIN10_Pos            (10UL)                    /*!< PIN10 (Bit 10)                                     */
#define GPIOx_HIGHIE_PIN10_Msk            (0x400UL)                 /*!< PIN10 (Bitfield-Mask: 0x01)                        */
#define GPIOx_HIGHIE_PIN9_Pos             (9UL)                     /*!< PIN9 (Bit 9)                                       */
#define GPIOx_HIGHIE_PIN9_Msk             (0x200UL)                 /*!< PIN9 (Bitfield-Mask: 0x01)                         */
#define GPIOx_HIGHIE_PIN8_Pos             (8UL)                     /*!< PIN8 (Bit 8)                                       */
#define GPIOx_HIGHIE_PIN8_Msk             (0x100UL)                 /*!< PIN8 (Bitfield-Mask: 0x01)                         */
#define GPIOx_HIGHIE_PIN7_Pos             (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOx_HIGHIE_PIN7_Msk             (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOx_HIGHIE_PIN6_Pos             (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOx_HIGHIE_PIN6_Msk             (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOx_HIGHIE_PIN5_Pos             (5UL)                     /*!< PIN5 (Bit 5)                                       */
#define GPIOx_HIGHIE_PIN5_Msk             (0x20UL)                  /*!< PIN5 (Bitfield-Mask: 0x01)                         */
#define GPIOx_HIGHIE_PIN4_Pos             (4UL)                     /*!< PIN4 (Bit 4)                                       */
#define GPIOx_HIGHIE_PIN4_Msk             (0x10UL)                  /*!< PIN4 (Bitfield-Mask: 0x01)                         */
#define GPIOx_HIGHIE_PIN3_Pos             (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOx_HIGHIE_PIN3_Msk             (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOx_HIGHIE_PIN2_Pos             (2UL)                     /*!< PIN2 (Bit 2)                                       */
#define GPIOx_HIGHIE_PIN2_Msk             (0x4UL)                   /*!< PIN2 (Bitfield-Mask: 0x01)                         */
#define GPIOx_HIGHIE_PIN1_Pos             (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOx_HIGHIE_PIN1_Msk             (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOx_HIGHIE_PIN0_Pos             (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOx_HIGHIE_PIN0_Msk             (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* =========================================================  LOWIE  ========================================================= */
#define GPIOx_LOWIE_PIN15_Pos             (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOx_LOWIE_PIN15_Msk             (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOx_LOWIE_PIN14_Pos             (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOx_LOWIE_PIN14_Msk             (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOx_LOWIE_PIN13_Pos             (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOx_LOWIE_PIN13_Msk             (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
#define GPIOx_LOWIE_PIN12_Pos             (12UL)                    /*!< PIN12 (Bit 12)                                     */
#define GPIOx_LOWIE_PIN12_Msk             (0x1000UL)                /*!< PIN12 (Bitfield-Mask: 0x01)                        */
#define GPIOx_LOWIE_PIN11_Pos             (11UL)                    /*!< PIN11 (Bit 11)                                     */
