rushairer/LearnCW32/Libraries/inc/cw32f030.h
/* ==========================================================  DIR  ========================================================== */
#define GPIOC_DIR_PIN15_Pos               (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_DIR_PIN15_Msk               (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_DIR_PIN14_Pos               (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_DIR_PIN14_Msk               (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_DIR_PIN13_Pos               (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_DIR_PIN13_Msk               (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* =======================================================  OPENDRAIN  ======================================================= */
#define GPIOC_OPENDRAIN_PIN15_Pos         (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_OPENDRAIN_PIN15_Msk         (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_OPENDRAIN_PIN14_Pos         (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_OPENDRAIN_PIN14_Msk         (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_OPENDRAIN_PIN13_Pos         (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_OPENDRAIN_PIN13_Msk         (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* =========================================================  SPEED  ========================================================= */
#define GPIOC_SPEED_PIN15_Pos             (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_SPEED_PIN15_Msk             (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_SPEED_PIN14_Pos             (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_SPEED_PIN14_Msk             (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_SPEED_PIN13_Pos             (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_SPEED_PIN13_Msk             (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* ==========================================================  PDR  ========================================================== */
#define GPIOC_PDR_PIN15_Pos               (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_PDR_PIN15_Msk               (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_PDR_PIN14_Pos               (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_PDR_PIN14_Msk               (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_PDR_PIN13_Pos               (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_PDR_PIN13_Msk               (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* ==========================================================  PUR  ========================================================== */
#define GPIOC_PUR_PIN15_Pos               (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_PUR_PIN15_Msk               (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_PUR_PIN14_Pos               (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_PUR_PIN14_Msk               (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_PUR_PIN13_Pos               (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_PUR_PIN13_Msk               (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* =========================================================  AFRH  ========================================================== */
#define GPIOC_AFRH_AFR15_Pos              (28UL)                    /*!< AFR15 (Bit 28)                                     */
#define GPIOC_AFRH_AFR15_Msk              (0xf0000000UL)            /*!< AFR15 (Bitfield-Mask: 0x0f)                        */
#define GPIOC_AFRH_AFR14_Pos              (24UL)                    /*!< AFR14 (Bit 24)                                     */
#define GPIOC_AFRH_AFR14_Msk              (0xf000000UL)             /*!< AFR14 (Bitfield-Mask: 0x0f)                        */
#define GPIOC_AFRH_AFR13_Pos              (20UL)                    /*!< AFR13 (Bit 20)                                     */
#define GPIOC_AFRH_AFR13_Msk              (0xf00000UL)              /*!< AFR13 (Bitfield-Mask: 0x0f)                        */
/* ========================================================  ANALOG  ========================================================= */
#define GPIOC_ANALOG_PIN15_Pos            (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_ANALOG_PIN15_Msk            (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_ANALOG_PIN14_Pos            (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_ANALOG_PIN14_Msk            (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_ANALOG_PIN13_Pos            (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_ANALOG_PIN13_Msk            (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* ========================================================  DRIVER  ========================================================= */
#define GPIOC_DRIVER_PIN15_Pos            (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_DRIVER_PIN15_Msk            (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_DRIVER_PIN14_Pos            (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_DRIVER_PIN14_Msk            (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_DRIVER_PIN13_Pos            (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_DRIVER_PIN13_Msk            (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* ========================================================  RISEIE  ========================================================= */
#define GPIOC_RISEIE_PIN15_Pos            (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_RISEIE_PIN15_Msk            (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_RISEIE_PIN14_Pos            (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_RISEIE_PIN14_Msk            (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_RISEIE_PIN13_Pos            (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_RISEIE_PIN13_Msk            (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* ========================================================  FALLIE  ========================================================= */
#define GPIOC_FALLIE_PIN15_Pos            (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_FALLIE_PIN15_Msk            (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_FALLIE_PIN14_Pos            (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_FALLIE_PIN14_Msk            (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_FALLIE_PIN13_Pos            (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_FALLIE_PIN13_Msk            (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* ========================================================  HIGHIE  ========================================================= */
#define GPIOC_HIGHIE_PIN15_Pos            (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_HIGHIE_PIN15_Msk            (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_HIGHIE_PIN14_Pos            (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_HIGHIE_PIN14_Msk            (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_HIGHIE_PIN13_Pos            (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_HIGHIE_PIN13_Msk            (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* =========================================================  LOWIE  ========================================================= */
#define GPIOC_LOWIE_PIN15_Pos             (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_LOWIE_PIN15_Msk             (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_LOWIE_PIN14_Pos             (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_LOWIE_PIN14_Msk             (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_LOWIE_PIN13_Pos             (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_LOWIE_PIN13_Msk             (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* ==========================================================  ISR  ========================================================== */
#define GPIOC_ISR_PIN15_Pos               (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_ISR_PIN15_Msk               (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_ISR_PIN14_Pos               (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_ISR_PIN14_Msk               (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_ISR_PIN13_Pos               (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_ISR_PIN13_Msk               (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* ==========================================================  ICR  ========================================================== */
#define GPIOC_ICR_PIN15_Pos               (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_ICR_PIN15_Msk               (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_ICR_PIN14_Pos               (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_ICR_PIN14_Msk               (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_ICR_PIN13_Pos               (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_ICR_PIN13_Msk               (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* =========================================================  LOCK  ========================================================== */
#define GPIOC_LOCK_KEY_Pos                (16UL)                    /*!< KEY (Bit 16)                                       */
#define GPIOC_LOCK_KEY_Msk                (0xffff0000UL)            /*!< KEY (Bitfield-Mask: 0xffff)                        */
#define GPIOC_LOCK_PIN15_Pos              (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_LOCK_PIN15_Msk              (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_LOCK_PIN14_Pos              (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_LOCK_PIN14_Msk              (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_LOCK_PIN13_Pos              (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_LOCK_PIN13_Msk              (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* ========================================================  FILTER  ========================================================= */
#define GPIOC_FILTER_FLTCLK_Pos           (16UL)                    /*!< FLTCLK (Bit 16)                                    */
#define GPIOC_FILTER_FLTCLK_Msk           (0x70000UL)               /*!< FLTCLK (Bitfield-Mask: 0x07)                       */
#define GPIOC_FILTER_PIN15_Pos            (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_FILTER_PIN15_Msk            (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_FILTER_PIN14_Pos            (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_FILTER_PIN14_Msk            (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_FILTER_PIN13_Pos            (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_FILTER_PIN13_Msk            (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* ==========================================================  IDR  ========================================================== */
#define GPIOC_IDR_PIN15_Pos               (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_IDR_PIN15_Msk               (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_IDR_PIN14_Pos               (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_IDR_PIN14_Msk               (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_IDR_PIN13_Pos               (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_IDR_PIN13_Msk               (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* ==========================================================  ODR  ========================================================== */
#define GPIOC_ODR_PIN15_Pos               (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_ODR_PIN15_Msk               (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_ODR_PIN14_Pos               (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_ODR_PIN14_Msk               (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_ODR_PIN13_Pos               (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_ODR_PIN13_Msk               (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */
/* ======================================================  ODRLOWBYTE  ======================================================= */
#define GPIOC_ODRLOWBYTE_LOWBYTE_Pos      (0UL)                     /*!< LOWBYTE (Bit 0)                                    */
#define GPIOC_ODRLOWBYTE_LOWBYTE_Msk      (0xffUL)                  /*!< LOWBYTE (Bitfield-Mask: 0xff)                      */
/* ======================================================  ODRHIGHBYTE  ====================================================== */
#define GPIOC_ODRHIGHBYTE_HIGHBYTE_Pos    (0UL)                     /*!< HIGHBYTE (Bit 0)                                   */
#define GPIOC_ODRHIGHBYTE_HIGHBYTE_Msk    (0xffUL)                  /*!< HIGHBYTE (Bitfield-Mask: 0xff)                     */
/* ==========================================================  BRR  ========================================================== */
#define GPIOC_BRR_BRR15_Pos               (15UL)                    /*!< BRR15 (Bit 15)                                     */
#define GPIOC_BRR_BRR15_Msk               (0x8000UL)                /*!< BRR15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_BRR_BRR14_Pos               (14UL)                    /*!< BRR14 (Bit 14)                                     */
#define GPIOC_BRR_BRR14_Msk               (0x4000UL)                /*!< BRR14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_BRR_BRR13_Pos               (13UL)                    /*!< BRR13 (Bit 13)                                     */
#define GPIOC_BRR_BRR13_Msk               (0x2000UL)                /*!< BRR13 (Bitfield-Mask: 0x01)                        */
/* =========================================================  BSRR  ========================================================== */
#define GPIOC_BSRR_BRR15_Pos              (31UL)                    /*!< BRR15 (Bit 31)                                     */
#define GPIOC_BSRR_BRR15_Msk              (0x80000000UL)            /*!< BRR15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_BSRR_BRR14_Pos              (30UL)                    /*!< BRR14 (Bit 30)                                     */
#define GPIOC_BSRR_BRR14_Msk              (0x40000000UL)            /*!< BRR14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_BSRR_BRR13_Pos              (29UL)                    /*!< BRR13 (Bit 29)                                     */
#define GPIOC_BSRR_BRR13_Msk              (0x20000000UL)            /*!< BRR13 (Bitfield-Mask: 0x01)                        */
#define GPIOC_BSRR_BSS15_Pos              (15UL)                    /*!< BSS15 (Bit 15)                                     */
#define GPIOC_BSRR_BSS15_Msk              (0x8000UL)                /*!< BSS15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_BSRR_BSS14_Pos              (14UL)                    /*!< BSS14 (Bit 14)                                     */
#define GPIOC_BSRR_BSS14_Msk              (0x4000UL)                /*!< BSS14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_BSRR_BSS13_Pos              (13UL)                    /*!< BSS13 (Bit 13)                                     */
#define GPIOC_BSRR_BSS13_Msk              (0x2000UL)                /*!< BSS13 (Bitfield-Mask: 0x01)                        */
/* ==========================================================  TOG  ========================================================== */
#define GPIOC_TOG_PIN15_Pos               (15UL)                    /*!< PIN15 (Bit 15)                                     */
#define GPIOC_TOG_PIN15_Msk               (0x8000UL)                /*!< PIN15 (Bitfield-Mask: 0x01)                        */
#define GPIOC_TOG_PIN14_Pos               (14UL)                    /*!< PIN14 (Bit 14)                                     */
#define GPIOC_TOG_PIN14_Msk               (0x4000UL)                /*!< PIN14 (Bitfield-Mask: 0x01)                        */
#define GPIOC_TOG_PIN13_Pos               (13UL)                    /*!< PIN13 (Bit 13)                                     */
#define GPIOC_TOG_PIN13_Msk               (0x2000UL)                /*!< PIN13 (Bitfield-Mask: 0x01)                        */


/* =========================================================================================================================== */
/* ================                                           GPIOF                                           ================ */
/* =========================================================================================================================== */

