rushairer/LearnCW32/Libraries/inc/cw32f030.h
/* ==========================================================  DIR  ========================================================== */
#define GPIOF_DIR_PIN7_Pos                (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_DIR_PIN7_Msk                (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_DIR_PIN6_Pos                (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_DIR_PIN6_Msk                (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_DIR_PIN3_Pos                (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_DIR_PIN3_Msk                (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_DIR_PIN1_Pos                (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_DIR_PIN1_Msk                (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_DIR_PIN0_Pos                (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_DIR_PIN0_Msk                (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* =======================================================  OPENDRAIN  ======================================================= */
#define GPIOF_OPENDRAIN_PIN7_Pos          (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_OPENDRAIN_PIN7_Msk          (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_OPENDRAIN_PIN6_Pos          (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_OPENDRAIN_PIN6_Msk          (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_OPENDRAIN_PIN3_Pos          (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_OPENDRAIN_PIN3_Msk          (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_OPENDRAIN_PIN1_Pos          (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_OPENDRAIN_PIN1_Msk          (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_OPENDRAIN_PIN0_Pos          (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_OPENDRAIN_PIN0_Msk          (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* =========================================================  SPEED  ========================================================= */
#define GPIOF_SPEED_PIN7_Pos              (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_SPEED_PIN7_Msk              (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_SPEED_PIN6_Pos              (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_SPEED_PIN6_Msk              (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_SPEED_PIN3_Pos              (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_SPEED_PIN3_Msk              (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_SPEED_PIN1_Pos              (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_SPEED_PIN1_Msk              (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_SPEED_PIN0_Pos              (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_SPEED_PIN0_Msk              (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  PDR  ========================================================== */
#define GPIOF_PDR_PIN7_Pos                (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_PDR_PIN7_Msk                (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_PDR_PIN6_Pos                (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_PDR_PIN6_Msk                (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_PDR_PIN3_Pos                (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_PDR_PIN3_Msk                (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_PDR_PIN1_Pos                (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_PDR_PIN1_Msk                (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_PDR_PIN0_Pos                (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_PDR_PIN0_Msk                (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  PUR  ========================================================== */
#define GPIOF_PUR_PIN7_Pos                (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_PUR_PIN7_Msk                (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_PUR_PIN6_Pos                (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_PUR_PIN6_Msk                (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_PUR_PIN3_Pos                (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_PUR_PIN3_Msk                (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_PUR_PIN1_Pos                (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_PUR_PIN1_Msk                (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_PUR_PIN0_Pos                (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_PUR_PIN0_Msk                (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* =========================================================  AFRL  ========================================================== */
#define GPIOF_AFRL_AFR7_Pos               (28UL)                    /*!< AFR7 (Bit 28)                                      */
#define GPIOF_AFRL_AFR7_Msk               (0xf0000000UL)            /*!< AFR7 (Bitfield-Mask: 0x0f)                         */
#define GPIOF_AFRL_AFR6_Pos               (24UL)                    /*!< AFR6 (Bit 24)                                      */
#define GPIOF_AFRL_AFR6_Msk               (0xf000000UL)             /*!< AFR6 (Bitfield-Mask: 0x0f)                         */
#define GPIOF_AFRL_AFR3_Pos               (12UL)                    /*!< AFR3 (Bit 12)                                      */
#define GPIOF_AFRL_AFR3_Msk               (0xf000UL)                /*!< AFR3 (Bitfield-Mask: 0x0f)                         */
#define GPIOF_AFRL_AFR1_Pos               (4UL)                     /*!< AFR1 (Bit 4)                                       */
#define GPIOF_AFRL_AFR1_Msk               (0xf0UL)                  /*!< AFR1 (Bitfield-Mask: 0x0f)                         */
#define GPIOF_AFRL_AFR0_Pos               (0UL)                     /*!< AFR0 (Bit 0)                                       */
#define GPIOF_AFRL_AFR0_Msk               (0xfUL)                   /*!< AFR0 (Bitfield-Mask: 0x0f)                         */
/* ========================================================  ANALOG  ========================================================= */
#define GPIOF_ANALOG_PIN7_Pos             (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_ANALOG_PIN7_Msk             (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ANALOG_PIN6_Pos             (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_ANALOG_PIN6_Msk             (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ANALOG_PIN3_Pos             (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_ANALOG_PIN3_Msk             (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ANALOG_PIN1_Pos             (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_ANALOG_PIN1_Msk             (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ANALOG_PIN0_Pos             (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_ANALOG_PIN0_Msk             (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ========================================================  DRIVER  ========================================================= */
#define GPIOF_DRIVER_PIN7_Pos             (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_DRIVER_PIN7_Msk             (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_DRIVER_PIN6_Pos             (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_DRIVER_PIN6_Msk             (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_DRIVER_PIN3_Pos             (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_DRIVER_PIN3_Msk             (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_DRIVER_PIN1_Pos             (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_DRIVER_PIN1_Msk             (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_DRIVER_PIN0_Pos             (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_DRIVER_PIN0_Msk             (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ========================================================  RISEIE  ========================================================= */
#define GPIOF_RISEIE_PIN7_Pos             (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_RISEIE_PIN7_Msk             (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_RISEIE_PIN6_Pos             (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_RISEIE_PIN6_Msk             (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_RISEIE_PIN3_Pos             (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_RISEIE_PIN3_Msk             (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_RISEIE_PIN1_Pos             (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_RISEIE_PIN1_Msk             (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_RISEIE_PIN0_Pos             (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_RISEIE_PIN0_Msk             (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ========================================================  FALLIE  ========================================================= */
#define GPIOF_FALLIE_PIN7_Pos             (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_FALLIE_PIN7_Msk             (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_FALLIE_PIN6_Pos             (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_FALLIE_PIN6_Msk             (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_FALLIE_PIN3_Pos             (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_FALLIE_PIN3_Msk             (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_FALLIE_PIN1_Pos             (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_FALLIE_PIN1_Msk             (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_FALLIE_PIN0_Pos             (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_FALLIE_PIN0_Msk             (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ========================================================  HIGHIE  ========================================================= */
#define GPIOF_HIGHIE_PIN7_Pos             (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_HIGHIE_PIN7_Msk             (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_HIGHIE_PIN6_Pos             (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_HIGHIE_PIN6_Msk             (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_HIGHIE_PIN3_Pos             (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_HIGHIE_PIN3_Msk             (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_HIGHIE_PIN1_Pos             (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_HIGHIE_PIN1_Msk             (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_HIGHIE_PIN0_Pos             (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_HIGHIE_PIN0_Msk             (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* =========================================================  LOWIE  ========================================================= */
#define GPIOF_LOWIE_PIN7_Pos              (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_LOWIE_PIN7_Msk              (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_LOWIE_PIN6_Pos              (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_LOWIE_PIN6_Msk              (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_LOWIE_PIN3_Pos              (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_LOWIE_PIN3_Msk              (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_LOWIE_PIN1_Pos              (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_LOWIE_PIN1_Msk              (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_LOWIE_PIN0_Pos              (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_LOWIE_PIN0_Msk              (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  ISR  ========================================================== */
#define GPIOF_ISR_PIN7_Pos                (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_ISR_PIN7_Msk                (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ISR_PIN6_Pos                (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_ISR_PIN6_Msk                (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ISR_PIN3_Pos                (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_ISR_PIN3_Msk                (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ISR_PIN1_Pos                (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_ISR_PIN1_Msk                (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ISR_PIN0_Pos                (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_ISR_PIN0_Msk                (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  ICR  ========================================================== */
#define GPIOF_ICR_PIN7_Pos                (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_ICR_PIN7_Msk                (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ICR_PIN6_Pos                (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_ICR_PIN6_Msk                (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ICR_PIN3_Pos                (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_ICR_PIN3_Msk                (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ICR_PIN1_Pos                (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_ICR_PIN1_Msk                (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ICR_PIN0_Pos                (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_ICR_PIN0_Msk                (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* =========================================================  LOCK  ========================================================== */
#define GPIOF_LOCK_KEY_Pos                (16UL)                    /*!< KEY (Bit 16)                                       */
#define GPIOF_LOCK_KEY_Msk                (0xffff0000UL)            /*!< KEY (Bitfield-Mask: 0xffff)                        */
#define GPIOF_LOCK_PIN7_Pos               (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_LOCK_PIN7_Msk               (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_LOCK_PIN6_Pos               (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_LOCK_PIN6_Msk               (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_LOCK_PIN3_Pos               (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_LOCK_PIN3_Msk               (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_LOCK_PIN1_Pos               (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_LOCK_PIN1_Msk               (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_LOCK_PIN0_Pos               (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_LOCK_PIN0_Msk               (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ========================================================  FILTER  ========================================================= */
#define GPIOF_FILTER_FLTCLK_Pos           (16UL)                    /*!< FLTCLK (Bit 16)                                    */
#define GPIOF_FILTER_FLTCLK_Msk           (0x70000UL)               /*!< FLTCLK (Bitfield-Mask: 0x07)                       */
#define GPIOF_FILTER_PIN7_Pos             (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_FILTER_PIN7_Msk             (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_FILTER_PIN6_Pos             (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_FILTER_PIN6_Msk             (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_FILTER_PIN3_Pos             (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_FILTER_PIN3_Msk             (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_FILTER_PIN1_Pos             (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_FILTER_PIN1_Msk             (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_FILTER_PIN0_Pos             (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_FILTER_PIN0_Msk             (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  IDR  ========================================================== */
#define GPIOF_IDR_PIN7_Pos                (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_IDR_PIN7_Msk                (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_IDR_PIN6_Pos                (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_IDR_PIN6_Msk                (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_IDR_PIN3_Pos                (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_IDR_PIN3_Msk                (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
