rushairer/LearnCW32/Libraries/inc/cw32f030.h
#define GPIOF_IDR_PIN1_Pos                (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_IDR_PIN1_Msk                (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_IDR_PIN0_Pos                (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_IDR_PIN0_Msk                (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  ODR  ========================================================== */
#define GPIOF_ODR_PIN7_Pos                (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_ODR_PIN7_Msk                (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ODR_PIN6_Pos                (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_ODR_PIN6_Msk                (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ODR_PIN3_Pos                (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_ODR_PIN3_Msk                (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ODR_PIN1_Pos                (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_ODR_PIN1_Msk                (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_ODR_PIN0_Pos                (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_ODR_PIN0_Msk                (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */
/* ======================================================  ODRLOWBYTE  ======================================================= */
#define GPIOF_ODRLOWBYTE_LOWBYTE_Pos      (0UL)                     /*!< LOWBYTE (Bit 0)                                    */
#define GPIOF_ODRLOWBYTE_LOWBYTE_Msk      (0xffUL)                  /*!< LOWBYTE (Bitfield-Mask: 0xff)                      */
/* ==========================================================  BRR  ========================================================== */
#define GPIOF_BRR_BRR7_Pos                (7UL)                     /*!< BRR7 (Bit 7)                                       */
#define GPIOF_BRR_BRR7_Msk                (0x80UL)                  /*!< BRR7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_BRR_BRR6_Pos                (6UL)                     /*!< BRR6 (Bit 6)                                       */
#define GPIOF_BRR_BRR6_Msk                (0x40UL)                  /*!< BRR6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_BRR_BRR3_Pos                (3UL)                     /*!< BRR3 (Bit 3)                                       */
#define GPIOF_BRR_BRR3_Msk                (0x8UL)                   /*!< BRR3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_BRR_BRR1_Pos                (1UL)                     /*!< BRR1 (Bit 1)                                       */
#define GPIOF_BRR_BRR1_Msk                (0x2UL)                   /*!< BRR1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_BRR_BRR0_Pos                (0UL)                     /*!< BRR0 (Bit 0)                                       */
#define GPIOF_BRR_BRR0_Msk                (0x1UL)                   /*!< BRR0 (Bitfield-Mask: 0x01)                         */
/* =========================================================  BSRR  ========================================================== */
#define GPIOF_BSRR_BSS7_Pos               (7UL)                     /*!< BSS7 (Bit 7)                                       */
#define GPIOF_BSRR_BSS7_Msk               (0x80UL)                  /*!< BSS7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_BSRR_BSS6_Pos               (6UL)                     /*!< BSS6 (Bit 6)                                       */
#define GPIOF_BSRR_BSS6_Msk               (0x40UL)                  /*!< BSS6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_BSRR_BSS3_Pos               (3UL)                     /*!< BSS3 (Bit 3)                                       */
#define GPIOF_BSRR_BSS3_Msk               (0x8UL)                   /*!< BSS3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_BSRR_BSS1_Pos               (1UL)                     /*!< BSS1 (Bit 1)                                       */
#define GPIOF_BSRR_BSS1_Msk               (0x2UL)                   /*!< BSS1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_BSRR_BSS0_Pos               (0UL)                     /*!< BSS0 (Bit 0)                                       */
#define GPIOF_BSRR_BSS0_Msk               (0x1UL)                   /*!< BSS0 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  TOG  ========================================================== */
#define GPIOF_TOG_PIN7_Pos                (7UL)                     /*!< PIN7 (Bit 7)                                       */
#define GPIOF_TOG_PIN7_Msk                (0x80UL)                  /*!< PIN7 (Bitfield-Mask: 0x01)                         */
#define GPIOF_TOG_PIN6_Pos                (6UL)                     /*!< PIN6 (Bit 6)                                       */
#define GPIOF_TOG_PIN6_Msk                (0x40UL)                  /*!< PIN6 (Bitfield-Mask: 0x01)                         */
#define GPIOF_TOG_PIN3_Pos                (3UL)                     /*!< PIN3 (Bit 3)                                       */
#define GPIOF_TOG_PIN3_Msk                (0x8UL)                   /*!< PIN3 (Bitfield-Mask: 0x01)                         */
#define GPIOF_TOG_PIN1_Pos                (1UL)                     /*!< PIN1 (Bit 1)                                       */
#define GPIOF_TOG_PIN1_Msk                (0x2UL)                   /*!< PIN1 (Bitfield-Mask: 0x01)                         */
#define GPIOF_TOG_PIN0_Pos                (0UL)                     /*!< PIN0 (Bit 0)                                       */
#define GPIOF_TOG_PIN0_Msk                (0x1UL)                   /*!< PIN0 (Bitfield-Mask: 0x01)                         */


/* =========================================================================================================================== */
/* ================                                           GTIM                                            ================ */
/* =========================================================================================================================== */

