rushairer/LearnCW32/Libraries/inc/cw32f030.h
/* ==========================================================  ARR  ========================================================== */
#define GTIMx_ARR_ARR_Pos                 (0UL)                     /*!< ARR (Bit 0)                                        */
#define GTIMx_ARR_ARR_Msk                 (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                        */
/* ==========================================================  CNT  ========================================================== */
#define GTIMx_CNT_CNT_Pos                 (0UL)                     /*!< CNT (Bit 0)                                        */
#define GTIMx_CNT_CNT_Msk                 (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CMMR  ========================================================== */
#define GTIMx_CMMR_CC4M_Pos               (12UL)                    /*!< CC4M (Bit 12)                                      */
#define GTIMx_CMMR_CC4M_Msk               (0xf000UL)                /*!< CC4M (Bitfield-Mask: 0x0f)                         */
#define GTIMx_CMMR_CC3M_Pos               (8UL)                     /*!< CC3M (Bit 8)                                       */
#define GTIMx_CMMR_CC3M_Msk               (0xf00UL)                 /*!< CC3M (Bitfield-Mask: 0x0f)                         */
#define GTIMx_CMMR_CC2M_Pos               (4UL)                     /*!< CC2M (Bit 4)                                       */
#define GTIMx_CMMR_CC2M_Msk               (0xf0UL)                  /*!< CC2M (Bitfield-Mask: 0x0f)                         */
#define GTIMx_CMMR_CC1M_Pos               (0UL)                     /*!< CC1M (Bit 0)                                       */
#define GTIMx_CMMR_CC1M_Msk               (0xfUL)                   /*!< CC1M (Bitfield-Mask: 0x0f)                         */
/* ==========================================================  ETR  ========================================================== */
#define GTIMx_ETR_ETRFLT_Pos              (4UL)                     /*!< ETRFLT (Bit 4)                                     */
#define GTIMx_ETR_ETRFLT_Msk              (0x70UL)                  /*!< ETRFLT (Bitfield-Mask: 0x07)                       */
/* ==========================================================  CR0  ========================================================== */
#define GTIMx_CR0_ENCRELOAD_Pos           (19UL)                    /*!< ENCRELOAD (Bit 19)                                 */
#define GTIMx_CR0_ENCRELOAD_Msk           (0x180000UL)              /*!< ENCRELOAD (Bitfield-Mask: 0x03)                    */
#define GTIMx_CR0_ENCRESET_Pos            (17UL)                    /*!< ENCRESET (Bit 17)                                  */
#define GTIMx_CR0_ENCRESET_Msk            (0x60000UL)               /*!< ENCRESET (Bitfield-Mask: 0x03)                     */
#define GTIMx_CR0_ENCMODE_Pos             (15UL)                    /*!< ENCMODE (Bit 15)                                   */
#define GTIMx_CR0_ENCMODE_Msk             (0x18000UL)               /*!< ENCMODE (Bitfield-Mask: 0x03)                      */
#define GTIMx_CR0_PRSSTATUS_Pos           (11UL)                    /*!< PRSSTATUS (Bit 11)                                 */
#define GTIMx_CR0_PRSSTATUS_Msk           (0x7800UL)                /*!< PRSSTATUS (Bitfield-Mask: 0x0f)                    */
#define GTIMx_CR0_PRS_Pos                 (7UL)                     /*!< PRS (Bit 7)                                        */
#define GTIMx_CR0_PRS_Msk                 (0x780UL)                 /*!< PRS (Bitfield-Mask: 0x0f)                          */
#define GTIMx_CR0_TOGEN_Pos               (6UL)                     /*!< TOGEN (Bit 6)                                      */
#define GTIMx_CR0_TOGEN_Msk               (0x40UL)                  /*!< TOGEN (Bitfield-Mask: 0x01)                        */
#define GTIMx_CR0_ONESHOT_Pos             (5UL)                     /*!< ONESHOT (Bit 5)                                    */
#define GTIMx_CR0_ONESHOT_Msk             (0x20UL)                  /*!< ONESHOT (Bitfield-Mask: 0x01)                      */
#define GTIMx_CR0_POL_Pos                 (4UL)                     /*!< POL (Bit 4)                                        */
#define GTIMx_CR0_POL_Msk                 (0x10UL)                  /*!< POL (Bitfield-Mask: 0x01)                          */
#define GTIMx_CR0_TRS_Pos                 (3UL)                     /*!< TRS (Bit 3)                                        */
#define GTIMx_CR0_TRS_Msk                 (0x8UL)                   /*!< TRS (Bitfield-Mask: 0x01)                          */
#define GTIMx_CR0_MODE_Pos                (1UL)                     /*!< MODE (Bit 1)                                       */
#define GTIMx_CR0_MODE_Msk                (0x6UL)                   /*!< MODE (Bitfield-Mask: 0x03)                         */
#define GTIMx_CR0_EN_Pos                  (0UL)                     /*!< EN (Bit 0)                                         */
#define GTIMx_CR0_EN_Msk                  (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  IER  ========================================================== */
#define GTIMx_IER_DIRCHANGE_Pos           (9UL)                     /*!< DIRCHANGE (Bit 9)                                  */
#define GTIMx_IER_DIRCHANGE_Msk           (0x200UL)                 /*!< DIRCHANGE (Bitfield-Mask: 0x01)                    */
#define GTIMx_IER_CC4_Pos                 (6UL)                     /*!< CC4 (Bit 6)                                        */
#define GTIMx_IER_CC4_Msk                 (0x40UL)                  /*!< CC4 (Bitfield-Mask: 0x01)                          */
#define GTIMx_IER_CC3_Pos                 (5UL)                     /*!< CC3 (Bit 5)                                        */
#define GTIMx_IER_CC3_Msk                 (0x20UL)                  /*!< CC3 (Bitfield-Mask: 0x01)                          */
#define GTIMx_IER_CC2_Pos                 (4UL)                     /*!< CC2 (Bit 4)                                        */
#define GTIMx_IER_CC2_Msk                 (0x10UL)                  /*!< CC2 (Bitfield-Mask: 0x01)                          */
#define GTIMx_IER_CC1_Pos                 (3UL)                     /*!< CC1 (Bit 3)                                        */
#define GTIMx_IER_CC1_Msk                 (0x8UL)                   /*!< CC1 (Bitfield-Mask: 0x01)                          */
#define GTIMx_IER_UD_Pos                  (2UL)                     /*!< UD (Bit 2)                                         */
#define GTIMx_IER_UD_Msk                  (0x4UL)                   /*!< UD (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_TI_Pos                  (1UL)                     /*!< TI (Bit 1)                                         */
#define GTIMx_IER_TI_Msk                  (0x2UL)                   /*!< TI (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_OV_Pos                  (0UL)                     /*!< OV (Bit 0)                                         */
#define GTIMx_IER_OV_Msk                  (0x1UL)                   /*!< OV (Bitfield-Mask: 0x01)                           */
/* ==========================================================  ISR  ========================================================== */
#define GTIMx_ISR_DIR_Pos                 (10UL)                    /*!< DIR (Bit 10)                                       */
#define GTIMx_ISR_DIR_Msk                 (0x400UL)                 /*!< DIR (Bitfield-Mask: 0x01)                          */
#define GTIMx_ISR_DIRCHANGE_Pos           (9UL)                     /*!< DIRCHANGE (Bit 9)                                  */
#define GTIMx_ISR_DIRCHANGE_Msk           (0x200UL)                 /*!< DIRCHANGE (Bitfield-Mask: 0x01)                    */
#define GTIMx_ISR_CC4_Pos                 (6UL)                     /*!< CC4 (Bit 6)                                        */
#define GTIMx_ISR_CC4_Msk                 (0x40UL)                  /*!< CC4 (Bitfield-Mask: 0x01)                          */
#define GTIMx_ISR_CC3_Pos                 (5UL)                     /*!< CC3 (Bit 5)                                        */
#define GTIMx_ISR_CC3_Msk                 (0x20UL)                  /*!< CC3 (Bitfield-Mask: 0x01)                          */
#define GTIMx_ISR_CC2_Pos                 (4UL)                     /*!< CC2 (Bit 4)                                        */
#define GTIMx_ISR_CC2_Msk                 (0x10UL)                  /*!< CC2 (Bitfield-Mask: 0x01)                          */
#define GTIMx_ISR_CC1_Pos                 (3UL)                     /*!< CC1 (Bit 3)                                        */
#define GTIMx_ISR_CC1_Msk                 (0x8UL)                   /*!< CC1 (Bitfield-Mask: 0x01)                          */
#define GTIMx_ISR_UD_Pos                  (2UL)                     /*!< UD (Bit 2)                                         */
#define GTIMx_ISR_UD_Msk                  (0x4UL)                   /*!< UD (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_TI_Pos                  (1UL)                     /*!< TI (Bit 1)                                         */
#define GTIMx_ISR_TI_Msk                  (0x2UL)                   /*!< TI (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_OV_Pos                  (0UL)                     /*!< OV (Bit 0)                                         */
#define GTIMx_ISR_OV_Msk                  (0x1UL)                   /*!< OV (Bitfield-Mask: 0x01)                           */
/* ==========================================================  ICR  ========================================================== */
#define GTIMx_ICR_DIRCHANGE_Pos           (9UL)                     /*!< DIRCHANGE (Bit 9)                                  */
#define GTIMx_ICR_DIRCHANGE_Msk           (0x200UL)                 /*!< DIRCHANGE (Bitfield-Mask: 0x01)                    */
#define GTIMx_ICR_CC4_Pos                 (6UL)                     /*!< CC4 (Bit 6)                                        */
#define GTIMx_ICR_CC4_Msk                 (0x40UL)                  /*!< CC4 (Bitfield-Mask: 0x01)                          */
#define GTIMx_ICR_CC3_Pos                 (5UL)                     /*!< CC3 (Bit 5)                                        */
#define GTIMx_ICR_CC3_Msk                 (0x20UL)                  /*!< CC3 (Bitfield-Mask: 0x01)                          */
#define GTIMx_ICR_CC2_Pos                 (4UL)                     /*!< CC2 (Bit 4)                                        */
#define GTIMx_ICR_CC2_Msk                 (0x10UL)                  /*!< CC2 (Bitfield-Mask: 0x01)                          */
#define GTIMx_ICR_CC1_Pos                 (3UL)                     /*!< CC1 (Bit 3)                                        */
#define GTIMx_ICR_CC1_Msk                 (0x8UL)                   /*!< CC1 (Bitfield-Mask: 0x01)                          */
#define GTIMx_ICR_UD_Pos                  (2UL)                     /*!< UD (Bit 2)                                         */
#define GTIMx_ICR_UD_Msk                  (0x4UL)                   /*!< UD (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_TI_Pos                  (1UL)                     /*!< TI (Bit 1)                                         */
#define GTIMx_ICR_TI_Msk                  (0x2UL)                   /*!< TI (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_OV_Pos                  (0UL)                     /*!< OV (Bit 0)                                         */
#define GTIMx_ICR_OV_Msk                  (0x1UL)                   /*!< OV (Bitfield-Mask: 0x01)                           */
/* =========================================================  CCR1  ========================================================== */
#define GTIMx_CCR1_CCR_Pos                (0UL)                     /*!< CCR (Bit 0)                                        */
#define GTIMx_CCR1_CCR_Msk                (0xffffUL)                /*!< CCR (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CCR2  ========================================================== */
#define GTIMx_CCR2_CCR_Pos                (0UL)                     /*!< CCR (Bit 0)                                        */
#define GTIMx_CCR2_CCR_Msk                (0xffffUL)                /*!< CCR (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CCR3  ========================================================== */
#define GTIMx_CCR3_CCR_Pos                (0UL)                     /*!< CCR (Bit 0)                                        */
#define GTIMx_CCR3_CCR_Msk                (0xffffUL)                /*!< CCR (Bitfield-Mask: 0xffff)                        */
/* =========================================================  CCR4  ========================================================== */
#define GTIMx_CCR4_CCR_Pos                (0UL)                     /*!< CCR (Bit 0)                                        */
#define GTIMx_CCR4_CCR_Msk                (0xffffUL)                /*!< CCR (Bitfield-Mask: 0xffff)                        */
/* ==========================================================  CR1  ========================================================== */
#define GTIMx_CR1_CH4POL_Pos              (15UL)                    /*!< CH4POL (Bit 15)                                    */
#define GTIMx_CR1_CH4POL_Msk              (0x8000UL)                /*!< CH4POL (Bitfield-Mask: 0x01)                       */
#define GTIMx_CR1_CH4FLT_Pos              (12UL)                    /*!< CH4FLT (Bit 12)                                    */
#define GTIMx_CR1_CH4FLT_Msk              (0x7000UL)                /*!< CH4FLT (Bitfield-Mask: 0x07)                       */
#define GTIMx_CR1_CH3POL_Pos              (11UL)                    /*!< CH3POL (Bit 11)                                    */
#define GTIMx_CR1_CH3POL_Msk              (0x800UL)                 /*!< CH3POL (Bitfield-Mask: 0x01)                       */
#define GTIMx_CR1_CH3FLT_Pos              (8UL)                     /*!< CH3FLT (Bit 8)                                     */
#define GTIMx_CR1_CH3FLT_Msk              (0x700UL)                 /*!< CH3FLT (Bitfield-Mask: 0x07)                       */
#define GTIMx_CR1_CH2POL_Pos              (7UL)                     /*!< CH2POL (Bit 7)                                     */
#define GTIMx_CR1_CH2POL_Msk              (0x80UL)                  /*!< CH2POL (Bitfield-Mask: 0x01)                       */
#define GTIMx_CR1_CH2FLT_Pos              (4UL)                     /*!< CH2FLT (Bit 4)                                     */
#define GTIMx_CR1_CH2FLT_Msk              (0x70UL)                  /*!< CH2FLT (Bitfield-Mask: 0x07)                       */
#define GTIMx_CR1_CH1POL_Pos              (3UL)                     /*!< CH1POL (Bit 3)                                     */
#define GTIMx_CR1_CH1POL_Msk              (0x8UL)                   /*!< CH1POL (Bitfield-Mask: 0x01)                       */
#define GTIMx_CR1_CH1FLT_Pos              (0UL)                     /*!< CH1FLT (Bit 0)                                     */
#define GTIMx_CR1_CH1FLT_Msk              (0x7UL)                   /*!< CH1FLT (Bitfield-Mask: 0x07)                       */
/* ==========================================================  DMA  ========================================================== */
#define GTIMx_DMA_CC4_Pos                 (5UL)                     /*!< CC4 (Bit 5)                                        */
#define GTIMx_DMA_CC4_Msk                 (0x20UL)                  /*!< CC4 (Bitfield-Mask: 0x01)                          */
#define GTIMx_DMA_CC3_Pos                 (4UL)                     /*!< CC3 (Bit 4)                                        */
#define GTIMx_DMA_CC3_Msk                 (0x10UL)                  /*!< CC3 (Bitfield-Mask: 0x01)                          */
#define GTIMx_DMA_CC2_Pos                 (3UL)                     /*!< CC2 (Bit 3)                                        */
#define GTIMx_DMA_CC2_Msk                 (0x8UL)                   /*!< CC2 (Bitfield-Mask: 0x01)                          */
#define GTIMx_DMA_CC1_Pos                 (2UL)                     /*!< CC1 (Bit 2)                                        */
#define GTIMx_DMA_CC1_Msk                 (0x4UL)                   /*!< CC1 (Bitfield-Mask: 0x01)                          */
#define GTIMx_DMA_TRS_Pos                 (1UL)                     /*!< TRS (Bit 1)                                        */
#define GTIMx_DMA_TRS_Msk                 (0x2UL)                   /*!< TRS (Bitfield-Mask: 0x01)                          */
#define GTIMx_DMA_OV_Pos                  (0UL)                     /*!< OV (Bit 0)                                         */
#define GTIMx_DMA_OV_Msk                  (0x1UL)                   /*!< OV (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                            I2C                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  BRREN  ========================================================= */
#define I2Cx_BRREN_EN_Pos                 (0UL)                     /*!< EN (Bit 0)                                         */
#define I2Cx_BRREN_EN_Msk                 (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  BRR  ========================================================== */
#define I2Cx_BRR_BRR_Pos                  (0UL)                     /*!< BRR (Bit 0)                                        */
#define I2Cx_BRR_BRR_Msk                  (0xffUL)                  /*!< BRR (Bitfield-Mask: 0xff)                          */
/* ==========================================================  CR  =========================================================== */
#define I2Cx_CR_EN_Pos                    (6UL)                     /*!< EN (Bit 6)                                         */
#define I2Cx_CR_EN_Msk                    (0x40UL)                  /*!< EN (Bitfield-Mask: 0x01)                           */
#define I2Cx_CR_STA_Pos                   (5UL)                     /*!< STA (Bit 5)                                        */
#define I2Cx_CR_STA_Msk                   (0x20UL)                  /*!< STA (Bitfield-Mask: 0x01)                          */
#define I2Cx_CR_STO_Pos                   (4UL)                     /*!< STO (Bit 4)                                        */
#define I2Cx_CR_STO_Msk                   (0x10UL)                  /*!< STO (Bitfield-Mask: 0x01)                          */
#define I2Cx_CR_SI_Pos                    (3UL)                     /*!< SI (Bit 3)                                         */
#define I2Cx_CR_SI_Msk                    (0x8UL)                   /*!< SI (Bitfield-Mask: 0x01)                           */
#define I2Cx_CR_AA_Pos                    (2UL)                     /*!< AA (Bit 2)                                         */
#define I2Cx_CR_AA_Msk                    (0x4UL)                   /*!< AA (Bitfield-Mask: 0x01)                           */
#define I2Cx_CR_FLT_Pos                   (0UL)                     /*!< FLT (Bit 0)                                        */
#define I2Cx_CR_FLT_Msk                   (0x1UL)                   /*!< FLT (Bitfield-Mask: 0x01)                          */
/* ==========================================================  DR  =========================================================== */
#define I2Cx_DR_DR_Pos                    (0UL)                     /*!< DR (Bit 0)                                         */
#define I2Cx_DR_DR_Msk                    (0xffUL)                  /*!< DR (Bitfield-Mask: 0xff)                           */
/* =========================================================  ADDR0  ========================================================= */
#define I2Cx_ADDR0_ADDR0_Pos              (1UL)                     /*!< ADDR0 (Bit 1)                                      */
#define I2Cx_ADDR0_ADDR0_Msk              (0xfeUL)                  /*!< ADDR0 (Bitfield-Mask: 0x7f)                        */
#define I2Cx_ADDR0_GC_Pos                 (0UL)                     /*!< GC (Bit 0)                                         */
#define I2Cx_ADDR0_GC_Msk                 (0x1UL)                   /*!< GC (Bitfield-Mask: 0x01)                           */
/* =========================================================  STAT  ========================================================== */
#define I2Cx_STAT_STAT_Pos                (0UL)                     /*!< STAT (Bit 0)                                       */
#define I2Cx_STAT_STAT_Msk                (0xffUL)                  /*!< STAT (Bitfield-Mask: 0xff)                         */
/* =========================================================  ADDR1  ========================================================= */
#define I2Cx_ADDR1_ADDR1_Pos              (1UL)                     /*!< ADDR1 (Bit 1)                                      */
#define I2Cx_ADDR1_ADDR1_Msk              (0xfeUL)                  /*!< ADDR1 (Bitfield-Mask: 0x7f)                        */
/* =========================================================  ADDR2  ========================================================= */
#define I2Cx_ADDR2_ADDR2_Pos              (1UL)                     /*!< ADDR2 (Bit 1)                                      */
#define I2Cx_ADDR2_ADDR2_Msk              (0xfeUL)                  /*!< ADDR2 (Bitfield-Mask: 0x7f)                        */
/* =========================================================  MATCH  ========================================================= */
#define I2Cx_MATCH_ADDR2_Pos              (2UL)                     /*!< ADDR2 (Bit 2)                                      */
#define I2Cx_MATCH_ADDR2_Msk              (0x4UL)                   /*!< ADDR2 (Bitfield-Mask: 0x01)                        */
#define I2Cx_MATCH_ADDR1_Pos              (1UL)                     /*!< ADDR1 (Bit 1)                                      */
#define I2Cx_MATCH_ADDR1_Msk              (0x2UL)                   /*!< ADDR1 (Bitfield-Mask: 0x01)                        */
#define I2Cx_MATCH_ADDR0_Pos              (0UL)                     /*!< ADDR0 (Bit 0)                                      */
#define I2Cx_MATCH_ADDR0_Msk              (0x1UL)                   /*!< ADDR0 (Bitfield-Mask: 0x01)                        */


/* =========================================================================================================================== */
/* ================                                           IWDT                                            ================ */
/* =========================================================================================================================== */

