rushairer/LearnCW32/Libraries/inc/cw32f030.h
#define SYSCTRL_MCO_DIV_Msk               (0x70UL)                  /*!< DIV (Bitfield-Mask: 0x07)                          */
#define SYSCTRL_MCO_SOURCE_Pos            (0UL)                     /*!< SOURCE (Bit 0)                                     */
#define SYSCTRL_MCO_SOURCE_Msk            (0xfUL)                   /*!< SOURCE (Bitfield-Mask: 0x0f)                       */
/* =========================================================  IRMOD  ========================================================= */
#define SYSCTRL_IRMOD_MOD_Pos             (0UL)                     /*!< MOD (Bit 0)                                        */
#define SYSCTRL_IRMOD_MOD_Msk             (0xfUL)                   /*!< MOD (Bitfield-Mask: 0x0f)                          */


/* =========================================================================================================================== */
/* ================                                           UART                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR1  ========================================================== */
#define UARTx_CR1_OVER_Pos                (9UL)                     /*!< OVER (Bit 9)                                       */
#define UARTx_CR1_OVER_Msk                (0x600UL)                 /*!< OVER (Bitfield-Mask: 0x03)                         */
#define UARTx_CR1_START_Pos               (8UL)                     /*!< START (Bit 8)                                      */
#define UARTx_CR1_START_Msk               (0x100UL)                 /*!< START (Bitfield-Mask: 0x01)                        */
#define UARTx_CR1_SYNC_Pos                (6UL)                     /*!< SYNC (Bit 6)                                       */
#define UARTx_CR1_SYNC_Msk                (0x40UL)                  /*!< SYNC (Bitfield-Mask: 0x01)                         */
#define UARTx_CR1_STOP_Pos                (4UL)                     /*!< STOP (Bit 4)                                       */
#define UARTx_CR1_STOP_Msk                (0x30UL)                  /*!< STOP (Bitfield-Mask: 0x03)                         */
#define UARTx_CR1_PARITY_Pos              (2UL)                     /*!< PARITY (Bit 2)                                     */
#define UARTx_CR1_PARITY_Msk              (0xcUL)                   /*!< PARITY (Bitfield-Mask: 0x03)                       */
#define UARTx_CR1_RXEN_Pos                (1UL)                     /*!< RXEN (Bit 1)                                       */
#define UARTx_CR1_RXEN_Msk                (0x2UL)                   /*!< RXEN (Bitfield-Mask: 0x01)                         */
#define UARTx_CR1_TXEN_Pos                (0UL)                     /*!< TXEN (Bit 0)                                       */
#define UARTx_CR1_TXEN_Msk                (0x1UL)                   /*!< TXEN (Bitfield-Mask: 0x01)                         */
/* ==========================================================  CR2  ========================================================== */
#define UARTx_CR2_SOURCE_Pos              (8UL)                     /*!< SOURCE (Bit 8)                                     */
#define UARTx_CR2_SOURCE_Msk              (0x300UL)                 /*!< SOURCE (Bitfield-Mask: 0x03)                       */
#define UARTx_CR2_DMATX_Pos               (7UL)                     /*!< DMATX (Bit 7)                                      */
#define UARTx_CR2_DMATX_Msk               (0x80UL)                  /*!< DMATX (Bitfield-Mask: 0x01)                        */
#define UARTx_CR2_DMARX_Pos               (6UL)                     /*!< DMARX (Bit 6)                                      */
#define UARTx_CR2_DMARX_Msk               (0x40UL)                  /*!< DMARX (Bitfield-Mask: 0x01)                        */
#define UARTx_CR2_TXINV_Pos               (5UL)                     /*!< TXINV (Bit 5)                                      */
#define UARTx_CR2_TXINV_Msk               (0x20UL)                  /*!< TXINV (Bitfield-Mask: 0x01)                        */
#define UARTx_CR2_RXINV_Pos               (4UL)                     /*!< RXINV (Bit 4)                                      */
#define UARTx_CR2_RXINV_Msk               (0x10UL)                  /*!< RXINV (Bitfield-Mask: 0x01)                        */
#define UARTx_CR2_RTSEN_Pos               (3UL)                     /*!< RTSEN (Bit 3)                                      */
#define UARTx_CR2_RTSEN_Msk               (0x8UL)                   /*!< RTSEN (Bitfield-Mask: 0x01)                        */
#define UARTx_CR2_CTSEN_Pos               (2UL)                     /*!< CTSEN (Bit 2)                                      */
#define UARTx_CR2_CTSEN_Msk               (0x4UL)                   /*!< CTSEN (Bitfield-Mask: 0x01)                        */
#define UARTx_CR2_SIGNAL_Pos              (1UL)                     /*!< SIGNAL (Bit 1)                                     */
#define UARTx_CR2_SIGNAL_Msk              (0x2UL)                   /*!< SIGNAL (Bitfield-Mask: 0x01)                       */
#define UARTx_CR2_ADDREN_Pos              (0UL)                     /*!< ADDREN (Bit 0)                                     */
#define UARTx_CR2_ADDREN_Msk              (0x1UL)                   /*!< ADDREN (Bitfield-Mask: 0x01)                       */
/* ==========================================================  IER  ========================================================== */
#define UARTx_IER_CTS_Pos                 (6UL)                     /*!< CTS (Bit 6)                                        */
#define UARTx_IER_CTS_Msk                 (0x40UL)                  /*!< CTS (Bitfield-Mask: 0x01)                          */
#define UARTx_IER_PE_Pos                  (4UL)                     /*!< PE (Bit 4)                                         */
#define UARTx_IER_PE_Msk                  (0x10UL)                  /*!< PE (Bitfield-Mask: 0x01)                           */
#define UARTx_IER_FE_Pos                  (3UL)                     /*!< FE (Bit 3)                                         */
#define UARTx_IER_FE_Msk                  (0x8UL)                   /*!< FE (Bitfield-Mask: 0x01)                           */
#define UARTx_IER_RC_Pos                  (2UL)                     /*!< RC (Bit 2)                                         */
#define UARTx_IER_RC_Msk                  (0x4UL)                   /*!< RC (Bitfield-Mask: 0x01)                           */
#define UARTx_IER_TC_Pos                  (1UL)                     /*!< TC (Bit 1)                                         */
#define UARTx_IER_TC_Msk                  (0x2UL)                   /*!< TC (Bitfield-Mask: 0x01)                           */
#define UARTx_IER_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                        */
#define UARTx_IER_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ISR  ========================================================== */
#define UARTx_ISR_TXBUSY_Pos              (8UL)                     /*!< TXBUSY (Bit 8)                                     */
#define UARTx_ISR_TXBUSY_Msk              (0x100UL)                 /*!< TXBUSY (Bitfield-Mask: 0x01)                       */
#define UARTx_ISR_CTSLV_Pos               (7UL)                     /*!< CTSLV (Bit 7)                                      */
#define UARTx_ISR_CTSLV_Msk               (0x80UL)                  /*!< CTSLV (Bitfield-Mask: 0x01)                        */
#define UARTx_ISR_CTS_Pos                 (6UL)                     /*!< CTS (Bit 6)                                        */
#define UARTx_ISR_CTS_Msk                 (0x40UL)                  /*!< CTS (Bitfield-Mask: 0x01)                          */
#define UARTx_ISR_MATCH_Pos               (5UL)                     /*!< MATCH (Bit 5)                                      */
#define UARTx_ISR_MATCH_Msk               (0x20UL)                  /*!< MATCH (Bitfield-Mask: 0x01)                        */
#define UARTx_ISR_PE_Pos                  (4UL)                     /*!< PE (Bit 4)                                         */
#define UARTx_ISR_PE_Msk                  (0x10UL)                  /*!< PE (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_FE_Pos                  (3UL)                     /*!< FE (Bit 3)                                         */
#define UARTx_ISR_FE_Msk                  (0x8UL)                   /*!< FE (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_RC_Pos                  (2UL)                     /*!< RC (Bit 2)                                         */
#define UARTx_ISR_RC_Msk                  (0x4UL)                   /*!< RC (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_TC_Pos                  (1UL)                     /*!< TC (Bit 1)                                         */
#define UARTx_ISR_TC_Msk                  (0x2UL)                   /*!< TC (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                        */
#define UARTx_ISR_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ICR  ========================================================== */
#define UARTx_ICR_CTS_Pos                 (6UL)                     /*!< CTS (Bit 6)                                        */
#define UARTx_ICR_CTS_Msk                 (0x40UL)                  /*!< CTS (Bitfield-Mask: 0x01)                          */
#define UARTx_ICR_PE_Pos                  (4UL)                     /*!< PE (Bit 4)                                         */
#define UARTx_ICR_PE_Msk                  (0x10UL)                  /*!< PE (Bitfield-Mask: 0x01)                           */
#define UARTx_ICR_FE_Pos                  (3UL)                     /*!< FE (Bit 3)                                         */
#define UARTx_ICR_FE_Msk                  (0x8UL)                   /*!< FE (Bitfield-Mask: 0x01)                           */
#define UARTx_ICR_RC_Pos                  (2UL)                     /*!< RC (Bit 2)                                         */
#define UARTx_ICR_RC_Msk                  (0x4UL)                   /*!< RC (Bitfield-Mask: 0x01)                           */
#define UARTx_ICR_TC_Pos                  (1UL)                     /*!< TC (Bit 1)                                         */
#define UARTx_ICR_TC_Msk                  (0x2UL)                   /*!< TC (Bitfield-Mask: 0x01)                           */
/* =========================================================  BRRI  ========================================================== */
#define UARTx_BRRI_BRRI_Pos               (0UL)                     /*!< BRRI (Bit 0)                                       */
#define UARTx_BRRI_BRRI_Msk               (0xffffUL)                /*!< BRRI (Bitfield-Mask: 0xffff)                       */
/* =========================================================  BRRF  ========================================================== */
#define UARTx_BRRF_BRRF_Pos               (0UL)                     /*!< BRRF (Bit 0)                                       */
#define UARTx_BRRF_BRRF_Msk               (0xfUL)                   /*!< BRRF (Bitfield-Mask: 0x0f)                         */
/* ==========================================================  RDR  ========================================================== */
#define UARTx_RDR_RDR_Pos                 (0UL)                     /*!< RDR (Bit 0)                                        */
#define UARTx_RDR_RDR_Msk                 (0x1ffUL)                 /*!< RDR (Bitfield-Mask: 0x1ff)                         */
/* ==========================================================  TDR  ========================================================== */
#define UARTx_TDR_TDR_Pos                 (0UL)                     /*!< TDR (Bit 0)                                        */
#define UARTx_TDR_TDR_Msk                 (0x1ffUL)                 /*!< TDR (Bitfield-Mask: 0x1ff)                         */
/* =========================================================  ADDR  ========================================================== */
#define UARTx_ADDR_ADDR_Pos               (0UL)                     /*!< ADDR (Bit 0)                                       */
#define UARTx_ADDR_ADDR_Msk               (0xffUL)                  /*!< ADDR (Bitfield-Mask: 0xff)                         */
/* =========================================================  MASK  ========================================================== */
#define UARTx_MASK_MASK_Pos               (0UL)                     /*!< MASK (Bit 0)                                       */
#define UARTx_MASK_MASK_Msk               (0xffUL)                  /*!< MASK (Bitfield-Mask: 0xff)                         */


/* =========================================================================================================================== */
/* ================                                            VC                                             ================ */
/* =========================================================================================================================== */

/* ==========================================================  DIV  ========================================================== */
#define VCx_DIV_VIN_Pos                   (7UL)                     /*!< VIN (Bit 7)                                        */
#define VCx_DIV_VIN_Msk                   (0x80UL)                  /*!< VIN (Bitfield-Mask: 0x01)                          */
#define VCx_DIV_EN_Pos                    (6UL)                     /*!< EN (Bit 6)                                         */
#define VCx_DIV_EN_Msk                    (0x40UL)                  /*!< EN (Bitfield-Mask: 0x01)                           */
#define VCx_DIV_DIV_Pos                   (0UL)                     /*!< DIV (Bit 0)                                        */
#define VCx_DIV_DIV_Msk                   (0x3fUL)                  /*!< DIV (Bitfield-Mask: 0x3f)                          */
/* ==========================================================  CR0  ========================================================== */
#define VCx_CR0_INN_Pos                   (12UL)                    /*!< INN (Bit 12)                                       */
#define VCx_CR0_INN_Msk                   (0xf000UL)                /*!< INN (Bitfield-Mask: 0x0f)                          */
#define VCx_CR0_INP_Pos                   (8UL)                     /*!< INP (Bit 8)                                        */
#define VCx_CR0_INP_Msk                   (0xf00UL)                 /*!< INP (Bitfield-Mask: 0x0f)                          */
#define VCx_CR0_WINDOW_Pos                (7UL)                     /*!< WINDOW (Bit 7)                                     */
#define VCx_CR0_WINDOW_Msk                (0x80UL)                  /*!< WINDOW (Bitfield-Mask: 0x01)                       */
#define VCx_CR0_POL_Pos                   (6UL)                     /*!< POL (Bit 6)                                        */
#define VCx_CR0_POL_Msk                   (0x40UL)                  /*!< POL (Bitfield-Mask: 0x01)                          */
#define VCx_CR0_IE_Pos                    (5UL)                     /*!< IE (Bit 5)                                         */
#define VCx_CR0_IE_Msk                    (0x20UL)                  /*!< IE (Bitfield-Mask: 0x01)                           */
#define VCx_CR0_HYS_Pos                   (3UL)                     /*!< HYS (Bit 3)                                        */
#define VCx_CR0_HYS_Msk                   (0x18UL)                  /*!< HYS (Bitfield-Mask: 0x03)                          */
#define VCx_CR0_RESP_Pos                  (1UL)                     /*!< RESP (Bit 1)                                       */
#define VCx_CR0_RESP_Msk                  (0x6UL)                   /*!< RESP (Bitfield-Mask: 0x03)                         */
#define VCx_CR0_EN_Pos                    (0UL)                     /*!< EN (Bit 0)                                         */
#define VCx_CR0_EN_Msk                    (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CR1  ========================================================== */
#define VCx_CR1_BLANKFLT_Pos              (13UL)                    /*!< BLANKFLT (Bit 13)                                  */
#define VCx_CR1_BLANKFLT_Msk              (0xe000UL)                /*!< BLANKFLT (Bitfield-Mask: 0x07)                     */
#define VCx_CR1_BLANKCH3B_Pos             (12UL)                    /*!< BLANKCH3B (Bit 12)                                 */
#define VCx_CR1_BLANKCH3B_Msk             (0x1000UL)                /*!< BLANKCH3B (Bitfield-Mask: 0x01)                    */
#define VCx_CR1_BLANKCH2B_Pos             (11UL)                    /*!< BLANKCH2B (Bit 11)                                 */
#define VCx_CR1_BLANKCH2B_Msk             (0x800UL)                 /*!< BLANKCH2B (Bitfield-Mask: 0x01)                    */
#define VCx_CR1_BLANKCH1B_Pos             (10UL)                    /*!< BLANKCH1B (Bit 10)                                 */
#define VCx_CR1_BLANKCH1B_Msk             (0x400UL)                 /*!< BLANKCH1B (Bitfield-Mask: 0x01)                    */
#define VCx_CR1_ATIMBK_Pos                (9UL)                     /*!< ATIMBK (Bit 9)                                     */
#define VCx_CR1_ATIMBK_Msk                (0x200UL)                 /*!< ATIMBK (Bitfield-Mask: 0x01)                       */
#define VCx_CR1_ATIMCLR_Pos               (8UL)                     /*!< ATIMCLR (Bit 8)                                    */
#define VCx_CR1_ATIMCLR_Msk               (0x100UL)                 /*!< ATIMCLR (Bitfield-Mask: 0x01)                      */
#define VCx_CR1_HIGHIE_Pos                (7UL)                     /*!< HIGHIE (Bit 7)                                     */
#define VCx_CR1_HIGHIE_Msk                (0x80UL)                  /*!< HIGHIE (Bitfield-Mask: 0x01)                       */
#define VCx_CR1_RISEIE_Pos                (6UL)                     /*!< RISEIE (Bit 6)                                     */
#define VCx_CR1_RISEIE_Msk                (0x40UL)                  /*!< RISEIE (Bitfield-Mask: 0x01)                       */
#define VCx_CR1_FALLIE_Pos                (5UL)                     /*!< FALLIE (Bit 5)                                     */
#define VCx_CR1_FALLIE_Msk                (0x20UL)                  /*!< FALLIE (Bitfield-Mask: 0x01)                       */
#define VCx_CR1_FLTCLK_Pos                (4UL)                     /*!< FLTCLK (Bit 4)                                     */
#define VCx_CR1_FLTCLK_Msk                (0x10UL)                  /*!< FLTCLK (Bitfield-Mask: 0x01)                       */
#define VCx_CR1_FLTTIME_Pos               (1UL)                     /*!< FLTTIME (Bit 1)                                    */
#define VCx_CR1_FLTTIME_Msk               (0xeUL)                   /*!< FLTTIME (Bitfield-Mask: 0x07)                      */
#define VCx_CR1_FLTEN_Pos                 (0UL)                     /*!< FLTEN (Bit 0)                                      */
#define VCx_CR1_FLTEN_Msk                 (0x1UL)                   /*!< FLTEN (Bitfield-Mask: 0x01)                        */
/* ==========================================================  SR  =========================================================== */
#define VCx_SR_READY_Pos                  (2UL)                     /*!< READY (Bit 2)                                      */
#define VCx_SR_READY_Msk                  (0x4UL)                   /*!< READY (Bitfield-Mask: 0x01)                        */
#define VCx_SR_FLTV_Pos                   (1UL)                     /*!< FLTV (Bit 1)                                       */
#define VCx_SR_FLTV_Msk                   (0x2UL)                   /*!< FLTV (Bitfield-Mask: 0x01)                         */
#define VCx_SR_INTF_Pos                   (0UL)                     /*!< INTF (Bit 0)                                       */
#define VCx_SR_INTF_Msk                   (0x1UL)                   /*!< INTF (Bitfield-Mask: 0x01)                         */


/* =========================================================================================================================== */
/* ================                                           WWDT                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR0  ========================================================== */
#define WWDT_CR0_EN_Pos                   (7UL)                     /*!< EN (Bit 7)                                         */
#define WWDT_CR0_EN_Msk                   (0x80UL)                  /*!< EN (Bitfield-Mask: 0x01)                           */
#define WWDT_CR0_WCNT_Pos                 (0UL)                     /*!< WCNT (Bit 0)                                       */
#define WWDT_CR0_WCNT_Msk                 (0x7fUL)                  /*!< WCNT (Bitfield-Mask: 0x7f)                         */
/* ==========================================================  CR1  ========================================================== */
#define WWDT_CR1_IE_Pos                   (10UL)                    /*!< IE (Bit 10)                                        */
#define WWDT_CR1_IE_Msk                   (0x400UL)                 /*!< IE (Bitfield-Mask: 0x01)                           */
#define WWDT_CR1_PRS_Pos                  (7UL)                     /*!< PRS (Bit 7)                                        */
#define WWDT_CR1_PRS_Msk                  (0x380UL)                 /*!< PRS (Bitfield-Mask: 0x07)                          */
#define WWDT_CR1_WINR_Pos                 (0UL)                     /*!< WINR (Bit 0)                                       */
#define WWDT_CR1_WINR_Msk                 (0x7fUL)                  /*!< WINR (Bitfield-Mask: 0x7f)                         */
/* ==========================================================  SR  =========================================================== */
#define WWDT_SR_POV_Pos                   (0UL)                     /*!< POV (Bit 0)                                        */
#define WWDT_SR_POV_Msk                   (0x1UL)                   /*!< POV (Bitfield-Mask: 0x01)                          */

/** @} */ /* End of group PosMask_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* CW32F030_H */


/** @} */ /* End of group cw32f030 */

/** @} */ /* End of group CW Co.Ltd */
